TMS320C2000 Assembler PC v15.12.1 Sat Jun 25 21:32:06 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\RJKJ_ZGH\AppData\Local\Temp\1012810                         PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                   PC v15.12.1.LTS *
       3              ;* Date/Time created: Sat Jun 25 21:32:06 2016                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=fpu32 --hll_source=on --mem_model:code=flat --mem_model:
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/work/DSP/Steering_Engine/F2833x/v141/DSP2833x_common/source/DSP2833x
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v15.12.1.LTS Copyright (c) 1996-201
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\work\DSP\Steering_Engine\F2833x\v141\DSP2833x_examples_ccsv5\fpu
      13                      .global _CpuTimer1
      14 00000000       _CpuTimer1:     .usect  ".ebss",8,1,1
      15              $C$DW$1 .dwtag  DW_TAG_variable

C:\Users\RJKJ_ZGH\AppData\Local\Temp\1012810                         PAGE    6

         0000004f 0048 
     251                      .dwpsn  file "D:/work/DSP/Steering_Engine/F2833x/v141/DSP2833x_common/source/DSP2833x_CpuTimers.c",li
     252 00000050 8A42          MOVL      XAR4,*-SP[2]          ; [CPU_] |90| 
     253 00000051 8AC4          MOVL      XAR4,*+XAR4[0]        ; [CPU_] |90| 
     254 00000052 0648          MOVL      ACC,*-SP[8]           ; [CPU_] |90| 
     255 00000053 1ED4          MOVL      *+XAR4[2],ACC         ; [CPU_] |90| 
     256                      .dwpsn  file "D:/work/DSP/Steering_Engine/F2833x/v141/DSP2833x_common/source/DSP2833x_CpuTimers.c",li
     257 00000054 8A42          MOVL      XAR4,*-SP[2]          ; [CPU_] |93| 
     258 00000055 8AC4          MOVL      XAR4,*+XAR4[0]        ; [CPU_] |93| 
     259 00000056 2BF4          MOV       *+XAR4[6],#0          ; [CPU_] |93| 
     260                      .dwpsn  file "D:/work/DSP/Steering_Engine/F2833x/v141/DSP2833x_common/source/DSP2833x_CpuTimers.c",li
     261 00000057 8A42          MOVL      XAR4,*-SP[2]          ; [CPU_] |94| 
     262 00000058 8AC4          MOVL      XAR4,*+XAR4[0]        ; [CPU_] |94| 
     263 00000059 2BFC          MOV       *+XAR4[7],#0          ; [CPU_] |94| 
     264                      .dwpsn  file "D:/work/DSP/Steering_Engine/F2833x/v141/DSP2833x_common/source/DSP2833x_CpuTimers.c",li
     265 0000005a 8A42          MOVL      XAR4,*-SP[2]          ; [CPU_] |97| 
     266 0000005b 8AC4          MOVL      XAR4,*+XAR4[0]        ; [CPU_] |97| 
     267 0000005c 1AE4          OR        *+XAR4[4],#0x0010     ; [CPU_] |97| 
         0000005d 0010 
     268                      .dwpsn  file "D:/work/DSP/Steering_Engine/F2833x/v141/DSP2833x_common/source/DSP2833x_CpuTimers.c",li
     269 0000005e 8A42          MOVL      XAR4,*-SP[2]          ; [CPU_] |98| 
     270 0000005f 8AC4          MOVL      XAR4,*+XAR4[0]        ; [CPU_] |98| 
     271 00000060 1AE4          OR        *+XAR4[4],#0x0020     ; [CPU_] |98| 
         00000061 0020 
     272                      .dwpsn  file "D:/work/DSP/Steering_Engine/F2833x/v141/DSP2833x_common/source/DSP2833x_CpuTimers.c",li
     273 00000062 8A42          MOVL      XAR4,*-SP[2]          ; [CPU_] |99| 
     274 00000063 8AC4          MOVL      XAR4,*+XAR4[0]        ; [CPU_] |99| 
     275 00000064 1AE4          OR        *+XAR4[4],#0x0400     ; [CPU_] |99| 
         00000065 0400 
     276                      .dwpsn  file "D:/work/DSP/Steering_Engine/F2833x/v141/DSP2833x_common/source/DSP2833x_CpuTimers.c",li
     277 00000066 8A42          MOVL      XAR4,*-SP[2]          ; [CPU_] |100| 
     278 00000067 8AC4          MOVL      XAR4,*+XAR4[0]        ; [CPU_] |100| 
     279 00000068 1AE4          OR        *+XAR4[4],#0x0800     ; [CPU_] |100| 
         00000069 0800 
     280                      .dwpsn  file "D:/work/DSP/Steering_Engine/F2833x/v141/DSP2833x_common/source/DSP2833x_CpuTimers.c",li
     281 0000006a 8A42          MOVL      XAR4,*-SP[2]          ; [CPU_] |101| 
     282 0000006b 8AC4          MOVL      XAR4,*+XAR4[0]        ; [CPU_] |101| 
     283 0000006c 1AE4          OR        *+XAR4[4],#0x4000     ; [CPU_] |101| 
         0000006d 4000 
     284                      .dwpsn  file "D:/work/DSP/Steering_Engine/F2833x/v141/DSP2833x_common/source/DSP2833x_CpuTimers.c",li
     285 0000006e 8A42          MOVL      XAR4,*-SP[2]          ; [CPU_] |104| 
     286 0000006f 0200          MOVB      ACC,#0                ; [CPU_] |104| 
     287 00000070 1ED4          MOVL      *+XAR4[2],ACC         ; [CPU_] |104| 
     288                      .dwpsn  file "D:/work/DSP/Steering_Engine/F2833x/v141/DSP2833x_common/source/DSP2833x_CpuTimers.c",li
     289 00000071 FE88          SUBB      SP,#8                 ; [CPU_U] 
     290                      .dwcfi  cfa_offset, -2
     291              $C$DW$17        .dwtag  DW_TAG_TI_branch
     292                      .dwattr $C$DW$17, DW_AT_low_pc(0x00)
     293                      .dwattr $C$DW$17, DW_AT_TI_return
     294              
     295 00000072 0006          LRETR     ; [CPU_] 
     296                      ; return occurs ; [] 
     297                      .dwattr $C$DW$9, DW_AT_TI_end_file("D:/work/DSP/Steering_Engine/F2833x/v141/DSP2833x_common/source/DS
     298                      .dwattr $C$DW$9, DW_AT_TI_end_line(0x69)
     299                      .dwattr $C$DW$9, DW_AT_TI_end_column(0x01)
TMS320C2000 Assembler PC v15.12.1 Sat Jun 25 21:32:06 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\RJKJ_ZGH\AppData\Local\Temp\1012810                         PAGE    7

     300                      .dwendentry
     301                      .dwendtag $C$DW$9
     302              
     303              ;**************************************************************
     304              ;* UNDEFINED EXTERNAL REFERENCES                              *
     305              ;**************************************************************
     306                      .global _CpuTimer1Regs
     307                      .global _CpuTimer2Regs
     308                      .global _CpuTimer0Regs
     309              
     310              ;***************************************************************
     311              ;* TYPE INFORMATION                                            *
     312              ;***************************************************************
     313              
     314              $C$DW$T$20      .dwtag  DW_TAG_structure_type
     315                      .dwattr $C$DW$T$20, DW_AT_name("CPUTIMER_REGS")
     316                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x08)
     317              $C$DW$18        .dwtag  DW_TAG_member
     318                      .dwattr $C$DW$18, DW_AT_type(*$C$DW$T$29)
     319                      .dwattr $C$DW$18, DW_AT_name("TIM")
     320                      .dwattr $C$DW$18, DW_AT_TI_symbol_name("_TIM")
     321                      .dwattr $C$DW$18, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     322                      .dwattr $C$DW$18, DW_AT_accessibility(DW_ACCESS_public)
     323              
     324              $C$DW$19        .dwtag  DW_TAG_member
     325                      .dwattr $C$DW$19, DW_AT_type(*$C$DW$T$25)
     326                      .dwattr $C$DW$19, DW_AT_name("PRD")
     327                      .dwattr $C$DW$19, DW_AT_TI_symbol_name("_PRD")
     328                      .dwattr $C$DW$19, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     329                      .dwattr $C$DW$19, DW_AT_accessibility(DW_ACCESS_public)
     330              
     331              $C$DW$20        .dwtag  DW_TAG_member
     332                      .dwattr $C$DW$20, DW_AT_type(*$C$DW$T$28)
     333                      .dwattr $C$DW$20, DW_AT_name("TCR")
     334                      .dwattr $C$DW$20, DW_AT_TI_symbol_name("_TCR")
     335                      .dwattr $C$DW$20, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     336                      .dwattr $C$DW$20, DW_AT_accessibility(DW_ACCESS_public)
     337              
     338              $C$DW$21        .dwtag  DW_TAG_member
     339                      .dwattr $C$DW$21, DW_AT_type(*$C$DW$T$19)
     340                      .dwattr $C$DW$21, DW_AT_name("rsvd1")
     341                      .dwattr $C$DW$21, DW_AT_TI_symbol_name("_rsvd1")
     342                      .dwattr $C$DW$21, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
     343                      .dwattr $C$DW$21, DW_AT_accessibility(DW_ACCESS_public)
     344              
     345              $C$DW$22        .dwtag  DW_TAG_member
     346                      .dwattr $C$DW$22, DW_AT_type(*$C$DW$T$34)
     347                      .dwattr $C$DW$22, DW_AT_name("TPR")
     348                      .dwattr $C$DW$22, DW_AT_TI_symbol_name("_TPR")
     349                      .dwattr $C$DW$22, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     350                      .dwattr $C$DW$22, DW_AT_accessibility(DW_ACCESS_public)
     351              
     352              $C$DW$23        .dwtag  DW_TAG_member
     353                      .dwattr $C$DW$23, DW_AT_type(*$C$DW$T$32)
     354                      .dwattr $C$DW$23, DW_AT_name("TPRH")
TMS320C2000 Assembler PC v15.12.1 Sat Jun 25 21:32:06 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\RJKJ_ZGH\AppData\Local\Temp\1012810                         PAGE    8

     355                      .dwattr $C$DW$23, DW_AT_TI_symbol_name("_TPRH")
     356                      .dwattr $C$DW$23, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
     357                      .dwattr $C$DW$23, DW_AT_accessibility(DW_ACCESS_public)
     358              
     359                      .dwendtag $C$DW$T$20
     360              
     361              $C$DW$24        .dwtag  DW_TAG_TI_far_type
     362                      .dwattr $C$DW$24, DW_AT_type(*$C$DW$T$20)
     363              
     364              $C$DW$T$21      .dwtag  DW_TAG_volatile_type
     365                      .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$24)
     366              
     367              $C$DW$T$22      .dwtag  DW_TAG_pointer_type
     368                      .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$21)
     369                      .dwattr $C$DW$T$22, DW_AT_address_class(0x20)
     370              
     371              
     372              $C$DW$T$24      .dwtag  DW_TAG_structure_type
     373                      .dwattr $C$DW$T$24, DW_AT_name("CPUTIMER_VARS")
     374                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x08)
     375              $C$DW$25        .dwtag  DW_TAG_member
     376                      .dwattr $C$DW$25, DW_AT_type(*$C$DW$T$22)
     377                      .dwattr $C$DW$25, DW_AT_name("RegsAddr")
     378                      .dwattr $C$DW$25, DW_AT_TI_symbol_name("_RegsAddr")
     379                      .dwattr $C$DW$25, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     380                      .dwattr $C$DW$25, DW_AT_accessibility(DW_ACCESS_public)
     381              
     382              $C$DW$26        .dwtag  DW_TAG_member
     383                      .dwattr $C$DW$26, DW_AT_type(*$C$DW$T$23)
     384                      .dwattr $C$DW$26, DW_AT_name("InterruptCount")
     385                      .dwattr $C$DW$26, DW_AT_TI_symbol_name("_InterruptCount")
     386                      .dwattr $C$DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     387                      .dwattr $C$DW$26, DW_AT_accessibility(DW_ACCESS_public)
     388              
     389              $C$DW$27        .dwtag  DW_TAG_member
     390                      .dwattr $C$DW$27, DW_AT_type(*$C$DW$T$16)
     391                      .dwattr $C$DW$27, DW_AT_name("CPUFreqInMHz")
     392                      .dwattr $C$DW$27, DW_AT_TI_symbol_name("_CPUFreqInMHz")
     393                      .dwattr $C$DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     394                      .dwattr $C$DW$27, DW_AT_accessibility(DW_ACCESS_public)
     395              
     396              $C$DW$28        .dwtag  DW_TAG_member
     397                      .dwattr $C$DW$28, DW_AT_type(*$C$DW$T$16)
     398                      .dwattr $C$DW$28, DW_AT_name("PeriodInUSec")
     399                      .dwattr $C$DW$28, DW_AT_TI_symbol_name("_PeriodInUSec")
     400                      .dwattr $C$DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     401                      .dwattr $C$DW$28, DW_AT_accessibility(DW_ACCESS_public)
     402              
     403                      .dwendtag $C$DW$T$24
     404              
     405              $C$DW$T$35      .dwtag  DW_TAG_pointer_type
     406                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$24)
     407                      .dwattr $C$DW$T$35, DW_AT_address_class(0x20)
     408              
     409              
TMS320C2000 Assembler PC v15.12.1 Sat Jun 25 21:32:06 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\RJKJ_ZGH\AppData\Local\Temp\1012810                         PAGE    9

     410              $C$DW$T$25      .dwtag  DW_TAG_union_type
     411                      .dwattr $C$DW$T$25, DW_AT_name("PRD_GROUP")
     412                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x02)
     413              $C$DW$29        .dwtag  DW_TAG_member
     414                      .dwattr $C$DW$29, DW_AT_type(*$C$DW$T$23)
     415                      .dwattr $C$DW$29, DW_AT_name("all")
     416                      .dwattr $C$DW$29, DW_AT_TI_symbol_name("_all")
     417                      .dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     418                      .dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
     419              
     420              $C$DW$30        .dwtag  DW_TAG_member
     421                      .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$26)
     422                      .dwattr $C$DW$30, DW_AT_name("half")
     423                      .dwattr $C$DW$30, DW_AT_TI_symbol_name("_half")
     424                      .dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     425                      .dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
     426              
     427                      .dwendtag $C$DW$T$25
     428              
     429              
     430              $C$DW$T$26      .dwtag  DW_TAG_structure_type
     431                      .dwattr $C$DW$T$26, DW_AT_name("PRD_REG")
     432                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x02)
     433              $C$DW$31        .dwtag  DW_TAG_member
     434                      .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$19)
     435                      .dwattr $C$DW$31, DW_AT_name("LSW")
     436                      .dwattr $C$DW$31, DW_AT_TI_symbol_name("_LSW")
     437                      .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     438                      .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
     439              
     440              $C$DW$32        .dwtag  DW_TAG_member
     441                      .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$19)
     442                      .dwattr $C$DW$32, DW_AT_name("MSW")
     443                      .dwattr $C$DW$32, DW_AT_TI_symbol_name("_MSW")
     444                      .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     445                      .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
     446              
     447                      .dwendtag $C$DW$T$26
     448              
     449              
     450              $C$DW$T$27      .dwtag  DW_TAG_structure_type
     451                      .dwattr $C$DW$T$27, DW_AT_name("TCR_BITS")
     452                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
     453              $C$DW$33        .dwtag  DW_TAG_member
     454                      .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$19)
     455                      .dwattr $C$DW$33, DW_AT_name("rsvd1")
     456                      .dwattr $C$DW$33, DW_AT_TI_symbol_name("_rsvd1")
     457                      .dwattr $C$DW$33, DW_AT_bit_offset(0x0c)
     458                      .dwattr $C$DW$33, DW_AT_bit_size(0x04)
     459                      .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     460                      .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
     461              
     462              $C$DW$34        .dwtag  DW_TAG_member
     463                      .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$19)
     464                      .dwattr $C$DW$34, DW_AT_name("TSS")
TMS320C2000 Assembler PC v15.12.1 Sat Jun 25 21:32:06 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\RJKJ_ZGH\AppData\Local\Temp\1012810                         PAGE   10

     465                      .dwattr $C$DW$34, DW_AT_TI_symbol_name("_TSS")
     466                      .dwattr $C$DW$34, DW_AT_bit_offset(0x0b)
     467                      .dwattr $C$DW$34, DW_AT_bit_size(0x01)
     468                      .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     469                      .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
     470              
     471              $C$DW$35        .dwtag  DW_TAG_member
     472                      .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$19)
     473                      .dwattr $C$DW$35, DW_AT_name("TRB")
     474                      .dwattr $C$DW$35, DW_AT_TI_symbol_name("_TRB")
     475                      .dwattr $C$DW$35, DW_AT_bit_offset(0x0a)
     476                      .dwattr $C$DW$35, DW_AT_bit_size(0x01)
     477                      .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     478                      .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     479              
     480              $C$DW$36        .dwtag  DW_TAG_member
     481                      .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$19)
     482                      .dwattr $C$DW$36, DW_AT_name("rsvd2")
     483                      .dwattr $C$DW$36, DW_AT_TI_symbol_name("_rsvd2")
     484                      .dwattr $C$DW$36, DW_AT_bit_offset(0x06)
     485                      .dwattr $C$DW$36, DW_AT_bit_size(0x04)
     486                      .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     487                      .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
     488              
     489              $C$DW$37        .dwtag  DW_TAG_member
     490                      .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$19)
     491                      .dwattr $C$DW$37, DW_AT_name("SOFT")
     492                      .dwattr $C$DW$37, DW_AT_TI_symbol_name("_SOFT")
     493                      .dwattr $C$DW$37, DW_AT_bit_offset(0x05)
     494                      .dwattr $C$DW$37, DW_AT_bit_size(0x01)
     495                      .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     496                      .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
     497              
     498              $C$DW$38        .dwtag  DW_TAG_member
     499                      .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$19)
     500                      .dwattr $C$DW$38, DW_AT_name("FREE")
     501                      .dwattr $C$DW$38, DW_AT_TI_symbol_name("_FREE")
     502                      .dwattr $C$DW$38, DW_AT_bit_offset(0x04)
     503                      .dwattr $C$DW$38, DW_AT_bit_size(0x01)
     504                      .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     505                      .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     506              
     507              $C$DW$39        .dwtag  DW_TAG_member
     508                      .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$19)
     509                      .dwattr $C$DW$39, DW_AT_name("rsvd3")
     510                      .dwattr $C$DW$39, DW_AT_TI_symbol_name("_rsvd3")
     511                      .dwattr $C$DW$39, DW_AT_bit_offset(0x02)
     512                      .dwattr $C$DW$39, DW_AT_bit_size(0x02)
     513                      .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     514                      .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     515              
     516              $C$DW$40        .dwtag  DW_TAG_member
     517                      .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$19)
     518                      .dwattr $C$DW$40, DW_AT_name("TIE")
     519                      .dwattr $C$DW$40, DW_AT_TI_symbol_name("_TIE")
TMS320C2000 Assembler PC v15.12.1 Sat Jun 25 21:32:06 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\RJKJ_ZGH\AppData\Local\Temp\1012810                         PAGE   11

     520                      .dwattr $C$DW$40, DW_AT_bit_offset(0x01)
     521                      .dwattr $C$DW$40, DW_AT_bit_size(0x01)
     522                      .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     523                      .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     524              
     525              $C$DW$41        .dwtag  DW_TAG_member
     526                      .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$19)
     527                      .dwattr $C$DW$41, DW_AT_name("TIF")
     528                      .dwattr $C$DW$41, DW_AT_TI_symbol_name("_TIF")
     529                      .dwattr $C$DW$41, DW_AT_bit_offset(0x00)
     530                      .dwattr $C$DW$41, DW_AT_bit_size(0x01)
     531                      .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     532                      .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     533              
     534                      .dwendtag $C$DW$T$27
     535              
     536              
     537              $C$DW$T$28      .dwtag  DW_TAG_union_type
     538                      .dwattr $C$DW$T$28, DW_AT_name("TCR_REG")
     539                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x01)
     540              $C$DW$42        .dwtag  DW_TAG_member
     541                      .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$19)
     542                      .dwattr $C$DW$42, DW_AT_name("all")
     543                      .dwattr $C$DW$42, DW_AT_TI_symbol_name("_all")
     544                      .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     545                      .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     546              
     547              $C$DW$43        .dwtag  DW_TAG_member
     548                      .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$27)
     549                      .dwattr $C$DW$43, DW_AT_name("bit")
     550                      .dwattr $C$DW$43, DW_AT_TI_symbol_name("_bit")
     551                      .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     552                      .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     553              
     554                      .dwendtag $C$DW$T$28
     555              
     556              
     557              $C$DW$T$29      .dwtag  DW_TAG_union_type
     558                      .dwattr $C$DW$T$29, DW_AT_name("TIM_GROUP")
     559                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x02)
     560              $C$DW$44        .dwtag  DW_TAG_member
     561                      .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$23)
     562                      .dwattr $C$DW$44, DW_AT_name("all")
     563                      .dwattr $C$DW$44, DW_AT_TI_symbol_name("_all")
     564                      .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     565                      .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     566              
     567              $C$DW$45        .dwtag  DW_TAG_member
     568                      .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$30)
     569                      .dwattr $C$DW$45, DW_AT_name("half")
     570                      .dwattr $C$DW$45, DW_AT_TI_symbol_name("_half")
     571                      .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     572                      .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     573              
     574                      .dwendtag $C$DW$T$29
TMS320C2000 Assembler PC v15.12.1 Sat Jun 25 21:32:06 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\RJKJ_ZGH\AppData\Local\Temp\1012810                         PAGE   12

     575              
     576              
     577              $C$DW$T$30      .dwtag  DW_TAG_structure_type
     578                      .dwattr $C$DW$T$30, DW_AT_name("TIM_REG")
     579                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x02)
     580              $C$DW$46        .dwtag  DW_TAG_member
     581                      .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$19)
     582                      .dwattr $C$DW$46, DW_AT_name("LSW")
     583                      .dwattr $C$DW$46, DW_AT_TI_symbol_name("_LSW")
     584                      .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     585                      .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     586              
     587              $C$DW$47        .dwtag  DW_TAG_member
     588                      .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$19)
     589                      .dwattr $C$DW$47, DW_AT_name("MSW")
     590                      .dwattr $C$DW$47, DW_AT_TI_symbol_name("_MSW")
     591                      .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     592                      .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     593              
     594                      .dwendtag $C$DW$T$30
     595              
     596              
     597              $C$DW$T$31      .dwtag  DW_TAG_structure_type
     598                      .dwattr $C$DW$T$31, DW_AT_name("TPRH_BITS")
     599                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x01)
     600              $C$DW$48        .dwtag  DW_TAG_member
     601                      .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$19)
     602                      .dwattr $C$DW$48, DW_AT_name("TDDRH")
     603                      .dwattr $C$DW$48, DW_AT_TI_symbol_name("_TDDRH")
     604                      .dwattr $C$DW$48, DW_AT_bit_offset(0x08)
     605                      .dwattr $C$DW$48, DW_AT_bit_size(0x08)
     606                      .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     607                      .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     608              
     609              $C$DW$49        .dwtag  DW_TAG_member
     610                      .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$19)
     611                      .dwattr $C$DW$49, DW_AT_name("PSCH")
     612                      .dwattr $C$DW$49, DW_AT_TI_symbol_name("_PSCH")
     613                      .dwattr $C$DW$49, DW_AT_bit_offset(0x00)
     614                      .dwattr $C$DW$49, DW_AT_bit_size(0x08)
     615                      .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     616                      .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     617              
     618                      .dwendtag $C$DW$T$31
     619              
     620              
     621              $C$DW$T$32      .dwtag  DW_TAG_union_type
     622                      .dwattr $C$DW$T$32, DW_AT_name("TPRH_REG")
     623                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x01)
     624              $C$DW$50        .dwtag  DW_TAG_member
     625                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$19)
     626                      .dwattr $C$DW$50, DW_AT_name("all")
     627                      .dwattr $C$DW$50, DW_AT_TI_symbol_name("_all")
     628                      .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     629                      .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.1 Sat Jun 25 21:32:06 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\RJKJ_ZGH\AppData\Local\Temp\1012810                         PAGE   13

     630              
     631              $C$DW$51        .dwtag  DW_TAG_member
     632                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$31)
     633                      .dwattr $C$DW$51, DW_AT_name("bit")
     634                      .dwattr $C$DW$51, DW_AT_TI_symbol_name("_bit")
     635                      .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     636                      .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     637              
     638                      .dwendtag $C$DW$T$32
     639              
     640              
     641              $C$DW$T$33      .dwtag  DW_TAG_structure_type
     642                      .dwattr $C$DW$T$33, DW_AT_name("TPR_BITS")
     643                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
     644              $C$DW$52        .dwtag  DW_TAG_member
     645                      .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$19)
     646                      .dwattr $C$DW$52, DW_AT_name("TDDR")
     647                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_TDDR")
     648                      .dwattr $C$DW$52, DW_AT_bit_offset(0x08)
     649                      .dwattr $C$DW$52, DW_AT_bit_size(0x08)
     650                      .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     651                      .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     652              
     653              $C$DW$53        .dwtag  DW_TAG_member
     654                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$19)
     655                      .dwattr $C$DW$53, DW_AT_name("PSC")
     656                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_PSC")
     657                      .dwattr $C$DW$53, DW_AT_bit_offset(0x00)
     658                      .dwattr $C$DW$53, DW_AT_bit_size(0x08)
     659                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     660                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     661              
     662                      .dwendtag $C$DW$T$33
     663              
     664              
     665              $C$DW$T$34      .dwtag  DW_TAG_union_type
     666                      .dwattr $C$DW$T$34, DW_AT_name("TPR_REG")
     667                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
     668              $C$DW$54        .dwtag  DW_TAG_member
     669                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$19)
     670                      .dwattr $C$DW$54, DW_AT_name("all")
     671                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_all")
     672                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     673                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     674              
     675              $C$DW$55        .dwtag  DW_TAG_member
     676                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$33)
     677                      .dwattr $C$DW$55, DW_AT_name("bit")
     678                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_bit")
     679                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     680                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     681              
     682                      .dwendtag $C$DW$T$34
     683              
     684              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
TMS320C2000 Assembler PC v15.12.1 Sat Jun 25 21:32:06 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\RJKJ_ZGH\AppData\Local\Temp\1012810                         PAGE   14

     685                      .dwattr $C$DW$T$2, DW_AT_name("void")
     686              
     687              $C$DW$T$4       .dwtag  DW_TAG_base_type
     688                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
     689                      .dwattr $C$DW$T$4, DW_AT_name("bool")
     690                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
     691              
     692              $C$DW$T$5       .dwtag  DW_TAG_base_type
     693                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
     694                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
     695                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
     696              
     697              $C$DW$T$6       .dwtag  DW_TAG_base_type
     698                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
     699                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
     700                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
     701              
     702              $C$DW$T$7       .dwtag  DW_TAG_base_type
     703                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
     704                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
     705                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
     706              
     707              $C$DW$T$8       .dwtag  DW_TAG_base_type
     708                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
     709                      .dwattr $C$DW$T$8, DW_AT_name("short")
     710                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
     711              
     712              $C$DW$T$9       .dwtag  DW_TAG_base_type
     713                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
     714                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
     715                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
     716              
     717              $C$DW$T$10      .dwtag  DW_TAG_base_type
     718                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
     719                      .dwattr $C$DW$T$10, DW_AT_name("int")
     720                      .dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
     721              
     722              $C$DW$T$11      .dwtag  DW_TAG_base_type
     723                      .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
     724                      .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
     725                      .dwattr $C$DW$T$11, DW_AT_byte_size(0x01)
     726              
     727              $C$DW$T$19      .dwtag  DW_TAG_typedef
     728                      .dwattr $C$DW$T$19, DW_AT_name("Uint16")
     729                      .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$11)
     730                      .dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
     731              
     732              $C$DW$T$12      .dwtag  DW_TAG_base_type
     733                      .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
     734                      .dwattr $C$DW$T$12, DW_AT_name("long")
     735                      .dwattr $C$DW$T$12, DW_AT_byte_size(0x02)
     736              
     737              $C$DW$T$13      .dwtag  DW_TAG_base_type
     738                      .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
     739                      .dwattr $C$DW$T$13, DW_AT_name("unsigned long")
TMS320C2000 Assembler PC v15.12.1 Sat Jun 25 21:32:06 2016

