TMS320C2000 Assembler PC v15.12.1 Sat Jun 25 21:32:08 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\RJKJ_ZGH\AppData\Local\Temp\0267210                         PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                   PC v15.12.1.LTS *
       3              ;* Date/Time created: Sat Jun 25 21:32:08 2016                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=fpu32 --hll_source=on --mem_model:code=flat --mem_model:
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/work/DSP/Steering_Engine/F2833x/v141/DSP2833x_common/source/DSP2833x
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v15.12.1.LTS Copyright (c) 1996-201
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\work\DSP\Steering_Engine\F2833x\v141\DSP2833x_examples_ccsv5\fpu
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("DINTCH2_ISR")

     900                      .dwattr $C$DW$83, DW_AT_TI_end_line(0xc9)
     901                      .dwattr $C$DW$83, DW_AT_TI_end_column(0x01)
     902                      .dwendentry
     903                      .dwendtag $C$DW$83
     904              
     905              ;**************************************************************
     906              ;* UNDEFINED EXTERNAL REFERENCES                              *
     907              ;**************************************************************
     908                      .global _DINTCH2_ISR
     909                      .global _DINTCH3_ISR
     910                      .global _MXINTB_ISR
     911                      .global _DINTCH1_ISR
     912                      .global _MRINTB_ISR
     913                      .global _I2CINT1A_ISR
TMS320C2000 Assembler PC v15.12.1 Sat Jun 25 21:32:08 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\RJKJ_ZGH\AppData\Local\Temp\0267210                         PAGE   20

     914                      .global _I2CINT2A_ISR
     915                      .global _DINTCH5_ISR
     916                      .global _DINTCH6_ISR
     917                      .global _DINTCH4_ISR
     918                      .global _ECAP6_INT_ISR
     919                      .global _EQEP1_INT_ISR
     920                      .global _ECAP4_INT_ISR
     921                      .global _ECAP5_INT_ISR
     922                      .global _ECAP3_INT_ISR
     923                      .global _MRINTA_ISR
     924                      .global _MXINTA_ISR
     925                      .global _SPIRXINTA_ISR
     926                      .global _SPITXINTA_ISR
     927                      .global _EQEP2_INT_ISR
     928                      .global _XINT6_ISR
     929                      .global _XINT7_ISR
     930                      .global _XINT4_ISR
     931                      .global _XINT5_ISR
     932                      .global _XINT3_ISR
     933                      .global _rsvd_ISR
     934                      .global _LUF_ISR
     935                      .global _PIE_RESERVED
     936                      .global _LVF_ISR
     937                      .global _SCITXINTA_ISR
     938                      .global _SCIRXINTB_ISR
     939                      .global _SCITXINTC_ISR
     940                      .global _SCIRXINTA_ISR
     941                      .global _SCIRXINTC_ISR
     942                      .global _ECAN0INTB_ISR
     943                      .global _ECAN1INTB_ISR
     944                      .global _ECAN0INTA_ISR
     945                      .global _ECAN1INTA_ISR
     946                      .global _SCITXINTB_ISR
     947                      .global _USER7_ISR
     948                      .global _USER8_ISR
     949                      .global _USER5_ISR
     950                      .global _USER6_ISR
     951                      .global _USER4_ISR
     952                      .global _USER12_ISR
     953                      .global _SEQ1INT_ISR
     954                      .global _USER10_ISR
     955                      .global _USER11_ISR
     956                      .global _USER9_ISR
     957                      .global _RTOSINT_ISR
     958                      .global _EMUINT_ISR
     959                      .global _INT14_ISR
     960                      .global _DATALOG_ISR
     961                      .global _INT13_ISR
     962                      .global _USER2_ISR
     963                      .global _USER3_ISR
     964                      .global _ILLEGAL_ISR
     965                      .global _USER1_ISR
     966                      .global _NMI_ISR
     967                      .global _EPWM2_INT_ISR
     968                      .global _EPWM3_INT_ISR
TMS320C2000 Assembler PC v15.12.1 Sat Jun 25 21:32:08 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\RJKJ_ZGH\AppData\Local\Temp\0267210                         PAGE   21

     969                      .global _EPWM6_TZINT_ISR
     970                      .global _EPWM1_INT_ISR
     971                      .global _EPWM5_TZINT_ISR
     972                      .global _ECAP1_INT_ISR
     973                      .global _ECAP2_INT_ISR
     974                      .global _EPWM5_INT_ISR
     975                      .global _EPWM6_INT_ISR
     976                      .global _EPWM4_INT_ISR
     977                      .global _ADCINT_ISR
     978                      .global _TINT0_ISR
     979                      .global _XINT1_ISR
     980                      .global _XINT2_ISR
     981                      .global _SEQ2INT_ISR
     982                      .global _EPWM3_TZINT_ISR
     983                      .global _EPWM4_TZINT_ISR
     984                      .global _EPWM1_TZINT_ISR
     985                      .global _EPWM2_TZINT_ISR
     986                      .global _WAKEINT_ISR
     987                      .global _PieCtrlRegs
     988                      .global _PieVectTable
     989              
     990              ;***************************************************************
     991              ;* TYPE INFORMATION                                            *
     992              ;***************************************************************
     993              
     994              $C$DW$T$20      .dwtag  DW_TAG_structure_type
     995                      .dwattr $C$DW$T$20, DW_AT_name("PIEACK_BITS")
     996                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x01)
     997              $C$DW$88        .dwtag  DW_TAG_member
     998                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$19)
     999                      .dwattr $C$DW$88, DW_AT_name("ACK1")
    1000                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_ACK1")
    1001                      .dwattr $C$DW$88, DW_AT_bit_offset(0x0f)
    1002                      .dwattr $C$DW$88, DW_AT_bit_size(0x01)
    1003                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1004                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1005              
    1006              $C$DW$89        .dwtag  DW_TAG_member
    1007                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$19)
    1008                      .dwattr $C$DW$89, DW_AT_name("ACK2")
    1009                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_ACK2")
    1010                      .dwattr $C$DW$89, DW_AT_bit_offset(0x0e)
    1011                      .dwattr $C$DW$89, DW_AT_bit_size(0x01)
    1012                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1013                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1014              
    1015              $C$DW$90        .dwtag  DW_TAG_member
    1016                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$19)
    1017                      .dwattr $C$DW$90, DW_AT_name("ACK3")
    1018                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_ACK3")
    1019                      .dwattr $C$DW$90, DW_AT_bit_offset(0x0d)
    1020                      .dwattr $C$DW$90, DW_AT_bit_size(0x01)
    1021                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1022                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1023              
TMS320C2000 Assembler PC v15.12.1 Sat Jun 25 21:32:08 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\RJKJ_ZGH\AppData\Local\Temp\0267210                         PAGE   22

    1024              $C$DW$91        .dwtag  DW_TAG_member
    1025                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$19)
    1026                      .dwattr $C$DW$91, DW_AT_name("ACK4")
    1027                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_ACK4")
    1028                      .dwattr $C$DW$91, DW_AT_bit_offset(0x0c)
    1029                      .dwattr $C$DW$91, DW_AT_bit_size(0x01)
    1030                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1031                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1032              
    1033              $C$DW$92        .dwtag  DW_TAG_member
    1034                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$19)
    1035                      .dwattr $C$DW$92, DW_AT_name("ACK5")
    1036                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_ACK5")
    1037                      .dwattr $C$DW$92, DW_AT_bit_offset(0x0b)
    1038                      .dwattr $C$DW$92, DW_AT_bit_size(0x01)
    1039                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1040                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1041              
    1042              $C$DW$93        .dwtag  DW_TAG_member
    1043                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$19)
    1044                      .dwattr $C$DW$93, DW_AT_name("ACK6")
    1045                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_ACK6")
    1046                      .dwattr $C$DW$93, DW_AT_bit_offset(0x0a)
    1047                      .dwattr $C$DW$93, DW_AT_bit_size(0x01)
    1048                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1049                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1050              
    1051              $C$DW$94        .dwtag  DW_TAG_member
    1052                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$19)
    1053                      .dwattr $C$DW$94, DW_AT_name("ACK7")
    1054                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_ACK7")
    1055                      .dwattr $C$DW$94, DW_AT_bit_offset(0x09)
    1056                      .dwattr $C$DW$94, DW_AT_bit_size(0x01)
    1057                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1058                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1059              
    1060              $C$DW$95        .dwtag  DW_TAG_member
    1061                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
    1062                      .dwattr $C$DW$95, DW_AT_name("ACK8")
    1063                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_ACK8")
    1064                      .dwattr $C$DW$95, DW_AT_bit_offset(0x08)
    1065                      .dwattr $C$DW$95, DW_AT_bit_size(0x01)
    1066                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1067                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1068              
    1069              $C$DW$96        .dwtag  DW_TAG_member
    1070                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$19)
    1071                      .dwattr $C$DW$96, DW_AT_name("ACK9")
    1072                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_ACK9")
    1073                      .dwattr $C$DW$96, DW_AT_bit_offset(0x07)
    1074                      .dwattr $C$DW$96, DW_AT_bit_size(0x01)
    1075                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1076                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1077              
    1078              $C$DW$97        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.1 Sat Jun 25 21:32:08 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\RJKJ_ZGH\AppData\Local\Temp\0267210                         PAGE   23

    1079                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$19)
    1080                      .dwattr $C$DW$97, DW_AT_name("ACK10")
    1081                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_ACK10")
    1082                      .dwattr $C$DW$97, DW_AT_bit_offset(0x06)
    1083                      .dwattr $C$DW$97, DW_AT_bit_size(0x01)
    1084                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1085                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1086              
    1087              $C$DW$98        .dwtag  DW_TAG_member
    1088                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$19)
    1089                      .dwattr $C$DW$98, DW_AT_name("ACK11")
    1090                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_ACK11")
    1091                      .dwattr $C$DW$98, DW_AT_bit_offset(0x05)
    1092                      .dwattr $C$DW$98, DW_AT_bit_size(0x01)
    1093                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1094                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1095              
    1096              $C$DW$99        .dwtag  DW_TAG_member
    1097                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$19)
    1098                      .dwattr $C$DW$99, DW_AT_name("ACK12")
    1099                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_ACK12")
    1100                      .dwattr $C$DW$99, DW_AT_bit_offset(0x04)
    1101                      .dwattr $C$DW$99, DW_AT_bit_size(0x01)
    1102                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1103                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1104              
    1105              $C$DW$100       .dwtag  DW_TAG_member
    1106                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$19)
    1107                      .dwattr $C$DW$100, DW_AT_name("rsvd")
    1108                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_rsvd")
    1109                      .dwattr $C$DW$100, DW_AT_bit_offset(0x00)
    1110                      .dwattr $C$DW$100, DW_AT_bit_size(0x04)
    1111                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1112                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1113              
    1114                      .dwendtag $C$DW$T$20
    1115              
    1116              
    1117              $C$DW$T$21      .dwtag  DW_TAG_union_type
    1118                      .dwattr $C$DW$T$21, DW_AT_name("PIEACK_REG")
    1119                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x01)
    1120              $C$DW$101       .dwtag  DW_TAG_member
    1121                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$19)
    1122                      .dwattr $C$DW$101, DW_AT_name("all")
    1123                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_all")
    1124                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1125                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1126              
    1127              $C$DW$102       .dwtag  DW_TAG_member
    1128                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$20)
    1129                      .dwattr $C$DW$102, DW_AT_name("bit")
    1130                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_bit")
    1131                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1132                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1133              
TMS320C2000 Assembler PC v15.12.1 Sat Jun 25 21:32:08 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\RJKJ_ZGH\AppData\Local\Temp\0267210                         PAGE   24

    1134                      .dwendtag $C$DW$T$21
    1135              
    1136              
    1137              $C$DW$T$22      .dwtag  DW_TAG_structure_type
    1138                      .dwattr $C$DW$T$22, DW_AT_name("PIECTRL_BITS")
    1139                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x01)
    1140              $C$DW$103       .dwtag  DW_TAG_member
    1141                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$19)
    1142                      .dwattr $C$DW$103, DW_AT_name("ENPIE")
    1143                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_ENPIE")
    1144                      .dwattr $C$DW$103, DW_AT_bit_offset(0x0f)
    1145                      .dwattr $C$DW$103, DW_AT_bit_size(0x01)
    1146                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1147                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1148              
    1149              $C$DW$104       .dwtag  DW_TAG_member
    1150                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
    1151                      .dwattr $C$DW$104, DW_AT_name("PIEVECT")
    1152                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_PIEVECT")
    1153                      .dwattr $C$DW$104, DW_AT_bit_offset(0x00)
    1154                      .dwattr $C$DW$104, DW_AT_bit_size(0x0f)
    1155                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1156                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1157              
    1158                      .dwendtag $C$DW$T$22
    1159              
    1160              
    1161              $C$DW$T$23      .dwtag  DW_TAG_union_type
    1162                      .dwattr $C$DW$T$23, DW_AT_name("PIECTRL_REG")
    1163                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x01)
    1164              $C$DW$105       .dwtag  DW_TAG_member
    1165                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$19)
    1166                      .dwattr $C$DW$105, DW_AT_name("all")
    1167                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_all")
    1168                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1169                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1170              
    1171              $C$DW$106       .dwtag  DW_TAG_member
    1172                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$22)
    1173                      .dwattr $C$DW$106, DW_AT_name("bit")
    1174                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_bit")
    1175                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1176                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1177              
    1178                      .dwendtag $C$DW$T$23
    1179              
    1180              
    1181              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    1182                      .dwattr $C$DW$T$24, DW_AT_name("PIEIER_BITS")
    1183                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x01)
    1184              $C$DW$107       .dwtag  DW_TAG_member
    1185                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$19)
    1186                      .dwattr $C$DW$107, DW_AT_name("INTx1")
    1187                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_INTx1")
    1188                      .dwattr $C$DW$107, DW_AT_bit_offset(0x0f)
TMS320C2000 Assembler PC v15.12.1 Sat Jun 25 21:32:08 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\RJKJ_ZGH\AppData\Local\Temp\0267210                         PAGE   25

    1189                      .dwattr $C$DW$107, DW_AT_bit_size(0x01)
    1190                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1191                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1192              
    1193              $C$DW$108       .dwtag  DW_TAG_member
    1194                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$19)
    1195                      .dwattr $C$DW$108, DW_AT_name("INTx2")
    1196                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_INTx2")
    1197                      .dwattr $C$DW$108, DW_AT_bit_offset(0x0e)
    1198                      .dwattr $C$DW$108, DW_AT_bit_size(0x01)
    1199                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1200                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1201              
    1202              $C$DW$109       .dwtag  DW_TAG_member
    1203                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
    1204                      .dwattr $C$DW$109, DW_AT_name("INTx3")
    1205                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_INTx3")
    1206                      .dwattr $C$DW$109, DW_AT_bit_offset(0x0d)
    1207                      .dwattr $C$DW$109, DW_AT_bit_size(0x01)
    1208                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1209                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1210              
    1211              $C$DW$110       .dwtag  DW_TAG_member
    1212                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
    1213                      .dwattr $C$DW$110, DW_AT_name("INTx4")
    1214                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_INTx4")
    1215                      .dwattr $C$DW$110, DW_AT_bit_offset(0x0c)
    1216                      .dwattr $C$DW$110, DW_AT_bit_size(0x01)
    1217                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1218                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1219              
    1220              $C$DW$111       .dwtag  DW_TAG_member
    1221                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    1222                      .dwattr $C$DW$111, DW_AT_name("INTx5")
    1223                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_INTx5")
    1224                      .dwattr $C$DW$111, DW_AT_bit_offset(0x0b)
    1225                      .dwattr $C$DW$111, DW_AT_bit_size(0x01)
    1226                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1227                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1228              
    1229              $C$DW$112       .dwtag  DW_TAG_member
    1230                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
    1231                      .dwattr $C$DW$112, DW_AT_name("INTx6")
    1232                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_INTx6")
    1233                      .dwattr $C$DW$112, DW_AT_bit_offset(0x0a)
    1234                      .dwattr $C$DW$112, DW_AT_bit_size(0x01)
    1235                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1236                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1237              
    1238              $C$DW$113       .dwtag  DW_TAG_member
    1239                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
    1240                      .dwattr $C$DW$113, DW_AT_name("INTx7")
    1241                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_INTx7")
    1242                      .dwattr $C$DW$113, DW_AT_bit_offset(0x09)
    1243                      .dwattr $C$DW$113, DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v15.12.1 Sat Jun 25 21:32:08 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\RJKJ_ZGH\AppData\Local\Temp\0267210                         PAGE   26

    1244                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1245                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1246              
    1247              $C$DW$114       .dwtag  DW_TAG_member
    1248                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
    1249                      .dwattr $C$DW$114, DW_AT_name("INTx8")
    1250                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_INTx8")
    1251                      .dwattr $C$DW$114, DW_AT_bit_offset(0x08)
    1252                      .dwattr $C$DW$114, DW_AT_bit_size(0x01)
    1253                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1254                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1255              
    1256              $C$DW$115       .dwtag  DW_TAG_member
    1257                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
    1258                      .dwattr $C$DW$115, DW_AT_name("rsvd")
    1259                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_rsvd")
    1260                      .dwattr $C$DW$115, DW_AT_bit_offset(0x00)
    1261                      .dwattr $C$DW$115, DW_AT_bit_size(0x08)
    1262                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1263                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1264              
    1265                      .dwendtag $C$DW$T$24
    1266              
    1267              
    1268              $C$DW$T$25      .dwtag  DW_TAG_union_type
    1269                      .dwattr $C$DW$T$25, DW_AT_name("PIEIER_REG")
    1270                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x01)
    1271              $C$DW$116       .dwtag  DW_TAG_member
    1272                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
    1273                      .dwattr $C$DW$116, DW_AT_name("all")
    1274                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_all")
    1275                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1276                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1277              
    1278              $C$DW$117       .dwtag  DW_TAG_member
    1279                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$24)
    1280                      .dwattr $C$DW$117, DW_AT_name("bit")
    1281                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_bit")
    1282                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1283                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1284              
    1285                      .dwendtag $C$DW$T$25
    1286              
    1287              
    1288              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    1289                      .dwattr $C$DW$T$26, DW_AT_name("PIEIFR_BITS")
    1290                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
    1291              $C$DW$118       .dwtag  DW_TAG_member
    1292                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
    1293                      .dwattr $C$DW$118, DW_AT_name("INTx1")
    1294                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_INTx1")
    1295                      .dwattr $C$DW$118, DW_AT_bit_offset(0x0f)
    1296                      .dwattr $C$DW$118, DW_AT_bit_size(0x01)
    1297                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1298                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.1 Sat Jun 25 21:32:08 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\RJKJ_ZGH\AppData\Local\Temp\0267210                         PAGE   27

    1299              
    1300              $C$DW$119       .dwtag  DW_TAG_member
    1301                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
    1302                      .dwattr $C$DW$119, DW_AT_name("INTx2")
    1303                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_INTx2")
    1304                      .dwattr $C$DW$119, DW_AT_bit_offset(0x0e)
    1305                      .dwattr $C$DW$119, DW_AT_bit_size(0x01)
    1306                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1307                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1308              
    1309              $C$DW$120       .dwtag  DW_TAG_member
    1310                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$19)
    1311                      .dwattr $C$DW$120, DW_AT_name("INTx3")
    1312                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_INTx3")
    1313                      .dwattr $C$DW$120, DW_AT_bit_offset(0x0d)
    1314                      .dwattr $C$DW$120, DW_AT_bit_size(0x01)
    1315                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1316                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1317              
    1318              $C$DW$121       .dwtag  DW_TAG_member
    1319                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$19)
    1320                      .dwattr $C$DW$121, DW_AT_name("INTx4")
    1321                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_INTx4")
    1322                      .dwattr $C$DW$121, DW_AT_bit_offset(0x0c)
    1323                      .dwattr $C$DW$121, DW_AT_bit_size(0x01)
    1324                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1325                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1326              
    1327              $C$DW$122       .dwtag  DW_TAG_member
    1328                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$19)
    1329                      .dwattr $C$DW$122, DW_AT_name("INTx5")
    1330                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_INTx5")
    1331                      .dwattr $C$DW$122, DW_AT_bit_offset(0x0b)
    1332                      .dwattr $C$DW$122, DW_AT_bit_size(0x01)
    1333                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1334                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1335              
    1336              $C$DW$123       .dwtag  DW_TAG_member
    1337                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$19)
    1338                      .dwattr $C$DW$123, DW_AT_name("INTx6")
    1339                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_INTx6")
    1340                      .dwattr $C$DW$123, DW_AT_bit_offset(0x0a)
    1341                      .dwattr $C$DW$123, DW_AT_bit_size(0x01)
    1342                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1343                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1344              
    1345              $C$DW$124       .dwtag  DW_TAG_member
    1346                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
    1347                      .dwattr $C$DW$124, DW_AT_name("INTx7")
    1348                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_INTx7")
    1349                      .dwattr $C$DW$124, DW_AT_bit_offset(0x09)
    1350                      .dwattr $C$DW$124, DW_AT_bit_size(0x01)
    1351                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1352                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1353              
TMS320C2000 Assembler PC v15.12.1 Sat Jun 25 21:32:08 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\RJKJ_ZGH\AppData\Local\Temp\0267210                         PAGE   28

    1354              $C$DW$125       .dwtag  DW_TAG_member
    1355                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$19)
    1356                      .dwattr $C$DW$125, DW_AT_name("INTx8")
    1357                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_INTx8")
    1358                      .dwattr $C$DW$125, DW_AT_bit_offset(0x08)
    1359                      .dwattr $C$DW$125, DW_AT_bit_size(0x01)
    1360                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1361                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1362              
    1363              $C$DW$126       .dwtag  DW_TAG_member
    1364                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
    1365                      .dwattr $C$DW$126, DW_AT_name("rsvd")
    1366                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_rsvd")
    1367                      .dwattr $C$DW$126, DW_AT_bit_offset(0x00)
    1368                      .dwattr $C$DW$126, DW_AT_bit_size(0x08)
    1369                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1370                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1371              
    1372                      .dwendtag $C$DW$T$26
    1373              
    1374              
    1375              $C$DW$T$27      .dwtag  DW_TAG_union_type
    1376                      .dwattr $C$DW$T$27, DW_AT_name("PIEIFR_REG")
    1377                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
    1378              $C$DW$127       .dwtag  DW_TAG_member
    1379                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
    1380                      .dwattr $C$DW$127, DW_AT_name("all")
    1381                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_all")
    1382                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1383                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1384              
    1385              $C$DW$128       .dwtag  DW_TAG_member
    1386                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$26)
    1387                      .dwattr $C$DW$128, DW_AT_name("bit")
    1388                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_bit")
    1389                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1390                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1391              
    1392                      .dwendtag $C$DW$T$27
    1393              
    1394              
    1395              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    1396                      .dwattr $C$DW$T$28, DW_AT_name("PIE_CTRL_REGS")
    1397                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x1a)
    1398              $C$DW$129       .dwtag  DW_TAG_member
    1399                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$23)
    1400                      .dwattr $C$DW$129, DW_AT_name("PIECTRL")
    1401                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_PIECTRL")
    1402                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1403                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1404              
    1405              $C$DW$130       .dwtag  DW_TAG_member
    1406                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$21)
    1407                      .dwattr $C$DW$130, DW_AT_name("PIEACK")
    1408                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_PIEACK")
TMS320C2000 Assembler PC v15.12.1 Sat Jun 25 21:32:08 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\RJKJ_ZGH\AppData\Local\Temp\0267210                         PAGE   29

    1409                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1410                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1411              
    1412              $C$DW$131       .dwtag  DW_TAG_member
    1413                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$25)
    1414                      .dwattr $C$DW$131, DW_AT_name("PIEIER1")
    1415                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_PIEIER1")
    1416                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1417                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1418              
    1419              $C$DW$132       .dwtag  DW_TAG_member
    1420                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$27)
    1421                      .dwattr $C$DW$132, DW_AT_name("PIEIFR1")
    1422                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_PIEIFR1")
    1423                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1424                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1425              
    1426              $C$DW$133       .dwtag  DW_TAG_member
    1427                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$25)
    1428                      .dwattr $C$DW$133, DW_AT_name("PIEIER2")
    1429                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_PIEIER2")
    1430                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1431                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1432              
    1433              $C$DW$134       .dwtag  DW_TAG_member
    1434                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$27)
    1435                      .dwattr $C$DW$134, DW_AT_name("PIEIFR2")
    1436                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_PIEIFR2")
    1437                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1438                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1439              
    1440              $C$DW$135       .dwtag  DW_TAG_member
    1441                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$25)
    1442                      .dwattr $C$DW$135, DW_AT_name("PIEIER3")
    1443                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_PIEIER3")
    1444                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1445                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1446              
    1447              $C$DW$136       .dwtag  DW_TAG_member
    1448                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$27)
    1449                      .dwattr $C$DW$136, DW_AT_name("PIEIFR3")
    1450                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_PIEIFR3")
    1451                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1452                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1453              
    1454              $C$DW$137       .dwtag  DW_TAG_member
    1455                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$25)
    1456                      .dwattr $C$DW$137, DW_AT_name("PIEIER4")
    1457                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_PIEIER4")
    1458                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1459                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1460              
    1461              $C$DW$138       .dwtag  DW_TAG_member
    1462                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$27)
    1463                      .dwattr $C$DW$138, DW_AT_name("PIEIFR4")
TMS320C2000 Assembler PC v15.12.1 Sat Jun 25 21:32:08 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\RJKJ_ZGH\AppData\Local\Temp\0267210                         PAGE   30

    1464                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_PIEIFR4")
    1465                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1466                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1467              
    1468              $C$DW$139       .dwtag  DW_TAG_member
    1469                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$25)
    1470                      .dwattr $C$DW$139, DW_AT_name("PIEIER5")
    1471                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_PIEIER5")
    1472                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1473                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1474              
    1475              $C$DW$140       .dwtag  DW_TAG_member
    1476                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$27)
    1477                      .dwattr $C$DW$140, DW_AT_name("PIEIFR5")
    1478                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_PIEIFR5")
    1479                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    1480                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1481              
    1482              $C$DW$141       .dwtag  DW_TAG_member
    1483                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$25)
    1484                      .dwattr $C$DW$141, DW_AT_name("PIEIER6")
    1485                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_PIEIER6")
    1486                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1487                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1488              
    1489              $C$DW$142       .dwtag  DW_TAG_member
    1490                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$27)
    1491                      .dwattr $C$DW$142, DW_AT_name("PIEIFR6")
    1492                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_PIEIFR6")
    1493                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    1494                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1495              
    1496              $C$DW$143       .dwtag  DW_TAG_member
    1497                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$25)
    1498                      .dwattr $C$DW$143, DW_AT_name("PIEIER7")
    1499                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_PIEIER7")
    1500                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1501                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1502              
    1503              $C$DW$144       .dwtag  DW_TAG_member
    1504                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$27)
    1505                      .dwattr $C$DW$144, DW_AT_name("PIEIFR7")
    1506                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_PIEIFR7")
    1507                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    1508                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1509              
    1510              $C$DW$145       .dwtag  DW_TAG_member
    1511                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$25)
    1512                      .dwattr $C$DW$145, DW_AT_name("PIEIER8")
    1513                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_PIEIER8")
    1514                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1515                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1516              
    1517              $C$DW$146       .dwtag  DW_TAG_member
    1518                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$27)
TMS320C2000 Assembler PC v15.12.1 Sat Jun 25 21:32:08 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\RJKJ_ZGH\AppData\Local\Temp\0267210                         PAGE   31

    1519                      .dwattr $C$DW$146, DW_AT_name("PIEIFR8")
    1520                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_PIEIFR8")
    1521                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    1522                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1523              
    1524              $C$DW$147       .dwtag  DW_TAG_member
    1525                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$25)
    1526                      .dwattr $C$DW$147, DW_AT_name("PIEIER9")
    1527                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_PIEIER9")
    1528                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1529                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1530              
    1531              $C$DW$148       .dwtag  DW_TAG_member
    1532                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$27)
    1533                      .dwattr $C$DW$148, DW_AT_name("PIEIFR9")
    1534                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_PIEIFR9")
    1535                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    1536                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1537              
    1538              $C$DW$149       .dwtag  DW_TAG_member
    1539                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$25)
    1540                      .dwattr $C$DW$149, DW_AT_name("PIEIER10")
    1541                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_PIEIER10")
    1542                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1543                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1544              
    1545              $C$DW$150       .dwtag  DW_TAG_member
    1546                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$27)
    1547                      .dwattr $C$DW$150, DW_AT_name("PIEIFR10")
    1548                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_PIEIFR10")
    1549                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    1550                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1551              
    1552              $C$DW$151       .dwtag  DW_TAG_member
    1553                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$25)
    1554                      .dwattr $C$DW$151, DW_AT_name("PIEIER11")
    1555                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_PIEIER11")
    1556                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1557                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1558              
    1559              $C$DW$152       .dwtag  DW_TAG_member
    1560                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$27)
    1561                      .dwattr $C$DW$152, DW_AT_name("PIEIFR11")
    1562                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_PIEIFR11")
    1563                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    1564                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1565              
    1566              $C$DW$153       .dwtag  DW_TAG_member
    1567                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$25)
    1568                      .dwattr $C$DW$153, DW_AT_name("PIEIER12")
    1569                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_PIEIER12")
    1570                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1571                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1572              
    1573              $C$DW$154       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.1 Sat Jun 25 21:32:08 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\RJKJ_ZGH\AppData\Local\Temp\0267210                         PAGE   32

    1574                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$27)
    1575                      .dwattr $C$DW$154, DW_AT_name("PIEIFR12")
    1576                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_PIEIFR12")
    1577                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    1578                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1579              
    1580                      .dwendtag $C$DW$T$28
    1581              
    1582              $C$DW$155       .dwtag  DW_TAG_TI_far_type
    1583                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$28)
    1584              
    1585              $C$DW$T$35      .dwtag  DW_TAG_volatile_type
    1586                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$155)
    1587              
    1588              
    1589              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    1590                      .dwattr $C$DW$T$32, DW_AT_name("PIE_VECT_TABLE")
    1591                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x100)
    1592              $C$DW$156       .dwtag  DW_TAG_member
    1593                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$31)
    1594                      .dwattr $C$DW$156, DW_AT_name("PIE1_RESERVED")
    1595                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_PIE1_RESERVED")
    1596                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1597                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1598              
    1599              $C$DW$157       .dwtag  DW_TAG_member
    1600                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$31)
    1601                      .dwattr $C$DW$157, DW_AT_name("PIE2_RESERVED")
    1602                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_PIE2_RESERVED")
    1603                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1604                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1605              
    1606              $C$DW$158       .dwtag  DW_TAG_member
    1607                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$31)
    1608                      .dwattr $C$DW$158, DW_AT_name("PIE3_RESERVED")
    1609                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_PIE3_RESERVED")
    1610                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1611                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1612              
    1613              $C$DW$159       .dwtag  DW_TAG_member
    1614                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$31)
    1615                      .dwattr $C$DW$159, DW_AT_name("PIE4_RESERVED")
    1616                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_PIE4_RESERVED")
    1617                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1618                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1619              
    1620              $C$DW$160       .dwtag  DW_TAG_member
    1621                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$31)
    1622                      .dwattr $C$DW$160, DW_AT_name("PIE5_RESERVED")
    1623                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_PIE5_RESERVED")
    1624                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1625                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1626              
    1627              $C$DW$161       .dwtag  DW_TAG_member
    1628                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$31)
TMS320C2000 Assembler PC v15.12.1 Sat Jun 25 21:32:08 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\RJKJ_ZGH\AppData\Local\Temp\0267210                         PAGE   33

    1629                      .dwattr $C$DW$161, DW_AT_name("PIE6_RESERVED")
    1630                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_PIE6_RESERVED")
    1631                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1632                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1633              
    1634              $C$DW$162       .dwtag  DW_TAG_member
    1635                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$31)
    1636                      .dwattr $C$DW$162, DW_AT_name("PIE7_RESERVED")
    1637                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_PIE7_RESERVED")
    1638                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1639                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    1640              
    1641              $C$DW$163       .dwtag  DW_TAG_member
    1642                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$31)
    1643                      .dwattr $C$DW$163, DW_AT_name("PIE8_RESERVED")
    1644                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_PIE8_RESERVED")
    1645                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1646                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    1647              
    1648              $C$DW$164       .dwtag  DW_TAG_member
    1649                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$31)
    1650                      .dwattr $C$DW$164, DW_AT_name("PIE9_RESERVED")
    1651                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_PIE9_RESERVED")
    1652                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1653                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    1654              
    1655              $C$DW$165       .dwtag  DW_TAG_member
    1656                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$31)
    1657                      .dwattr $C$DW$165, DW_AT_name("PIE10_RESERVED")
    1658                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_PIE10_RESERVED")
    1659                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1660                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    1661              
    1662              $C$DW$166       .dwtag  DW_TAG_member
    1663                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$31)
    1664                      .dwattr $C$DW$166, DW_AT_name("PIE11_RESERVED")
    1665                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_PIE11_RESERVED")
    1666                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1667                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    1668              
    1669              $C$DW$167       .dwtag  DW_TAG_member
    1670                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$31)
    1671                      .dwattr $C$DW$167, DW_AT_name("PIE12_RESERVED")
    1672                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_PIE12_RESERVED")
    1673                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1674                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    1675              
    1676              $C$DW$168       .dwtag  DW_TAG_member
    1677                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$31)
    1678                      .dwattr $C$DW$168, DW_AT_name("PIE13_RESERVED")
    1679                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_PIE13_RESERVED")
    1680                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1681                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    1682              
    1683              $C$DW$169       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.1 Sat Jun 25 21:32:08 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\RJKJ_ZGH\AppData\Local\Temp\0267210                         PAGE   34

    1684                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$31)
    1685                      .dwattr $C$DW$169, DW_AT_name("XINT13")
    1686                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_XINT13")
    1687                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    1688                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    1689              
    1690              $C$DW$170       .dwtag  DW_TAG_member
    1691                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$31)
    1692                      .dwattr $C$DW$170, DW_AT_name("TINT2")
    1693                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_TINT2")
    1694                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1695                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    1696              
    1697              $C$DW$171       .dwtag  DW_TAG_member
    1698                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$31)
    1699                      .dwattr $C$DW$171, DW_AT_name("DATALOG")
    1700                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_DATALOG")
    1701                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    1702                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    1703              
    1704              $C$DW$172       .dwtag  DW_TAG_member
    1705                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$31)
    1706                      .dwattr $C$DW$172, DW_AT_name("RTOSINT")
    1707                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_RTOSINT")
    1708                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1709                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    1710              
    1711              $C$DW$173       .dwtag  DW_TAG_member
    1712                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$31)
    1713                      .dwattr $C$DW$173, DW_AT_name("EMUINT")
    1714                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_EMUINT")
    1715                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    1716                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    1717              
    1718              $C$DW$174       .dwtag  DW_TAG_member
    1719                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$31)
    1720                      .dwattr $C$DW$174, DW_AT_name("XNMI")
    1721                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_XNMI")
    1722                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1723                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    1724              
    1725              $C$DW$175       .dwtag  DW_TAG_member
    1726                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$31)
    1727                      .dwattr $C$DW$175, DW_AT_name("ILLEGAL")
    1728                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_ILLEGAL")
    1729                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    1730                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    1731              
    1732              $C$DW$176       .dwtag  DW_TAG_member
    1733                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$31)
    1734                      .dwattr $C$DW$176, DW_AT_name("USER1")
    1735                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_USER1")
    1736                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1737                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    1738              
TMS320C2000 Assembler PC v15.12.1 Sat Jun 25 21:32:08 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\RJKJ_ZGH\AppData\Local\Temp\0267210                         PAGE   35

    1739              $C$DW$177       .dwtag  DW_TAG_member
    1740                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$31)
    1741                      .dwattr $C$DW$177, DW_AT_name("USER2")
    1742                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_USER2")
    1743                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    1744                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    1745              
    1746              $C$DW$178       .dwtag  DW_TAG_member
    1747                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$31)
    1748                      .dwattr $C$DW$178, DW_AT_name("USER3")
    1749                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_USER3")
    1750                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    1751                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    1752              
    1753              $C$DW$179       .dwtag  DW_TAG_member
    1754                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$31)
    1755                      .dwattr $C$DW$179, DW_AT_name("USER4")
    1756                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_USER4")
    1757                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    1758                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    1759              
    1760              $C$DW$180       .dwtag  DW_TAG_member
    1761                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$31)
    1762                      .dwattr $C$DW$180, DW_AT_name("USER5")
    1763                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_USER5")
    1764                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    1765                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    1766              
    1767              $C$DW$181       .dwtag  DW_TAG_member
    1768                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$31)
    1769                      .dwattr $C$DW$181, DW_AT_name("USER6")
    1770                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_USER6")
    1771                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    1772                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    1773              
    1774              $C$DW$182       .dwtag  DW_TAG_member
    1775                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$31)
    1776                      .dwattr $C$DW$182, DW_AT_name("USER7")
    1777                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_USER7")
    1778                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    1779                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    1780              
    1781              $C$DW$183       .dwtag  DW_TAG_member
    1782                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$31)
    1783                      .dwattr $C$DW$183, DW_AT_name("USER8")
    1784                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_USER8")
    1785                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    1786                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    1787              
    1788              $C$DW$184       .dwtag  DW_TAG_member
    1789                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$31)
    1790                      .dwattr $C$DW$184, DW_AT_name("USER9")
    1791                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_USER9")
    1792                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    1793                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.1 Sat Jun 25 21:32:08 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\RJKJ_ZGH\AppData\Local\Temp\0267210                         PAGE   36

    1794              
    1795              $C$DW$185       .dwtag  DW_TAG_member
    1796                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$31)
    1797                      .dwattr $C$DW$185, DW_AT_name("USER10")
    1798                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_USER10")
    1799                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    1800                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    1801              
    1802              $C$DW$186       .dwtag  DW_TAG_member
    1803                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$31)
    1804                      .dwattr $C$DW$186, DW_AT_name("USER11")
    1805                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_USER11")
    1806                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    1807                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    1808              
    1809              $C$DW$187       .dwtag  DW_TAG_member
    1810                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$31)
    1811                      .dwattr $C$DW$187, DW_AT_name("USER12")
    1812                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_USER12")
    1813                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
    1814                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    1815              
    1816              $C$DW$188       .dwtag  DW_TAG_member
    1817                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$31)
    1818                      .dwattr $C$DW$188, DW_AT_name("SEQ1INT")
    1819                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_SEQ1INT")
    1820                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    1821                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    1822              
    1823              $C$DW$189       .dwtag  DW_TAG_member
    1824                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$31)
    1825                      .dwattr $C$DW$189, DW_AT_name("SEQ2INT")
    1826                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_SEQ2INT")
    1827                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    1828                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    1829              
    1830              $C$DW$190       .dwtag  DW_TAG_member
    1831                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$31)
    1832                      .dwattr $C$DW$190, DW_AT_name("rsvd1_3")
    1833                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_rsvd1_3")
    1834                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    1835                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    1836              
    1837              $C$DW$191       .dwtag  DW_TAG_member
    1838                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$31)
    1839                      .dwattr $C$DW$191, DW_AT_name("XINT1")
    1840                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_XINT1")
    1841                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    1842                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    1843              
    1844              $C$DW$192       .dwtag  DW_TAG_member
    1845                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$31)
    1846                      .dwattr $C$DW$192, DW_AT_name("XINT2")
    1847                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_XINT2")
    1848                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
TMS320C2000 Assembler PC v15.12.1 Sat Jun 25 21:32:08 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\RJKJ_ZGH\AppData\Local\Temp\0267210                         PAGE   37

    1849                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    1850              
    1851              $C$DW$193       .dwtag  DW_TAG_member
    1852                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$31)
    1853                      .dwattr $C$DW$193, DW_AT_name("ADCINT")
    1854                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_ADCINT")
    1855                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
    1856                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    1857              
    1858              $C$DW$194       .dwtag  DW_TAG_member
    1859                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$31)
    1860                      .dwattr $C$DW$194, DW_AT_name("TINT0")
    1861                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_TINT0")
    1862                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    1863                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    1864              
    1865              $C$DW$195       .dwtag  DW_TAG_member
    1866                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$31)
    1867                      .dwattr $C$DW$195, DW_AT_name("WAKEINT")
    1868                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_WAKEINT")
    1869                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
    1870                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    1871              
    1872              $C$DW$196       .dwtag  DW_TAG_member
    1873                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$31)
    1874                      .dwattr $C$DW$196, DW_AT_name("EPWM1_TZINT")
    1875                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_EPWM1_TZINT")
    1876                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    1877                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    1878              
    1879              $C$DW$197       .dwtag  DW_TAG_member
    1880                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$31)
    1881                      .dwattr $C$DW$197, DW_AT_name("EPWM2_TZINT")
    1882                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_EPWM2_TZINT")
    1883                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x52]
    1884                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    1885              
    1886              $C$DW$198       .dwtag  DW_TAG_member
    1887                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$31)
    1888                      .dwattr $C$DW$198, DW_AT_name("EPWM3_TZINT")
    1889                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_EPWM3_TZINT")
    1890                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
    1891                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    1892              
    1893              $C$DW$199       .dwtag  DW_TAG_member
    1894                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$31)
    1895                      .dwattr $C$DW$199, DW_AT_name("EPWM4_TZINT")
    1896                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_EPWM4_TZINT")
    1897                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    1898                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    1899              
    1900              $C$DW$200       .dwtag  DW_TAG_member
    1901                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$31)
    1902                      .dwattr $C$DW$200, DW_AT_name("EPWM5_TZINT")
    1903                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_EPWM5_TZINT")
TMS320C2000 Assembler PC v15.12.1 Sat Jun 25 21:32:08 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\RJKJ_ZGH\AppData\Local\Temp\0267210                         PAGE   38

    1904                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    1905                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    1906              
    1907              $C$DW$201       .dwtag  DW_TAG_member
    1908                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$31)
    1909                      .dwattr $C$DW$201, DW_AT_name("EPWM6_TZINT")
    1910                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_EPWM6_TZINT")
    1911                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
    1912                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    1913              
    1914              $C$DW$202       .dwtag  DW_TAG_member
    1915                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$31)
    1916                      .dwattr $C$DW$202, DW_AT_name("rsvd2_7")
    1917                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_rsvd2_7")
    1918                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    1919                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    1920              
    1921              $C$DW$203       .dwtag  DW_TAG_member
    1922                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$31)
    1923                      .dwattr $C$DW$203, DW_AT_name("rsvd2_8")
    1924                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_rsvd2_8")
    1925                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    1926                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    1927              
    1928              $C$DW$204       .dwtag  DW_TAG_member
    1929                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$31)
    1930                      .dwattr $C$DW$204, DW_AT_name("EPWM1_INT")
    1931                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_EPWM1_INT")
    1932                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    1933                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    1934              
    1935              $C$DW$205       .dwtag  DW_TAG_member
    1936                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$31)
    1937                      .dwattr $C$DW$205, DW_AT_name("EPWM2_INT")
    1938                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_EPWM2_INT")
    1939                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    1940                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    1941              
    1942              $C$DW$206       .dwtag  DW_TAG_member
    1943                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$31)
    1944                      .dwattr $C$DW$206, DW_AT_name("EPWM3_INT")
    1945                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_EPWM3_INT")
    1946                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
    1947                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    1948              
    1949              $C$DW$207       .dwtag  DW_TAG_member
    1950                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$31)
    1951                      .dwattr $C$DW$207, DW_AT_name("EPWM4_INT")
    1952                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_EPWM4_INT")
    1953                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x66]
    1954                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    1955              
    1956              $C$DW$208       .dwtag  DW_TAG_member
    1957                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$31)
    1958                      .dwattr $C$DW$208, DW_AT_name("EPWM5_INT")
TMS320C2000 Assembler PC v15.12.1 Sat Jun 25 21:32:08 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\RJKJ_ZGH\AppData\Local\Temp\0267210                         PAGE   39

    1959                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_EPWM5_INT")
    1960                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
    1961                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    1962              
    1963              $C$DW$209       .dwtag  DW_TAG_member
    1964                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$31)
    1965                      .dwattr $C$DW$209, DW_AT_name("EPWM6_INT")
    1966                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("_EPWM6_INT")
    1967                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x6a]
    1968                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    1969              
    1970              $C$DW$210       .dwtag  DW_TAG_member
    1971                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$31)
    1972                      .dwattr $C$DW$210, DW_AT_name("rsvd3_7")
    1973                      .dwattr $C$DW$210, DW_AT_TI_symbol_name("_rsvd3_7")
    1974                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    1975                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    1976              
    1977              $C$DW$211       .dwtag  DW_TAG_member
    1978                      .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$31)
    1979                      .dwattr $C$DW$211, DW_AT_name("rsvd3_8")
    1980                      .dwattr $C$DW$211, DW_AT_TI_symbol_name("_rsvd3_8")
    1981                      .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    1982                      .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    1983              
    1984              $C$DW$212       .dwtag  DW_TAG_member
    1985                      .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$31)
    1986                      .dwattr $C$DW$212, DW_AT_name("ECAP1_INT")
    1987                      .dwattr $C$DW$212, DW_AT_TI_symbol_name("_ECAP1_INT")
    1988                      .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x70]
    1989                      .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    1990              
    1991              $C$DW$213       .dwtag  DW_TAG_member
    1992                      .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$31)
    1993                      .dwattr $C$DW$213, DW_AT_name("ECAP2_INT")
    1994                      .dwattr $C$DW$213, DW_AT_TI_symbol_name("_ECAP2_INT")
    1995                      .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x72]
    1996                      .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    1997              
    1998              $C$DW$214       .dwtag  DW_TAG_member
    1999                      .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$31)
    2000                      .dwattr $C$DW$214, DW_AT_name("ECAP3_INT")
    2001                      .dwattr $C$DW$214, DW_AT_TI_symbol_name("_ECAP3_INT")
    2002                      .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x74]
    2003                      .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    2004              
    2005              $C$DW$215       .dwtag  DW_TAG_member
    2006                      .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$31)
    2007                      .dwattr $C$DW$215, DW_AT_name("ECAP4_INT")
    2008                      .dwattr $C$DW$215, DW_AT_TI_symbol_name("_ECAP4_INT")
    2009                      .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x76]
    2010                      .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    2011              
    2012              $C$DW$216       .dwtag  DW_TAG_member
    2013                      .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$31)
TMS320C2000 Assembler PC v15.12.1 Sat Jun 25 21:32:08 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\RJKJ_ZGH\AppData\Local\Temp\0267210                         PAGE   40

    2014                      .dwattr $C$DW$216, DW_AT_name("ECAP5_INT")
    2015                      .dwattr $C$DW$216, DW_AT_TI_symbol_name("_ECAP5_INT")
    2016                      .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    2017                      .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    2018              
    2019              $C$DW$217       .dwtag  DW_TAG_member
    2020                      .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$31)
    2021                      .dwattr $C$DW$217, DW_AT_name("ECAP6_INT")
    2022                      .dwattr $C$DW$217, DW_AT_TI_symbol_name("_ECAP6_INT")
    2023                      .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    2024                      .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    2025              
    2026              $C$DW$218       .dwtag  DW_TAG_member
    2027                      .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$31)
    2028                      .dwattr $C$DW$218, DW_AT_name("rsvd4_7")
    2029                      .dwattr $C$DW$218, DW_AT_TI_symbol_name("_rsvd4_7")
    2030                      .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
    2031                      .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    2032              
    2033              $C$DW$219       .dwtag  DW_TAG_member
    2034                      .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$31)
    2035                      .dwattr $C$DW$219, DW_AT_name("rsvd4_8")
    2036                      .dwattr $C$DW$219, DW_AT_TI_symbol_name("_rsvd4_8")
    2037                      .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x7e]
    2038                      .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    2039              
    2040              $C$DW$220       .dwtag  DW_TAG_member
    2041                      .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$31)
    2042                      .dwattr $C$DW$220, DW_AT_name("EQEP1_INT")
    2043                      .dwattr $C$DW$220, DW_AT_TI_symbol_name("_EQEP1_INT")
    2044                      .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
    2045                      .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    2046              
    2047              $C$DW$221       .dwtag  DW_TAG_member
    2048                      .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$31)
    2049                      .dwattr $C$DW$221, DW_AT_name("EQEP2_INT")
    2050                      .dwattr $C$DW$221, DW_AT_TI_symbol_name("_EQEP2_INT")
    2051                      .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x82]
    2052                      .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    2053              
    2054              $C$DW$222       .dwtag  DW_TAG_member
    2055                      .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$31)
    2056                      .dwattr $C$DW$222, DW_AT_name("rsvd5_3")
    2057                      .dwattr $C$DW$222, DW_AT_TI_symbol_name("_rsvd5_3")
    2058                      .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    2059                      .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    2060              
    2061              $C$DW$223       .dwtag  DW_TAG_member
    2062                      .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$31)
    2063                      .dwattr $C$DW$223, DW_AT_name("rsvd5_4")
    2064                      .dwattr $C$DW$223, DW_AT_TI_symbol_name("_rsvd5_4")
    2065                      .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x86]
    2066                      .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    2067              
    2068              $C$DW$224       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.1 Sat Jun 25 21:32:08 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\RJKJ_ZGH\AppData\Local\Temp\0267210                         PAGE   41

    2069                      .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$31)
    2070                      .dwattr $C$DW$224, DW_AT_name("rsvd5_5")
    2071                      .dwattr $C$DW$224, DW_AT_TI_symbol_name("_rsvd5_5")
    2072                      .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
    2073                      .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    2074              
    2075              $C$DW$225       .dwtag  DW_TAG_member
    2076                      .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$31)
    2077                      .dwattr $C$DW$225, DW_AT_name("rsvd5_6")
    2078                      .dwattr $C$DW$225, DW_AT_TI_symbol_name("_rsvd5_6")
    2079                      .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x8a]
    2080                      .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    2081              
    2082              $C$DW$226       .dwtag  DW_TAG_member
    2083                      .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$31)
    2084                      .dwattr $C$DW$226, DW_AT_name("rsvd5_7")
    2085                      .dwattr $C$DW$226, DW_AT_TI_symbol_name("_rsvd5_7")
    2086                      .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x8c]
    2087                      .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    2088              
    2089              $C$DW$227       .dwtag  DW_TAG_member
    2090                      .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$31)
    2091                      .dwattr $C$DW$227, DW_AT_name("rsvd5_8")
    2092                      .dwattr $C$DW$227, DW_AT_TI_symbol_name("_rsvd5_8")
    2093                      .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x8e]
    2094                      .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
    2095              
    2096              $C$DW$228       .dwtag  DW_TAG_member
    2097                      .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$31)
    2098                      .dwattr $C$DW$228, DW_AT_name("SPIRXINTA")
    2099                      .dwattr $C$DW$228, DW_AT_TI_symbol_name("_SPIRXINTA")
    2100                      .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x90]
    2101                      .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
    2102              
    2103              $C$DW$229       .dwtag  DW_TAG_member
    2104                      .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$31)
    2105                      .dwattr $C$DW$229, DW_AT_name("SPITXINTA")
    2106                      .dwattr $C$DW$229, DW_AT_TI_symbol_name("_SPITXINTA")
    2107                      .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    2108                      .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    2109              
    2110              $C$DW$230       .dwtag  DW_TAG_member
    2111                      .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$31)
    2112                      .dwattr $C$DW$230, DW_AT_name("MRINTB")
    2113                      .dwattr $C$DW$230, DW_AT_TI_symbol_name("_MRINTB")
    2114                      .dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x94]
    2115                      .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
    2116              
    2117              $C$DW$231       .dwtag  DW_TAG_member
    2118                      .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$31)
    2119                      .dwattr $C$DW$231, DW_AT_name("MXINTB")
    2120                      .dwattr $C$DW$231, DW_AT_TI_symbol_name("_MXINTB")
    2121                      .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x96]
    2122                      .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    2123              
TMS320C2000 Assembler PC v15.12.1 Sat Jun 25 21:32:08 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\RJKJ_ZGH\AppData\Local\Temp\0267210                         PAGE   42

    2124              $C$DW$232       .dwtag  DW_TAG_member
    2125                      .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$31)
    2126                      .dwattr $C$DW$232, DW_AT_name("MRINTA")
    2127                      .dwattr $C$DW$232, DW_AT_TI_symbol_name("_MRINTA")
    2128                      .dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x98]
    2129                      .dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
    2130              
    2131              $C$DW$233       .dwtag  DW_TAG_member
    2132                      .dwattr $C$DW$233, DW_AT_type(*$C$DW$T$31)
    2133                      .dwattr $C$DW$233, DW_AT_name("MXINTA")
    2134                      .dwattr $C$DW$233, DW_AT_TI_symbol_name("_MXINTA")
    2135                      .dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    2136                      .dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)
    2137              
    2138              $C$DW$234       .dwtag  DW_TAG_member
    2139                      .dwattr $C$DW$234, DW_AT_type(*$C$DW$T$31)
    2140                      .dwattr $C$DW$234, DW_AT_name("rsvd6_7")
    2141                      .dwattr $C$DW$234, DW_AT_TI_symbol_name("_rsvd6_7")
    2142                      .dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    2143                      .dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)
    2144              
    2145              $C$DW$235       .dwtag  DW_TAG_member
    2146                      .dwattr $C$DW$235, DW_AT_type(*$C$DW$T$31)
    2147                      .dwattr $C$DW$235, DW_AT_name("rsvd6_8")
    2148                      .dwattr $C$DW$235, DW_AT_TI_symbol_name("_rsvd6_8")
    2149                      .dwattr $C$DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    2150                      .dwattr $C$DW$235, DW_AT_accessibility(DW_ACCESS_public)
    2151              
    2152              $C$DW$236       .dwtag  DW_TAG_member
    2153                      .dwattr $C$DW$236, DW_AT_type(*$C$DW$T$31)
    2154                      .dwattr $C$DW$236, DW_AT_name("DINTCH1")
    2155                      .dwattr $C$DW$236, DW_AT_TI_symbol_name("_DINTCH1")
    2156                      .dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    2157                      .dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)
    2158              
    2159              $C$DW$237       .dwtag  DW_TAG_member
    2160                      .dwattr $C$DW$237, DW_AT_type(*$C$DW$T$31)
    2161                      .dwattr $C$DW$237, DW_AT_name("DINTCH2")
    2162                      .dwattr $C$DW$237, DW_AT_TI_symbol_name("_DINTCH2")
    2163                      .dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    2164                      .dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)
    2165              
    2166              $C$DW$238       .dwtag  DW_TAG_member
    2167                      .dwattr $C$DW$238, DW_AT_type(*$C$DW$T$31)
    2168                      .dwattr $C$DW$238, DW_AT_name("DINTCH3")
    2169                      .dwattr $C$DW$238, DW_AT_TI_symbol_name("_DINTCH3")
    2170                      .dwattr $C$DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    2171                      .dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)
    2172              
    2173              $C$DW$239       .dwtag  DW_TAG_member
    2174                      .dwattr $C$DW$239, DW_AT_type(*$C$DW$T$31)
    2175                      .dwattr $C$DW$239, DW_AT_name("DINTCH4")
    2176                      .dwattr $C$DW$239, DW_AT_TI_symbol_name("_DINTCH4")
    2177                      .dwattr $C$DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    2178                      .dwattr $C$DW$239, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.1 Sat Jun 25 21:32:08 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\RJKJ_ZGH\AppData\Local\Temp\0267210                         PAGE   43

    2179              
    2180              $C$DW$240       .dwtag  DW_TAG_member
    2181                      .dwattr $C$DW$240, DW_AT_type(*$C$DW$T$31)
    2182                      .dwattr $C$DW$240, DW_AT_name("DINTCH5")
    2183                      .dwattr $C$DW$240, DW_AT_TI_symbol_name("_DINTCH5")
    2184                      .dwattr $C$DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    2185                      .dwattr $C$DW$240, DW_AT_accessibility(DW_ACCESS_public)
    2186              
    2187              $C$DW$241       .dwtag  DW_TAG_member
    2188                      .dwattr $C$DW$241, DW_AT_type(*$C$DW$T$31)
    2189                      .dwattr $C$DW$241, DW_AT_name("DINTCH6")
    2190                      .dwattr $C$DW$241, DW_AT_TI_symbol_name("_DINTCH6")
    2191                      .dwattr $C$DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    2192                      .dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)
    2193              
    2194              $C$DW$242       .dwtag  DW_TAG_member
    2195                      .dwattr $C$DW$242, DW_AT_type(*$C$DW$T$31)
    2196                      .dwattr $C$DW$242, DW_AT_name("rsvd7_7")
    2197                      .dwattr $C$DW$242, DW_AT_TI_symbol_name("_rsvd7_7")
    2198                      .dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0xac]
    2199                      .dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)
    2200              
    2201              $C$DW$243       .dwtag  DW_TAG_member
    2202                      .dwattr $C$DW$243, DW_AT_type(*$C$DW$T$31)
    2203                      .dwattr $C$DW$243, DW_AT_name("rsvd7_8")
    2204                      .dwattr $C$DW$243, DW_AT_TI_symbol_name("_rsvd7_8")
    2205                      .dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    2206                      .dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
    2207              
    2208              $C$DW$244       .dwtag  DW_TAG_member
    2209                      .dwattr $C$DW$244, DW_AT_type(*$C$DW$T$31)
    2210                      .dwattr $C$DW$244, DW_AT_name("I2CINT1A")
    2211                      .dwattr $C$DW$244, DW_AT_TI_symbol_name("_I2CINT1A")
    2212                      .dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0xb0]
    2213                      .dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
    2214              
    2215              $C$DW$245       .dwtag  DW_TAG_member
    2216                      .dwattr $C$DW$245, DW_AT_type(*$C$DW$T$31)
    2217                      .dwattr $C$DW$245, DW_AT_name("I2CINT2A")
    2218                      .dwattr $C$DW$245, DW_AT_TI_symbol_name("_I2CINT2A")
    2219                      .dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    2220                      .dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)
    2221              
    2222              $C$DW$246       .dwtag  DW_TAG_member
    2223                      .dwattr $C$DW$246, DW_AT_type(*$C$DW$T$31)
    2224                      .dwattr $C$DW$246, DW_AT_name("rsvd8_3")
    2225                      .dwattr $C$DW$246, DW_AT_TI_symbol_name("_rsvd8_3")
    2226                      .dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0xb4]
    2227                      .dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)
    2228              
    2229              $C$DW$247       .dwtag  DW_TAG_member
    2230                      .dwattr $C$DW$247, DW_AT_type(*$C$DW$T$31)
    2231                      .dwattr $C$DW$247, DW_AT_name("rsvd8_4")
    2232                      .dwattr $C$DW$247, DW_AT_TI_symbol_name("_rsvd8_4")
    2233                      .dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
TMS320C2000 Assembler PC v15.12.1 Sat Jun 25 21:32:08 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\RJKJ_ZGH\AppData\Local\Temp\0267210                         PAGE   44

    2234                      .dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
    2235              
    2236              $C$DW$248       .dwtag  DW_TAG_member
    2237                      .dwattr $C$DW$248, DW_AT_type(*$C$DW$T$31)
    2238                      .dwattr $C$DW$248, DW_AT_name("SCIRXINTC")
    2239                      .dwattr $C$DW$248, DW_AT_TI_symbol_name("_SCIRXINTC")
    2240                      .dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0xb8]
    2241                      .dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
    2242              
    2243              $C$DW$249       .dwtag  DW_TAG_member
    2244                      .dwattr $C$DW$249, DW_AT_type(*$C$DW$T$31)
    2245                      .dwattr $C$DW$249, DW_AT_name("SCITXINTC")
    2246                      .dwattr $C$DW$249, DW_AT_TI_symbol_name("_SCITXINTC")
    2247                      .dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    2248                      .dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)
    2249              
    2250              $C$DW$250       .dwtag  DW_TAG_member
    2251                      .dwattr $C$DW$250, DW_AT_type(*$C$DW$T$31)
    2252                      .dwattr $C$DW$250, DW_AT_name("rsvd8_7")
    2253                      .dwattr $C$DW$250, DW_AT_TI_symbol_name("_rsvd8_7")
    2254                      .dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    2255                      .dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
    2256              
    2257              $C$DW$251       .dwtag  DW_TAG_member
    2258                      .dwattr $C$DW$251, DW_AT_type(*$C$DW$T$31)
    2259                      .dwattr $C$DW$251, DW_AT_name("rsvd8_8")
    2260                      .dwattr $C$DW$251, DW_AT_TI_symbol_name("_rsvd8_8")
