TMS320C2000 Assembler PC v15.12.1 Sat Jun 25 21:32:08 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\RJKJ_ZGH\AppData\Local\Temp\0869210                         PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                   PC v15.12.1.LTS *
       3              ;* Date/Time created: Sat Jun 25 21:32:08 2016                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=fpu32 --hll_source=on --mem_model:code=flat --mem_model:
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/work/DSP/Steering_Engine/F2833x/v141/DSP2833x_common/source/DSP2833x
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v15.12.1.LTS Copyright (c) 1996-201
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\work\DSP\Steering_Engine\F2833x\v141\DSP2833x_examples_ccsv5\fpu
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("ADC_cal")

     690 000000d6 9201!         MOV       AL,@_CsmPwl+1         ; [CPU_] |345| 
     691 000000d7 9641          MOV       *-SP[1],AL            ; [CPU_] |345| 
     692                      .dwpsn  file "D:/work/DSP/Steering_Engine/F2833x/v141/DSP2833x_common/source/DSP2833x_SysCtrl.c",line
TMS320C2000 Assembler PC v15.12.1 Sat Jun 25 21:32:08 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\RJKJ_ZGH\AppData\Local\Temp\0869210                         PAGE   15

     693 000000d8 9202!         MOV       AL,@_CsmPwl+2         ; [CPU_] |346| 
     694 000000d9 9641          MOV       *-SP[1],AL            ; [CPU_] |346| 
     695                      .dwpsn  file "D:/work/DSP/Steering_Engine/F2833x/v141/DSP2833x_common/source/DSP2833x_SysCtrl.c",line
     696 000000da 9203!         MOV       AL,@_CsmPwl+3         ; [CPU_] |347| 
     697 000000db 9641          MOV       *-SP[1],AL            ; [CPU_] |347| 
     698                      .dwpsn  file "D:/work/DSP/Steering_Engine/F2833x/v141/DSP2833x_common/source/DSP2833x_SysCtrl.c",line
     699 000000dc 9204!         MOV       AL,@_CsmPwl+4         ; [CPU_] |348| 
     700 000000dd 9641          MOV       *-SP[1],AL            ; [CPU_] |348| 
     701                      .dwpsn  file "D:/work/DSP/Steering_Engine/F2833x/v141/DSP2833x_common/source/DSP2833x_SysCtrl.c",line
     702 000000de 9205!         MOV       AL,@_CsmPwl+5         ; [CPU_] |349| 
     703 000000df 9641          MOV       *-SP[1],AL            ; [CPU_] |349| 
     704                      .dwpsn  file "D:/work/DSP/Steering_Engine/F2833x/v141/DSP2833x_common/source/DSP2833x_SysCtrl.c",line
     705 000000e0 9206!         MOV       AL,@_CsmPwl+6         ; [CPU_] |350| 
     706 000000e1 9641          MOV       *-SP[1],AL            ; [CPU_] |350| 
     707                      .dwpsn  file "D:/work/DSP/Steering_Engine/F2833x/v141/DSP2833x_common/source/DSP2833x_SysCtrl.c",line
     708 000000e2 9207!         MOV       AL,@_CsmPwl+7         ; [CPU_] |351| 
     709 000000e3 9641          MOV       *-SP[1],AL            ; [CPU_] |351| 
     710                      .dwpsn  file "D:/work/DSP/Steering_Engine/F2833x/v141/DSP2833x_common/source/DSP2833x_SysCtrl.c",line
     711 000000e4 761F!         MOVW      DP,#_CsmRegs+15       ; [CPU_U] 
         000000e5 0000 
     712 000000e6 400F!         TBIT      @_CsmRegs+15,#0       ; [CPU_] |355| 
     713 000000e7 6D03          B         $C$L8,TC              ; [CPU_] |355| 
     714                      ; branchcc occurs ; [] |355| 
     715                      .dwpsn  file "D:/work/DSP/Steering_Engine/F2833x/v141/DSP2833x_common/source/DSP2833x_SysCtrl.c",line
     716 000000e8 9A01          MOVB      AL,#1                 ; [CPU_] |355| 
     717 000000e9 6F02          B         $C$L9,UNC             ; [CPU_] |355| 
     718                      ; branch occurs ; [] |355| 
     719 000000ea       $C$L8:    
     720                      .dwpsn  file "D:/work/DSP/Steering_Engine/F2833x/v141/DSP2833x_common/source/DSP2833x_SysCtrl.c",line
     721 000000ea 9A00          MOVB      AL,#0                 ; [CPU_] |356| 
     722 000000eb       $C$L9:    
     723                      .dwpsn  file "D:/work/DSP/Steering_Engine/F2833x/v141/DSP2833x_common/source/DSP2833x_SysCtrl.c",line
     724 000000eb FE82          SUBB      SP,#2                 ; [CPU_U] 
     725                      .dwcfi  cfa_offset, -2
     726 000000ec FF69          SPM       #0                    ; [CPU_] 
     727              $C$DW$33        .dwtag  DW_TAG_TI_branch
     728                      .dwattr $C$DW$33, DW_AT_low_pc(0x00)
     729                      .dwattr $C$DW$33, DW_AT_TI_return
     730              
     731 000000ed 0006          LRETR     ; [CPU_] 
     732                      ; return occurs ; [] 
     733                      .dwattr $C$DW$31, DW_AT_TI_end_file("D:/work/DSP/Steering_Engine/F2833x/v141/DSP2833x_common/source/D
     734                      .dwattr $C$DW$31, DW_AT_TI_end_line(0x166)
     735                      .dwattr $C$DW$31, DW_AT_TI_end_column(0x01)
     736                      .dwendentry
     737                      .dwendtag $C$DW$31
     738              
     739              ;**************************************************************
     740              ;* UNDEFINED EXTERNAL REFERENCES                              *
     741              ;**************************************************************
     742                      .global _ADC_cal
     743                      .global _DSP28x_usDelay
     744                      .global _CsmPwl
     745                      .global _FlashRegs
     746                      .global _CsmRegs
TMS320C2000 Assembler PC v15.12.1 Sat Jun 25 21:32:08 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\RJKJ_ZGH\AppData\Local\Temp\0869210                         PAGE   16

     747                      .global _XintfRegs
     748                      .global _SysCtrlRegs
     749              
     750              ;***************************************************************
     751              ;* TYPE INFORMATION                                            *
     752              ;***************************************************************
     753              
     754              $C$DW$T$20      .dwtag  DW_TAG_structure_type
     755                      .dwattr $C$DW$T$20, DW_AT_name("CSMSCR_BITS")
     756                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x01)
     757              $C$DW$34        .dwtag  DW_TAG_member
     758                      .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$19)
     759                      .dwattr $C$DW$34, DW_AT_name("SECURE")
     760                      .dwattr $C$DW$34, DW_AT_TI_symbol_name("_SECURE")
     761                      .dwattr $C$DW$34, DW_AT_bit_offset(0x0f)
     762                      .dwattr $C$DW$34, DW_AT_bit_size(0x01)
     763                      .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     764                      .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
     765              
     766              $C$DW$35        .dwtag  DW_TAG_member
     767                      .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$19)
     768                      .dwattr $C$DW$35, DW_AT_name("rsvd1")
     769                      .dwattr $C$DW$35, DW_AT_TI_symbol_name("_rsvd1")
     770                      .dwattr $C$DW$35, DW_AT_bit_offset(0x01)
     771                      .dwattr $C$DW$35, DW_AT_bit_size(0x0e)
     772                      .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     773                      .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     774              
     775              $C$DW$36        .dwtag  DW_TAG_member
     776                      .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$19)
     777                      .dwattr $C$DW$36, DW_AT_name("FORCESEC")
     778                      .dwattr $C$DW$36, DW_AT_TI_symbol_name("_FORCESEC")
     779                      .dwattr $C$DW$36, DW_AT_bit_offset(0x00)
     780                      .dwattr $C$DW$36, DW_AT_bit_size(0x01)
     781                      .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     782                      .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
     783              
     784                      .dwendtag $C$DW$T$20
     785              
     786              
     787              $C$DW$T$21      .dwtag  DW_TAG_union_type
     788                      .dwattr $C$DW$T$21, DW_AT_name("CSMSCR_REG")
     789                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x01)
     790              $C$DW$37        .dwtag  DW_TAG_member
     791                      .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$19)
     792                      .dwattr $C$DW$37, DW_AT_name("all")
     793                      .dwattr $C$DW$37, DW_AT_TI_symbol_name("_all")
     794                      .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     795                      .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
     796              
     797              $C$DW$38        .dwtag  DW_TAG_member
     798                      .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$20)
     799                      .dwattr $C$DW$38, DW_AT_name("bit")
     800                      .dwattr $C$DW$38, DW_AT_TI_symbol_name("_bit")
     801                      .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v15.12.1 Sat Jun 25 21:32:08 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\RJKJ_ZGH\AppData\Local\Temp\0869210                         PAGE   17

     802                      .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     803              
     804                      .dwendtag $C$DW$T$21
     805              
     806              
     807              $C$DW$T$22      .dwtag  DW_TAG_structure_type
     808                      .dwattr $C$DW$T$22, DW_AT_name("CSM_PWL")
     809                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x08)
     810              $C$DW$39        .dwtag  DW_TAG_member
     811                      .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$19)
     812                      .dwattr $C$DW$39, DW_AT_name("PSWD0")
     813                      .dwattr $C$DW$39, DW_AT_TI_symbol_name("_PSWD0")
     814                      .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     815                      .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     816              
     817              $C$DW$40        .dwtag  DW_TAG_member
     818                      .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$19)
     819                      .dwattr $C$DW$40, DW_AT_name("PSWD1")
     820                      .dwattr $C$DW$40, DW_AT_TI_symbol_name("_PSWD1")
     821                      .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     822                      .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     823              
     824              $C$DW$41        .dwtag  DW_TAG_member
     825                      .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$19)
     826                      .dwattr $C$DW$41, DW_AT_name("PSWD2")
     827                      .dwattr $C$DW$41, DW_AT_TI_symbol_name("_PSWD2")
     828                      .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     829                      .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     830              
     831              $C$DW$42        .dwtag  DW_TAG_member
     832                      .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$19)
     833                      .dwattr $C$DW$42, DW_AT_name("PSWD3")
     834                      .dwattr $C$DW$42, DW_AT_TI_symbol_name("_PSWD3")
     835                      .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
     836                      .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     837              
     838              $C$DW$43        .dwtag  DW_TAG_member
     839                      .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$19)
     840                      .dwattr $C$DW$43, DW_AT_name("PSWD4")
     841                      .dwattr $C$DW$43, DW_AT_TI_symbol_name("_PSWD4")
     842                      .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     843                      .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     844              
     845              $C$DW$44        .dwtag  DW_TAG_member
     846                      .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$19)
     847                      .dwattr $C$DW$44, DW_AT_name("PSWD5")
     848                      .dwattr $C$DW$44, DW_AT_TI_symbol_name("_PSWD5")
     849                      .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
     850                      .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     851              
     852              $C$DW$45        .dwtag  DW_TAG_member
     853                      .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$19)
     854                      .dwattr $C$DW$45, DW_AT_name("PSWD6")
     855                      .dwattr $C$DW$45, DW_AT_TI_symbol_name("_PSWD6")
     856                      .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
TMS320C2000 Assembler PC v15.12.1 Sat Jun 25 21:32:08 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\RJKJ_ZGH\AppData\Local\Temp\0869210                         PAGE   18

     857                      .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     858              
     859              $C$DW$46        .dwtag  DW_TAG_member
     860                      .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$19)
     861                      .dwattr $C$DW$46, DW_AT_name("PSWD7")
     862                      .dwattr $C$DW$46, DW_AT_TI_symbol_name("_PSWD7")
     863                      .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
     864                      .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     865              
     866                      .dwendtag $C$DW$T$22
     867              
     868              $C$DW$47        .dwtag  DW_TAG_TI_far_type
     869                      .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$22)
     870              
     871              $C$DW$T$77      .dwtag  DW_TAG_volatile_type
     872                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$47)
     873              
     874              
     875              $C$DW$T$23      .dwtag  DW_TAG_structure_type
     876                      .dwattr $C$DW$T$23, DW_AT_name("CSM_REGS")
     877                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x10)
     878              $C$DW$48        .dwtag  DW_TAG_member
     879                      .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$19)
     880                      .dwattr $C$DW$48, DW_AT_name("KEY0")
     881                      .dwattr $C$DW$48, DW_AT_TI_symbol_name("_KEY0")
     882                      .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     883                      .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     884              
     885              $C$DW$49        .dwtag  DW_TAG_member
     886                      .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$19)
     887                      .dwattr $C$DW$49, DW_AT_name("KEY1")
     888                      .dwattr $C$DW$49, DW_AT_TI_symbol_name("_KEY1")
     889                      .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     890                      .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     891              
     892              $C$DW$50        .dwtag  DW_TAG_member
     893                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$19)
     894                      .dwattr $C$DW$50, DW_AT_name("KEY2")
     895                      .dwattr $C$DW$50, DW_AT_TI_symbol_name("_KEY2")
     896                      .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     897                      .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     898              
     899              $C$DW$51        .dwtag  DW_TAG_member
     900                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$19)
     901                      .dwattr $C$DW$51, DW_AT_name("KEY3")
     902                      .dwattr $C$DW$51, DW_AT_TI_symbol_name("_KEY3")
     903                      .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
     904                      .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     905              
     906              $C$DW$52        .dwtag  DW_TAG_member
     907                      .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$19)
     908                      .dwattr $C$DW$52, DW_AT_name("KEY4")
     909                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_KEY4")
     910                      .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     911                      .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.1 Sat Jun 25 21:32:08 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\RJKJ_ZGH\AppData\Local\Temp\0869210                         PAGE   19

     912              
     913              $C$DW$53        .dwtag  DW_TAG_member
     914                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$19)
     915                      .dwattr $C$DW$53, DW_AT_name("KEY5")
     916                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_KEY5")
     917                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
     918                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     919              
     920              $C$DW$54        .dwtag  DW_TAG_member
     921                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$19)
     922                      .dwattr $C$DW$54, DW_AT_name("KEY6")
     923                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_KEY6")
     924                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     925                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     926              
     927              $C$DW$55        .dwtag  DW_TAG_member
     928                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$19)
     929                      .dwattr $C$DW$55, DW_AT_name("KEY7")
     930                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_KEY7")
     931                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
     932                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     933              
     934              $C$DW$56        .dwtag  DW_TAG_member
     935                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$19)
     936                      .dwattr $C$DW$56, DW_AT_name("rsvd1")
     937                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_rsvd1")
     938                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     939                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     940              
     941              $C$DW$57        .dwtag  DW_TAG_member
     942                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$19)
     943                      .dwattr $C$DW$57, DW_AT_name("rsvd2")
     944                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_rsvd2")
     945                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
     946                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     947              
     948              $C$DW$58        .dwtag  DW_TAG_member
     949                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$19)
     950                      .dwattr $C$DW$58, DW_AT_name("rsvd3")
     951                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_rsvd3")
     952                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     953                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     954              
     955              $C$DW$59        .dwtag  DW_TAG_member
     956                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$19)
     957                      .dwattr $C$DW$59, DW_AT_name("rsvd4")
     958                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_rsvd4")
     959                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
     960                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     961              
     962              $C$DW$60        .dwtag  DW_TAG_member
     963                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$19)
     964                      .dwattr $C$DW$60, DW_AT_name("rsvd5")
     965                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_rsvd5")
     966                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
TMS320C2000 Assembler PC v15.12.1 Sat Jun 25 21:32:08 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\RJKJ_ZGH\AppData\Local\Temp\0869210                         PAGE   20

     967                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     968              
     969              $C$DW$61        .dwtag  DW_TAG_member
     970                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$19)
     971                      .dwattr $C$DW$61, DW_AT_name("rsvd6")
     972                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_rsvd6")
     973                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
     974                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     975              
     976              $C$DW$62        .dwtag  DW_TAG_member
     977                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$19)
     978                      .dwattr $C$DW$62, DW_AT_name("rsvd7")
     979                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_rsvd7")
     980                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
     981                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     982              
     983              $C$DW$63        .dwtag  DW_TAG_member
     984                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$21)
     985                      .dwattr $C$DW$63, DW_AT_name("CSMSCR")
     986                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_CSMSCR")
     987                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
     988                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     989              
     990                      .dwendtag $C$DW$T$23
     991              
     992              $C$DW$64        .dwtag  DW_TAG_TI_far_type
     993                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$23)
     994              
     995              $C$DW$T$78      .dwtag  DW_TAG_volatile_type
     996                      .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$64)
     997              
     998              
     999              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    1000                      .dwattr $C$DW$T$24, DW_AT_name("FACTIVEWAIT_BITS")
    1001                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x01)
    1002              $C$DW$65        .dwtag  DW_TAG_member
    1003                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$19)
    1004                      .dwattr $C$DW$65, DW_AT_name("ACTIVEWAIT")
    1005                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_ACTIVEWAIT")
    1006                      .dwattr $C$DW$65, DW_AT_bit_offset(0x07)
    1007                      .dwattr $C$DW$65, DW_AT_bit_size(0x09)
    1008                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1009                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
    1010              
    1011              $C$DW$66        .dwtag  DW_TAG_member
    1012                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$19)
    1013                      .dwattr $C$DW$66, DW_AT_name("rsvd")
    1014                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_rsvd")
    1015                      .dwattr $C$DW$66, DW_AT_bit_offset(0x00)
    1016                      .dwattr $C$DW$66, DW_AT_bit_size(0x07)
    1017                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1018                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
    1019              
    1020                      .dwendtag $C$DW$T$24
    1021              
TMS320C2000 Assembler PC v15.12.1 Sat Jun 25 21:32:08 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\RJKJ_ZGH\AppData\Local\Temp\0869210                         PAGE   21

    1022              
    1023              $C$DW$T$25      .dwtag  DW_TAG_union_type
    1024                      .dwattr $C$DW$T$25, DW_AT_name("FACTIVEWAIT_REG")
    1025                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x01)
    1026              $C$DW$67        .dwtag  DW_TAG_member
    1027                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$19)
    1028                      .dwattr $C$DW$67, DW_AT_name("all")
    1029                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_all")
    1030                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1031                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
    1032              
    1033              $C$DW$68        .dwtag  DW_TAG_member
    1034                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$24)
    1035                      .dwattr $C$DW$68, DW_AT_name("bit")
    1036                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_bit")
    1037                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1038                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
    1039              
    1040                      .dwendtag $C$DW$T$25
    1041              
    1042              
    1043              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    1044                      .dwattr $C$DW$T$26, DW_AT_name("FBANKWAIT_BITS")
    1045                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
    1046              $C$DW$69        .dwtag  DW_TAG_member
    1047                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$19)
    1048                      .dwattr $C$DW$69, DW_AT_name("RANDWAIT")
    1049                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_RANDWAIT")
    1050                      .dwattr $C$DW$69, DW_AT_bit_offset(0x0c)
    1051                      .dwattr $C$DW$69, DW_AT_bit_size(0x04)
    1052                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1053                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
    1054              
    1055              $C$DW$70        .dwtag  DW_TAG_member
    1056                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$19)
    1057                      .dwattr $C$DW$70, DW_AT_name("rsvd1")
    1058                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_rsvd1")
    1059                      .dwattr $C$DW$70, DW_AT_bit_offset(0x08)
    1060                      .dwattr $C$DW$70, DW_AT_bit_size(0x04)
    1061                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1062                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
    1063              
    1064              $C$DW$71        .dwtag  DW_TAG_member
    1065                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$19)
    1066                      .dwattr $C$DW$71, DW_AT_name("PAGEWAIT")
    1067                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_PAGEWAIT")
    1068                      .dwattr $C$DW$71, DW_AT_bit_offset(0x04)
    1069                      .dwattr $C$DW$71, DW_AT_bit_size(0x04)
    1070                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1071                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
    1072              
    1073              $C$DW$72        .dwtag  DW_TAG_member
    1074                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$19)
    1075                      .dwattr $C$DW$72, DW_AT_name("rsvd2")
    1076                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_rsvd2")
TMS320C2000 Assembler PC v15.12.1 Sat Jun 25 21:32:08 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\RJKJ_ZGH\AppData\Local\Temp\0869210                         PAGE   22

    1077                      .dwattr $C$DW$72, DW_AT_bit_offset(0x00)
    1078                      .dwattr $C$DW$72, DW_AT_bit_size(0x04)
    1079                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1080                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
    1081              
    1082                      .dwendtag $C$DW$T$26
    1083              
    1084              
    1085              $C$DW$T$27      .dwtag  DW_TAG_union_type
    1086                      .dwattr $C$DW$T$27, DW_AT_name("FBANKWAIT_REG")
    1087                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
    1088              $C$DW$73        .dwtag  DW_TAG_member
    1089                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$19)
    1090                      .dwattr $C$DW$73, DW_AT_name("all")
    1091                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_all")
    1092                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1093                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
    1094              
    1095              $C$DW$74        .dwtag  DW_TAG_member
    1096                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$26)
    1097                      .dwattr $C$DW$74, DW_AT_name("bit")
    1098                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_bit")
    1099                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1100                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1101              
    1102                      .dwendtag $C$DW$T$27
    1103              
    1104              
    1105              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    1106                      .dwattr $C$DW$T$28, DW_AT_name("FLASH_REGS")
    1107                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x08)
    1108              $C$DW$75        .dwtag  DW_TAG_member
    1109                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$30)
    1110                      .dwattr $C$DW$75, DW_AT_name("FOPT")
    1111                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_FOPT")
    1112                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1113                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1114              
    1115              $C$DW$76        .dwtag  DW_TAG_member
    1116                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$19)
    1117                      .dwattr $C$DW$76, DW_AT_name("rsvd1")
    1118                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_rsvd1")
    1119                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1120                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1121              
    1122              $C$DW$77        .dwtag  DW_TAG_member
    1123                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$34)
    1124                      .dwattr $C$DW$77, DW_AT_name("FPWR")
    1125                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_FPWR")
    1126                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1127                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1128              
    1129              $C$DW$78        .dwtag  DW_TAG_member
    1130                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$36)
    1131                      .dwattr $C$DW$78, DW_AT_name("FSTATUS")
TMS320C2000 Assembler PC v15.12.1 Sat Jun 25 21:32:08 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\RJKJ_ZGH\AppData\Local\Temp\0869210                         PAGE   23

    1132                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_FSTATUS")
    1133                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1134                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1135              
    1136              $C$DW$79        .dwtag  DW_TAG_member
    1137                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$38)
    1138                      .dwattr $C$DW$79, DW_AT_name("FSTDBYWAIT")
    1139                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_FSTDBYWAIT")
    1140                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1141                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1142              
    1143              $C$DW$80        .dwtag  DW_TAG_member
    1144                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$25)
    1145                      .dwattr $C$DW$80, DW_AT_name("FACTIVEWAIT")
    1146                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_FACTIVEWAIT")
    1147                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1148                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1149              
    1150              $C$DW$81        .dwtag  DW_TAG_member
    1151                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$27)
    1152                      .dwattr $C$DW$81, DW_AT_name("FBANKWAIT")
    1153                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_FBANKWAIT")
    1154                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1155                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1156              
    1157              $C$DW$82        .dwtag  DW_TAG_member
    1158                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$32)
    1159                      .dwattr $C$DW$82, DW_AT_name("FOTPWAIT")
    1160                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_FOTPWAIT")
    1161                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1162                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1163              
    1164                      .dwendtag $C$DW$T$28
    1165              
    1166              $C$DW$83        .dwtag  DW_TAG_TI_far_type
    1167                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$28)
    1168              
    1169              $C$DW$T$83      .dwtag  DW_TAG_volatile_type
    1170                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$83)
    1171              
    1172              
    1173              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    1174                      .dwattr $C$DW$T$29, DW_AT_name("FOPT_BITS")
    1175                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
    1176              $C$DW$84        .dwtag  DW_TAG_member
    1177                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$19)
    1178                      .dwattr $C$DW$84, DW_AT_name("ENPIPE")
    1179                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_ENPIPE")
    1180                      .dwattr $C$DW$84, DW_AT_bit_offset(0x0f)
    1181                      .dwattr $C$DW$84, DW_AT_bit_size(0x01)
    1182                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1183                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1184              
    1185              $C$DW$85        .dwtag  DW_TAG_member
    1186                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v15.12.1 Sat Jun 25 21:32:08 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\RJKJ_ZGH\AppData\Local\Temp\0869210                         PAGE   24

    1187                      .dwattr $C$DW$85, DW_AT_name("rsvd")
    1188                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_rsvd")
    1189                      .dwattr $C$DW$85, DW_AT_bit_offset(0x00)
    1190                      .dwattr $C$DW$85, DW_AT_bit_size(0x0f)
    1191                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1192                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1193              
    1194                      .dwendtag $C$DW$T$29
    1195              
    1196              
    1197              $C$DW$T$30      .dwtag  DW_TAG_union_type
    1198                      .dwattr $C$DW$T$30, DW_AT_name("FOPT_REG")
    1199                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x01)
    1200              $C$DW$86        .dwtag  DW_TAG_member
    1201                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$19)
    1202                      .dwattr $C$DW$86, DW_AT_name("all")
    1203                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_all")
    1204                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1205                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1206              
    1207              $C$DW$87        .dwtag  DW_TAG_member
    1208                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$29)
    1209                      .dwattr $C$DW$87, DW_AT_name("bit")
    1210                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_bit")
    1211                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1212                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1213              
    1214                      .dwendtag $C$DW$T$30
    1215              
    1216              
    1217              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    1218                      .dwattr $C$DW$T$31, DW_AT_name("FOTPWAIT_BITS")
    1219                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x01)
    1220              $C$DW$88        .dwtag  DW_TAG_member
    1221                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$19)
    1222                      .dwattr $C$DW$88, DW_AT_name("OTPWAIT")
    1223                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_OTPWAIT")
    1224                      .dwattr $C$DW$88, DW_AT_bit_offset(0x0b)
    1225                      .dwattr $C$DW$88, DW_AT_bit_size(0x05)
    1226                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1227                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1228              
    1229              $C$DW$89        .dwtag  DW_TAG_member
    1230                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$19)
    1231                      .dwattr $C$DW$89, DW_AT_name("rsvd")
    1232                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_rsvd")
    1233                      .dwattr $C$DW$89, DW_AT_bit_offset(0x00)
    1234                      .dwattr $C$DW$89, DW_AT_bit_size(0x0b)
    1235                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1236                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1237              
    1238                      .dwendtag $C$DW$T$31
    1239              
    1240              
    1241              $C$DW$T$32      .dwtag  DW_TAG_union_type
TMS320C2000 Assembler PC v15.12.1 Sat Jun 25 21:32:08 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\RJKJ_ZGH\AppData\Local\Temp\0869210                         PAGE   25

    1242                      .dwattr $C$DW$T$32, DW_AT_name("FOTPWAIT_REG")
    1243                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x01)
    1244              $C$DW$90        .dwtag  DW_TAG_member
    1245                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$19)
    1246                      .dwattr $C$DW$90, DW_AT_name("all")
    1247                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_all")
    1248                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1249                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1250              
    1251              $C$DW$91        .dwtag  DW_TAG_member
    1252                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$31)
    1253                      .dwattr $C$DW$91, DW_AT_name("bit")
    1254                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_bit")
    1255                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1256                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1257              
    1258                      .dwendtag $C$DW$T$32
    1259              
    1260              
    1261              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    1262                      .dwattr $C$DW$T$33, DW_AT_name("FPWR_BITS")
    1263                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
    1264              $C$DW$92        .dwtag  DW_TAG_member
    1265                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$19)
    1266                      .dwattr $C$DW$92, DW_AT_name("PWR")
    1267                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_PWR")
    1268                      .dwattr $C$DW$92, DW_AT_bit_offset(0x0e)
    1269                      .dwattr $C$DW$92, DW_AT_bit_size(0x02)
    1270                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1271                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1272              
    1273              $C$DW$93        .dwtag  DW_TAG_member
    1274                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$19)
    1275                      .dwattr $C$DW$93, DW_AT_name("rsvd")
    1276                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_rsvd")
    1277                      .dwattr $C$DW$93, DW_AT_bit_offset(0x00)
    1278                      .dwattr $C$DW$93, DW_AT_bit_size(0x0e)
    1279                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1280                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1281              
    1282                      .dwendtag $C$DW$T$33
    1283              
    1284              
    1285              $C$DW$T$34      .dwtag  DW_TAG_union_type
    1286                      .dwattr $C$DW$T$34, DW_AT_name("FPWR_REG")
    1287                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
    1288              $C$DW$94        .dwtag  DW_TAG_member
    1289                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$19)
    1290                      .dwattr $C$DW$94, DW_AT_name("all")
    1291                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_all")
    1292                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1293                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1294              
    1295              $C$DW$95        .dwtag  DW_TAG_member
    1296                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$33)
TMS320C2000 Assembler PC v15.12.1 Sat Jun 25 21:32:08 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\RJKJ_ZGH\AppData\Local\Temp\0869210                         PAGE   26

    1297                      .dwattr $C$DW$95, DW_AT_name("bit")
    1298                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_bit")
    1299                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1300                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1301              
    1302                      .dwendtag $C$DW$T$34
    1303              
    1304              
    1305              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    1306                      .dwattr $C$DW$T$35, DW_AT_name("FSTATUS_BITS")
    1307                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x01)
    1308              $C$DW$96        .dwtag  DW_TAG_member
    1309                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$19)
    1310                      .dwattr $C$DW$96, DW_AT_name("PWRS")
    1311                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_PWRS")
    1312                      .dwattr $C$DW$96, DW_AT_bit_offset(0x0e)
    1313                      .dwattr $C$DW$96, DW_AT_bit_size(0x02)
    1314                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1315                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1316              
    1317              $C$DW$97        .dwtag  DW_TAG_member
    1318                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$19)
    1319                      .dwattr $C$DW$97, DW_AT_name("STDBYWAITS")
    1320                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_STDBYWAITS")
    1321                      .dwattr $C$DW$97, DW_AT_bit_offset(0x0d)
    1322                      .dwattr $C$DW$97, DW_AT_bit_size(0x01)
    1323                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1324                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1325              
    1326              $C$DW$98        .dwtag  DW_TAG_member
    1327                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$19)
    1328                      .dwattr $C$DW$98, DW_AT_name("ACTIVEWAITS")
    1329                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_ACTIVEWAITS")
    1330                      .dwattr $C$DW$98, DW_AT_bit_offset(0x0c)
    1331                      .dwattr $C$DW$98, DW_AT_bit_size(0x01)
    1332                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1333                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1334              
    1335              $C$DW$99        .dwtag  DW_TAG_member
    1336                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$19)
    1337                      .dwattr $C$DW$99, DW_AT_name("rsvd1")
    1338                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_rsvd1")
    1339                      .dwattr $C$DW$99, DW_AT_bit_offset(0x08)
    1340                      .dwattr $C$DW$99, DW_AT_bit_size(0x04)
    1341                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1342                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1343              
    1344              $C$DW$100       .dwtag  DW_TAG_member
    1345                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$19)
    1346                      .dwattr $C$DW$100, DW_AT_name("V3STAT")
    1347                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_V3STAT")
    1348                      .dwattr $C$DW$100, DW_AT_bit_offset(0x07)
    1349                      .dwattr $C$DW$100, DW_AT_bit_size(0x01)
    1350                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1351                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.1 Sat Jun 25 21:32:08 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\RJKJ_ZGH\AppData\Local\Temp\0869210                         PAGE   27

    1352              
    1353              $C$DW$101       .dwtag  DW_TAG_member
    1354                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$19)
    1355                      .dwattr $C$DW$101, DW_AT_name("rsvd2")
    1356                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_rsvd2")
    1357                      .dwattr $C$DW$101, DW_AT_bit_offset(0x00)
    1358                      .dwattr $C$DW$101, DW_AT_bit_size(0x07)
    1359                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1360                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1361              
    1362                      .dwendtag $C$DW$T$35
    1363              
    1364              
    1365              $C$DW$T$36      .dwtag  DW_TAG_union_type
    1366                      .dwattr $C$DW$T$36, DW_AT_name("FSTATUS_REG")
    1367                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
    1368              $C$DW$102       .dwtag  DW_TAG_member
    1369                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$19)
    1370                      .dwattr $C$DW$102, DW_AT_name("all")
    1371                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_all")
    1372                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1373                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1374              
    1375              $C$DW$103       .dwtag  DW_TAG_member
    1376                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$35)
    1377                      .dwattr $C$DW$103, DW_AT_name("bit")
    1378                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_bit")
    1379                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1380                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1381              
    1382                      .dwendtag $C$DW$T$36
    1383              
    1384              
    1385              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    1386                      .dwattr $C$DW$T$37, DW_AT_name("FSTDBYWAIT_BITS")
    1387                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
    1388              $C$DW$104       .dwtag  DW_TAG_member
    1389                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
    1390                      .dwattr $C$DW$104, DW_AT_name("STDBYWAIT")
    1391                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_STDBYWAIT")
    1392                      .dwattr $C$DW$104, DW_AT_bit_offset(0x07)
    1393                      .dwattr $C$DW$104, DW_AT_bit_size(0x09)
    1394                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1395                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1396              
    1397              $C$DW$105       .dwtag  DW_TAG_member
    1398                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$19)
    1399                      .dwattr $C$DW$105, DW_AT_name("rsvd")
    1400                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_rsvd")
    1401                      .dwattr $C$DW$105, DW_AT_bit_offset(0x00)
    1402                      .dwattr $C$DW$105, DW_AT_bit_size(0x07)
    1403                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1404                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1405              
    1406                      .dwendtag $C$DW$T$37
TMS320C2000 Assembler PC v15.12.1 Sat Jun 25 21:32:08 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\RJKJ_ZGH\AppData\Local\Temp\0869210                         PAGE   28

    1407              
    1408              
    1409              $C$DW$T$38      .dwtag  DW_TAG_union_type
    1410                      .dwattr $C$DW$T$38, DW_AT_name("FSTDBYWAIT_REG")
    1411                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x01)
    1412              $C$DW$106       .dwtag  DW_TAG_member
    1413                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$19)
    1414                      .dwattr $C$DW$106, DW_AT_name("all")
    1415                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_all")
    1416                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1417                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1418              
    1419              $C$DW$107       .dwtag  DW_TAG_member
    1420                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$37)
    1421                      .dwattr $C$DW$107, DW_AT_name("bit")
    1422                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_bit")
    1423                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1424                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1425              
    1426                      .dwendtag $C$DW$T$38
    1427              
    1428              
    1429              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    1430                      .dwattr $C$DW$T$39, DW_AT_name("HISPCP_BITS")
    1431                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x01)
    1432              $C$DW$108       .dwtag  DW_TAG_member
    1433                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$19)
    1434                      .dwattr $C$DW$108, DW_AT_name("HSPCLK")
    1435                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_HSPCLK")
    1436                      .dwattr $C$DW$108, DW_AT_bit_offset(0x0d)
    1437                      .dwattr $C$DW$108, DW_AT_bit_size(0x03)
    1438                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1439                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1440              
    1441              $C$DW$109       .dwtag  DW_TAG_member
    1442                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
    1443                      .dwattr $C$DW$109, DW_AT_name("rsvd1")
    1444                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_rsvd1")
    1445                      .dwattr $C$DW$109, DW_AT_bit_offset(0x00)
    1446                      .dwattr $C$DW$109, DW_AT_bit_size(0x0d)
    1447                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1448                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1449              
    1450                      .dwendtag $C$DW$T$39
    1451              
    1452              
    1453              $C$DW$T$40      .dwtag  DW_TAG_union_type
    1454                      .dwattr $C$DW$T$40, DW_AT_name("HISPCP_REG")
    1455                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x01)
    1456              $C$DW$110       .dwtag  DW_TAG_member
    1457                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
    1458                      .dwattr $C$DW$110, DW_AT_name("all")
    1459                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_all")
    1460                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1461                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.1 Sat Jun 25 21:32:08 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\RJKJ_ZGH\AppData\Local\Temp\0869210                         PAGE   29

    1462              
    1463              $C$DW$111       .dwtag  DW_TAG_member
    1464                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$39)
    1465                      .dwattr $C$DW$111, DW_AT_name("bit")
    1466                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_bit")
    1467                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1468                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1469              
    1470                      .dwendtag $C$DW$T$40
    1471              
    1472              
    1473              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    1474                      .dwattr $C$DW$T$41, DW_AT_name("LOSPCP_BITS")
    1475                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x01)
    1476              $C$DW$112       .dwtag  DW_TAG_member
    1477                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
    1478                      .dwattr $C$DW$112, DW_AT_name("LSPCLK")
    1479                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_LSPCLK")
    1480                      .dwattr $C$DW$112, DW_AT_bit_offset(0x0d)
    1481                      .dwattr $C$DW$112, DW_AT_bit_size(0x03)
    1482                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1483                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1484              
    1485              $C$DW$113       .dwtag  DW_TAG_member
    1486                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
    1487                      .dwattr $C$DW$113, DW_AT_name("rsvd1")
    1488                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_rsvd1")
    1489                      .dwattr $C$DW$113, DW_AT_bit_offset(0x00)
    1490                      .dwattr $C$DW$113, DW_AT_bit_size(0x0d)
    1491                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1492                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1493              
    1494                      .dwendtag $C$DW$T$41
    1495              
    1496              
    1497              $C$DW$T$42      .dwtag  DW_TAG_union_type
    1498                      .dwattr $C$DW$T$42, DW_AT_name("LOSPCP_REG")
    1499                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x01)
    1500              $C$DW$114       .dwtag  DW_TAG_member
    1501                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
    1502                      .dwattr $C$DW$114, DW_AT_name("all")
    1503                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_all")
    1504                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1505                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1506              
    1507              $C$DW$115       .dwtag  DW_TAG_member
    1508                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$41)
    1509                      .dwattr $C$DW$115, DW_AT_name("bit")
    1510                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_bit")
    1511                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1512                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1513              
    1514                      .dwendtag $C$DW$T$42
    1515              
    1516              
TMS320C2000 Assembler PC v15.12.1 Sat Jun 25 21:32:08 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\RJKJ_ZGH\AppData\Local\Temp\0869210                         PAGE   30

    1517              $C$DW$T$43      .dwtag  DW_TAG_structure_type
    1518                      .dwattr $C$DW$T$43, DW_AT_name("LPMCR0_BITS")
    1519                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x01)
    1520              $C$DW$116       .dwtag  DW_TAG_member
    1521                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
    1522                      .dwattr $C$DW$116, DW_AT_name("LPM")
    1523                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_LPM")
    1524                      .dwattr $C$DW$116, DW_AT_bit_offset(0x0e)
    1525                      .dwattr $C$DW$116, DW_AT_bit_size(0x02)
    1526                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1527                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1528              
    1529              $C$DW$117       .dwtag  DW_TAG_member
    1530                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    1531                      .dwattr $C$DW$117, DW_AT_name("QUALSTDBY")
    1532                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_QUALSTDBY")
    1533                      .dwattr $C$DW$117, DW_AT_bit_offset(0x08)
    1534                      .dwattr $C$DW$117, DW_AT_bit_size(0x06)
    1535                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1536                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1537              
    1538              $C$DW$118       .dwtag  DW_TAG_member
    1539                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
    1540                      .dwattr $C$DW$118, DW_AT_name("rsvd1")
    1541                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_rsvd1")
    1542                      .dwattr $C$DW$118, DW_AT_bit_offset(0x01)
    1543                      .dwattr $C$DW$118, DW_AT_bit_size(0x07)
    1544                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1545                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1546              
    1547              $C$DW$119       .dwtag  DW_TAG_member
    1548                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
    1549                      .dwattr $C$DW$119, DW_AT_name("WDINTE")
    1550                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_WDINTE")
    1551                      .dwattr $C$DW$119, DW_AT_bit_offset(0x00)
    1552                      .dwattr $C$DW$119, DW_AT_bit_size(0x01)
    1553                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1554                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1555              
    1556                      .dwendtag $C$DW$T$43
    1557              
    1558              
    1559              $C$DW$T$44      .dwtag  DW_TAG_union_type
    1560                      .dwattr $C$DW$T$44, DW_AT_name("LPMCR0_REG")
    1561                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x01)
    1562              $C$DW$120       .dwtag  DW_TAG_member
    1563                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$19)
    1564                      .dwattr $C$DW$120, DW_AT_name("all")
    1565                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_all")
    1566                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1567                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1568              
    1569              $C$DW$121       .dwtag  DW_TAG_member
    1570                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$43)
    1571                      .dwattr $C$DW$121, DW_AT_name("bit")
TMS320C2000 Assembler PC v15.12.1 Sat Jun 25 21:32:08 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\RJKJ_ZGH\AppData\Local\Temp\0869210                         PAGE   31

    1572                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_bit")
    1573                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1574                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1575              
    1576                      .dwendtag $C$DW$T$44
    1577              
    1578              
    1579              $C$DW$T$45      .dwtag  DW_TAG_structure_type
    1580                      .dwattr $C$DW$T$45, DW_AT_name("MAPCNF_BITS")
    1581                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x01)
    1582              $C$DW$122       .dwtag  DW_TAG_member
    1583                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$19)
    1584                      .dwattr $C$DW$122, DW_AT_name("MAPEPWM")
    1585                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_MAPEPWM")
    1586                      .dwattr $C$DW$122, DW_AT_bit_offset(0x0f)
    1587                      .dwattr $C$DW$122, DW_AT_bit_size(0x01)
    1588                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1589                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1590              
    1591              $C$DW$123       .dwtag  DW_TAG_member
    1592                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$19)
    1593                      .dwattr $C$DW$123, DW_AT_name("rsvd1")
    1594                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_rsvd1")
    1595                      .dwattr $C$DW$123, DW_AT_bit_offset(0x00)
    1596                      .dwattr $C$DW$123, DW_AT_bit_size(0x0f)
    1597                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1598                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1599              
    1600                      .dwendtag $C$DW$T$45
    1601              
    1602              
    1603              $C$DW$T$46      .dwtag  DW_TAG_union_type
    1604                      .dwattr $C$DW$T$46, DW_AT_name("MAPCNF_REG")
    1605                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x01)
    1606              $C$DW$124       .dwtag  DW_TAG_member
    1607                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
    1608                      .dwattr $C$DW$124, DW_AT_name("all")
    1609                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_all")
    1610                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1611                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1612              
    1613              $C$DW$125       .dwtag  DW_TAG_member
    1614                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$45)
    1615                      .dwattr $C$DW$125, DW_AT_name("bit")
    1616                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_bit")
    1617                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1618                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1619              
    1620                      .dwendtag $C$DW$T$46
    1621              
    1622              
    1623              $C$DW$T$47      .dwtag  DW_TAG_structure_type
    1624                      .dwattr $C$DW$T$47, DW_AT_name("PCLKCR0_BITS")
    1625                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x01)
    1626              $C$DW$126       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.1 Sat Jun 25 21:32:08 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\RJKJ_ZGH\AppData\Local\Temp\0869210                         PAGE   32

    1627                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
    1628                      .dwattr $C$DW$126, DW_AT_name("rsvd1")
    1629                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_rsvd1")
    1630                      .dwattr $C$DW$126, DW_AT_bit_offset(0x0e)
    1631                      .dwattr $C$DW$126, DW_AT_bit_size(0x02)
    1632                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1633                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1634              
    1635              $C$DW$127       .dwtag  DW_TAG_member
    1636                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
    1637                      .dwattr $C$DW$127, DW_AT_name("TBCLKSYNC")
    1638                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_TBCLKSYNC")
    1639                      .dwattr $C$DW$127, DW_AT_bit_offset(0x0d)
    1640                      .dwattr $C$DW$127, DW_AT_bit_size(0x01)
    1641                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1642                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1643              
    1644              $C$DW$128       .dwtag  DW_TAG_member
    1645                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    1646                      .dwattr $C$DW$128, DW_AT_name("ADCENCLK")
    1647                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_ADCENCLK")
    1648                      .dwattr $C$DW$128, DW_AT_bit_offset(0x0c)
    1649                      .dwattr $C$DW$128, DW_AT_bit_size(0x01)
    1650                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1651                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1652              
    1653              $C$DW$129       .dwtag  DW_TAG_member
    1654                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$19)
    1655                      .dwattr $C$DW$129, DW_AT_name("I2CAENCLK")
    1656                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_I2CAENCLK")
    1657                      .dwattr $C$DW$129, DW_AT_bit_offset(0x0b)
    1658                      .dwattr $C$DW$129, DW_AT_bit_size(0x01)
    1659                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1660                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1661              
    1662              $C$DW$130       .dwtag  DW_TAG_member
    1663                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$19)
    1664                      .dwattr $C$DW$130, DW_AT_name("SCICENCLK")
    1665                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_SCICENCLK")
    1666                      .dwattr $C$DW$130, DW_AT_bit_offset(0x0a)
    1667                      .dwattr $C$DW$130, DW_AT_bit_size(0x01)
    1668                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1669                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1670              
    1671              $C$DW$131       .dwtag  DW_TAG_member
    1672                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
    1673                      .dwattr $C$DW$131, DW_AT_name("rsvd2")
    1674                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_rsvd2")
    1675                      .dwattr $C$DW$131, DW_AT_bit_offset(0x08)
    1676                      .dwattr $C$DW$131, DW_AT_bit_size(0x02)
    1677                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1678                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1679              
    1680              $C$DW$132       .dwtag  DW_TAG_member
    1681                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v15.12.1 Sat Jun 25 21:32:08 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\RJKJ_ZGH\AppData\Local\Temp\0869210                         PAGE   33

    1682                      .dwattr $C$DW$132, DW_AT_name("SPIAENCLK")
    1683                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_SPIAENCLK")
    1684                      .dwattr $C$DW$132, DW_AT_bit_offset(0x07)
    1685                      .dwattr $C$DW$132, DW_AT_bit_size(0x01)
    1686                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1687                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1688              
    1689              $C$DW$133       .dwtag  DW_TAG_member
    1690                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$19)
    1691                      .dwattr $C$DW$133, DW_AT_name("rsvd3")
    1692                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_rsvd3")
    1693                      .dwattr $C$DW$133, DW_AT_bit_offset(0x06)
    1694                      .dwattr $C$DW$133, DW_AT_bit_size(0x01)
    1695                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1696                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1697              
    1698              $C$DW$134       .dwtag  DW_TAG_member
    1699                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$19)
    1700                      .dwattr $C$DW$134, DW_AT_name("SCIAENCLK")
    1701                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_SCIAENCLK")
    1702                      .dwattr $C$DW$134, DW_AT_bit_offset(0x05)
    1703                      .dwattr $C$DW$134, DW_AT_bit_size(0x01)
    1704                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1705                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1706              
    1707              $C$DW$135       .dwtag  DW_TAG_member
    1708                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$19)
    1709                      .dwattr $C$DW$135, DW_AT_name("SCIBENCLK")
    1710                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_SCIBENCLK")
    1711                      .dwattr $C$DW$135, DW_AT_bit_offset(0x04)
    1712                      .dwattr $C$DW$135, DW_AT_bit_size(0x01)
    1713                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1714                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1715              
    1716              $C$DW$136       .dwtag  DW_TAG_member
    1717                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$19)
    1718                      .dwattr $C$DW$136, DW_AT_name("MCBSPAENCLK")
    1719                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_MCBSPAENCLK")
    1720                      .dwattr $C$DW$136, DW_AT_bit_offset(0x03)
    1721                      .dwattr $C$DW$136, DW_AT_bit_size(0x01)
    1722                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1723                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1724              
    1725              $C$DW$137       .dwtag  DW_TAG_member
    1726                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$19)
    1727                      .dwattr $C$DW$137, DW_AT_name("MCBSPBENCLK")
    1728                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_MCBSPBENCLK")
    1729                      .dwattr $C$DW$137, DW_AT_bit_offset(0x02)
    1730                      .dwattr $C$DW$137, DW_AT_bit_size(0x01)
    1731                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1732                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1733              
    1734              $C$DW$138       .dwtag  DW_TAG_member
    1735                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$19)
    1736                      .dwattr $C$DW$138, DW_AT_name("ECANAENCLK")
TMS320C2000 Assembler PC v15.12.1 Sat Jun 25 21:32:08 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\RJKJ_ZGH\AppData\Local\Temp\0869210                         PAGE   34

    1737                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_ECANAENCLK")
    1738                      .dwattr $C$DW$138, DW_AT_bit_offset(0x01)
    1739                      .dwattr $C$DW$138, DW_AT_bit_size(0x01)
    1740                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1741                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1742              
    1743              $C$DW$139       .dwtag  DW_TAG_member
    1744                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$19)
    1745                      .dwattr $C$DW$139, DW_AT_name("ECANBENCLK")
    1746                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_ECANBENCLK")
    1747                      .dwattr $C$DW$139, DW_AT_bit_offset(0x00)
    1748                      .dwattr $C$DW$139, DW_AT_bit_size(0x01)
    1749                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1750                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1751              
    1752                      .dwendtag $C$DW$T$47
    1753              
    1754              
    1755              $C$DW$T$48      .dwtag  DW_TAG_union_type
    1756                      .dwattr $C$DW$T$48, DW_AT_name("PCLKCR0_REG")
    1757                      .dwattr $C$DW$T$48, DW_AT_byte_size(0x01)
    1758              $C$DW$140       .dwtag  DW_TAG_member
    1759                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$19)
    1760                      .dwattr $C$DW$140, DW_AT_name("all")
    1761                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_all")
    1762                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1763                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1764              
    1765              $C$DW$141       .dwtag  DW_TAG_member
    1766                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$47)
    1767                      .dwattr $C$DW$141, DW_AT_name("bit")
    1768                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_bit")
    1769                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1770                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1771              
    1772                      .dwendtag $C$DW$T$48
    1773              
    1774              
    1775              $C$DW$T$49      .dwtag  DW_TAG_structure_type
    1776                      .dwattr $C$DW$T$49, DW_AT_name("PCLKCR1_BITS")
    1777                      .dwattr $C$DW$T$49, DW_AT_byte_size(0x01)
    1778              $C$DW$142       .dwtag  DW_TAG_member
    1779                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$19)
    1780                      .dwattr $C$DW$142, DW_AT_name("EPWM1ENCLK")
    1781                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_EPWM1ENCLK")
    1782                      .dwattr $C$DW$142, DW_AT_bit_offset(0x0f)
    1783                      .dwattr $C$DW$142, DW_AT_bit_size(0x01)
    1784                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1785                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1786              
    1787              $C$DW$143       .dwtag  DW_TAG_member
    1788                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$19)
    1789                      .dwattr $C$DW$143, DW_AT_name("EPWM2ENCLK")
    1790                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_EPWM2ENCLK")
    1791                      .dwattr $C$DW$143, DW_AT_bit_offset(0x0e)
TMS320C2000 Assembler PC v15.12.1 Sat Jun 25 21:32:08 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\RJKJ_ZGH\AppData\Local\Temp\0869210                         PAGE   35

    1792                      .dwattr $C$DW$143, DW_AT_bit_size(0x01)
    1793                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1794                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1795              
    1796              $C$DW$144       .dwtag  DW_TAG_member
    1797                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$19)
    1798                      .dwattr $C$DW$144, DW_AT_name("EPWM3ENCLK")
    1799                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_EPWM3ENCLK")
    1800                      .dwattr $C$DW$144, DW_AT_bit_offset(0x0d)
    1801                      .dwattr $C$DW$144, DW_AT_bit_size(0x01)
    1802                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1803                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1804              
    1805              $C$DW$145       .dwtag  DW_TAG_member
    1806                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$19)
    1807                      .dwattr $C$DW$145, DW_AT_name("EPWM4ENCLK")
    1808                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_EPWM4ENCLK")
    1809                      .dwattr $C$DW$145, DW_AT_bit_offset(0x0c)
    1810                      .dwattr $C$DW$145, DW_AT_bit_size(0x01)
    1811                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1812                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1813              
    1814              $C$DW$146       .dwtag  DW_TAG_member
    1815                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$19)
    1816                      .dwattr $C$DW$146, DW_AT_name("EPWM5ENCLK")
    1817                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_EPWM5ENCLK")
    1818                      .dwattr $C$DW$146, DW_AT_bit_offset(0x0b)
    1819                      .dwattr $C$DW$146, DW_AT_bit_size(0x01)
    1820                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1821                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1822              
    1823              $C$DW$147       .dwtag  DW_TAG_member
    1824                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$19)
    1825                      .dwattr $C$DW$147, DW_AT_name("EPWM6ENCLK")
    1826                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_EPWM6ENCLK")
    1827                      .dwattr $C$DW$147, DW_AT_bit_offset(0x0a)
    1828                      .dwattr $C$DW$147, DW_AT_bit_size(0x01)
    1829                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1830                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1831              
    1832              $C$DW$148       .dwtag  DW_TAG_member
    1833                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$19)
    1834                      .dwattr $C$DW$148, DW_AT_name("rsvd1")
    1835                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_rsvd1")
    1836                      .dwattr $C$DW$148, DW_AT_bit_offset(0x08)
    1837                      .dwattr $C$DW$148, DW_AT_bit_size(0x02)
    1838                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1839                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1840              
    1841              $C$DW$149       .dwtag  DW_TAG_member
    1842                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$19)
    1843                      .dwattr $C$DW$149, DW_AT_name("ECAP1ENCLK")
    1844                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_ECAP1ENCLK")
    1845                      .dwattr $C$DW$149, DW_AT_bit_offset(0x07)
    1846                      .dwattr $C$DW$149, DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v15.12.1 Sat Jun 25 21:32:08 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\RJKJ_ZGH\AppData\Local\Temp\0869210                         PAGE   36

    1847                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1848                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1849              
    1850              $C$DW$150       .dwtag  DW_TAG_member
    1851                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$19)
    1852                      .dwattr $C$DW$150, DW_AT_name("ECAP2ENCLK")
    1853                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_ECAP2ENCLK")
    1854                      .dwattr $C$DW$150, DW_AT_bit_offset(0x06)
    1855                      .dwattr $C$DW$150, DW_AT_bit_size(0x01)
    1856                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1857                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1858              
    1859              $C$DW$151       .dwtag  DW_TAG_member
    1860                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$19)
    1861                      .dwattr $C$DW$151, DW_AT_name("ECAP3ENCLK")
    1862                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_ECAP3ENCLK")
    1863                      .dwattr $C$DW$151, DW_AT_bit_offset(0x05)
    1864                      .dwattr $C$DW$151, DW_AT_bit_size(0x01)
    1865                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1866                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1867              
    1868              $C$DW$152       .dwtag  DW_TAG_member
    1869                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$19)
    1870                      .dwattr $C$DW$152, DW_AT_name("ECAP4ENCLK")
    1871                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_ECAP4ENCLK")
    1872                      .dwattr $C$DW$152, DW_AT_bit_offset(0x04)
    1873                      .dwattr $C$DW$152, DW_AT_bit_size(0x01)
    1874                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1875                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1876              
    1877              $C$DW$153       .dwtag  DW_TAG_member
    1878                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$19)
    1879                      .dwattr $C$DW$153, DW_AT_name("ECAP5ENCLK")
    1880                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_ECAP5ENCLK")
    1881                      .dwattr $C$DW$153, DW_AT_bit_offset(0x03)
    1882                      .dwattr $C$DW$153, DW_AT_bit_size(0x01)
    1883                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1884                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1885              
    1886              $C$DW$154       .dwtag  DW_TAG_member
    1887                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$19)
    1888                      .dwattr $C$DW$154, DW_AT_name("ECAP6ENCLK")
    1889                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_ECAP6ENCLK")
    1890                      .dwattr $C$DW$154, DW_AT_bit_offset(0x02)
    1891                      .dwattr $C$DW$154, DW_AT_bit_size(0x01)
    1892                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1893                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1894              
    1895              $C$DW$155       .dwtag  DW_TAG_member
    1896                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$19)
    1897                      .dwattr $C$DW$155, DW_AT_name("EQEP1ENCLK")
    1898                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_EQEP1ENCLK")
    1899                      .dwattr $C$DW$155, DW_AT_bit_offset(0x01)
    1900                      .dwattr $C$DW$155, DW_AT_bit_size(0x01)
    1901                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v15.12.1 Sat Jun 25 21:32:08 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\RJKJ_ZGH\AppData\Local\Temp\0869210                         PAGE   37

    1902                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1903              
    1904              $C$DW$156       .dwtag  DW_TAG_member
    1905                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$19)
    1906                      .dwattr $C$DW$156, DW_AT_name("EQEP2ENCLK")
    1907                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_EQEP2ENCLK")
    1908                      .dwattr $C$DW$156, DW_AT_bit_offset(0x00)
    1909                      .dwattr $C$DW$156, DW_AT_bit_size(0x01)
    1910                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1911                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1912              
    1913                      .dwendtag $C$DW$T$49
    1914              
    1915              
    1916              $C$DW$T$50      .dwtag  DW_TAG_union_type
    1917                      .dwattr $C$DW$T$50, DW_AT_name("PCLKCR1_REG")
    1918                      .dwattr $C$DW$T$50, DW_AT_byte_size(0x01)
    1919              $C$DW$157       .dwtag  DW_TAG_member
    1920                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$19)
    1921                      .dwattr $C$DW$157, DW_AT_name("all")
    1922                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_all")
    1923                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1924                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1925              
    1926              $C$DW$158       .dwtag  DW_TAG_member
    1927                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$49)
    1928                      .dwattr $C$DW$158, DW_AT_name("bit")
    1929                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_bit")
    1930                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1931                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1932              
    1933                      .dwendtag $C$DW$T$50
    1934              
    1935              
    1936              $C$DW$T$51      .dwtag  DW_TAG_structure_type
    1937                      .dwattr $C$DW$T$51, DW_AT_name("PCLKCR3_BITS")
    1938                      .dwattr $C$DW$T$51, DW_AT_byte_size(0x01)
    1939              $C$DW$159       .dwtag  DW_TAG_member
    1940                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$19)
    1941                      .dwattr $C$DW$159, DW_AT_name("rsvd1")
    1942                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_rsvd1")
    1943                      .dwattr $C$DW$159, DW_AT_bit_offset(0x08)
    1944                      .dwattr $C$DW$159, DW_AT_bit_size(0x08)
    1945                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1946                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1947              
    1948              $C$DW$160       .dwtag  DW_TAG_member
    1949                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$19)
    1950                      .dwattr $C$DW$160, DW_AT_name("CPUTIMER0ENCLK")
    1951                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_CPUTIMER0ENCLK")
    1952                      .dwattr $C$DW$160, DW_AT_bit_offset(0x07)
    1953                      .dwattr $C$DW$160, DW_AT_bit_size(0x01)
    1954                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1955                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1956              
TMS320C2000 Assembler PC v15.12.1 Sat Jun 25 21:32:08 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\RJKJ_ZGH\AppData\Local\Temp\0869210                         PAGE   38

    1957              $C$DW$161       .dwtag  DW_TAG_member
    1958                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$19)
    1959                      .dwattr $C$DW$161, DW_AT_name("CPUTIMER1ENCLK")
    1960                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_CPUTIMER1ENCLK")
    1961                      .dwattr $C$DW$161, DW_AT_bit_offset(0x06)
    1962                      .dwattr $C$DW$161, DW_AT_bit_size(0x01)
    1963                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1964                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1965              
    1966              $C$DW$162       .dwtag  DW_TAG_member
    1967                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$19)
    1968                      .dwattr $C$DW$162, DW_AT_name("CPUTIMER2ENCLK")
    1969                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_CPUTIMER2ENCLK")
    1970                      .dwattr $C$DW$162, DW_AT_bit_offset(0x05)
    1971                      .dwattr $C$DW$162, DW_AT_bit_size(0x01)
    1972                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1973                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    1974              
    1975              $C$DW$163       .dwtag  DW_TAG_member
    1976                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$19)
    1977                      .dwattr $C$DW$163, DW_AT_name("DMAENCLK")
    1978                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_DMAENCLK")
    1979                      .dwattr $C$DW$163, DW_AT_bit_offset(0x04)
    1980                      .dwattr $C$DW$163, DW_AT_bit_size(0x01)
    1981                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1982                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    1983              
    1984              $C$DW$164       .dwtag  DW_TAG_member
    1985                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$19)
    1986                      .dwattr $C$DW$164, DW_AT_name("XINTFENCLK")
    1987                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_XINTFENCLK")
    1988                      .dwattr $C$DW$164, DW_AT_bit_offset(0x03)
    1989                      .dwattr $C$DW$164, DW_AT_bit_size(0x01)
    1990                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1991                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    1992              
    1993              $C$DW$165       .dwtag  DW_TAG_member
    1994                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$19)
    1995                      .dwattr $C$DW$165, DW_AT_name("GPIOINENCLK")
    1996                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_GPIOINENCLK")
    1997                      .dwattr $C$DW$165, DW_AT_bit_offset(0x02)
    1998                      .dwattr $C$DW$165, DW_AT_bit_size(0x01)
    1999                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2000                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2001              
    2002              $C$DW$166       .dwtag  DW_TAG_member
    2003                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$19)
    2004                      .dwattr $C$DW$166, DW_AT_name("rsvd2")
    2005                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_rsvd2")
    2006                      .dwattr $C$DW$166, DW_AT_bit_offset(0x00)
    2007                      .dwattr $C$DW$166, DW_AT_bit_size(0x02)
    2008                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2009                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2010              
    2011                      .dwendtag $C$DW$T$51
TMS320C2000 Assembler PC v15.12.1 Sat Jun 25 21:32:08 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\RJKJ_ZGH\AppData\Local\Temp\0869210                         PAGE   39

    2012              
    2013              
    2014              $C$DW$T$52      .dwtag  DW_TAG_union_type
    2015                      .dwattr $C$DW$T$52, DW_AT_name("PCLKCR3_REG")
    2016                      .dwattr $C$DW$T$52, DW_AT_byte_size(0x01)
    2017              $C$DW$167       .dwtag  DW_TAG_member
    2018                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$19)
    2019                      .dwattr $C$DW$167, DW_AT_name("all")
    2020                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_all")
    2021                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2022                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2023              
    2024              $C$DW$168       .dwtag  DW_TAG_member
    2025                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$51)
    2026                      .dwattr $C$DW$168, DW_AT_name("bit")
    2027                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_bit")
    2028                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2029                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2030              
    2031                      .dwendtag $C$DW$T$52
    2032              
    2033              
    2034              $C$DW$T$53      .dwtag  DW_TAG_structure_type
    2035                      .dwattr $C$DW$T$53, DW_AT_name("PLLCR_BITS")
    2036                      .dwattr $C$DW$T$53, DW_AT_byte_size(0x01)
    2037              $C$DW$169       .dwtag  DW_TAG_member
    2038                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$19)
    2039                      .dwattr $C$DW$169, DW_AT_name("DIV")
    2040                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_DIV")
    2041                      .dwattr $C$DW$169, DW_AT_bit_offset(0x0c)
    2042                      .dwattr $C$DW$169, DW_AT_bit_size(0x04)
    2043                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2044                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2045              
    2046              $C$DW$170       .dwtag  DW_TAG_member
    2047                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$19)
    2048                      .dwattr $C$DW$170, DW_AT_name("rsvd1")
    2049                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_rsvd1")
    2050                      .dwattr $C$DW$170, DW_AT_bit_offset(0x00)
    2051                      .dwattr $C$DW$170, DW_AT_bit_size(0x0c)
    2052                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2053                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2054              
    2055                      .dwendtag $C$DW$T$53
    2056              
    2057              
    2058              $C$DW$T$54      .dwtag  DW_TAG_union_type
    2059                      .dwattr $C$DW$T$54, DW_AT_name("PLLCR_REG")
    2060                      .dwattr $C$DW$T$54, DW_AT_byte_size(0x01)
    2061              $C$DW$171       .dwtag  DW_TAG_member
    2062                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$19)
    2063                      .dwattr $C$DW$171, DW_AT_name("all")
    2064                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_all")
    2065                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2066                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.1 Sat Jun 25 21:32:08 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\RJKJ_ZGH\AppData\Local\Temp\0869210                         PAGE   40

    2067              
    2068              $C$DW$172       .dwtag  DW_TAG_member
    2069                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$53)
