TMS320C2000 Assembler PC v15.12.1 Sat Jun 25 21:32:07 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\RJKJ_ZGH\AppData\Local\Temp\0992410                         PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                   PC v15.12.1.LTS *
       3              ;* Date/Time created: Sat Jun 25 21:32:07 2016                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=fpu32 --hll_source=on --mem_model:code=flat --mem_model:
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/work/DSP/Steering_Engine/F2833x/v141/DSP2833x_headers/source/DSP2833
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v15.12.1.LTS Copyright (c) 1996-201
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\work\DSP\Steering_Engine\F2833x\v141\DSP2833x_examples_ccsv5\fpu
      13                      .global _PartIdRegs
      14 00000000       _PartIdRegs:    .usect  "PartIdRegsFile",1,1,0
      15              $C$DW$1 .dwtag  DW_TAG_variable

     391                      .global _EQep1Regs
     392 00000000       _EQep1Regs:     .usect  "EQep1RegsFile",64,1,1
     393              $C$DW$43        .dwtag  DW_TAG_variable
     394                      .dwattr $C$DW$43, DW_AT_name("EQep1Regs")
     395                      .dwattr $C$DW$43, DW_AT_TI_symbol_name("_EQep1Regs")
     396                      .dwattr $C$DW$43, DW_AT_location[DW_OP_addr _EQep1Regs]
     397                      .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$456)
     398                      .dwattr $C$DW$43, DW_AT_external
     399              
     400                      .global _EQep2Regs
     401 00000000       _EQep2Regs:     .usect  "EQep2RegsFile",64,1,1
     402              $C$DW$44        .dwtag  DW_TAG_variable
     403                      .dwattr $C$DW$44, DW_AT_name("EQep2Regs")
     404                      .dwattr $C$DW$44, DW_AT_TI_symbol_name("_EQep2Regs")
     405                      .dwattr $C$DW$44, DW_AT_location[DW_OP_addr _EQep2Regs]
     406                      .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$456)
     407                      .dwattr $C$DW$44, DW_AT_external
     408              
     409                      .global _ECanbLAMRegs
     410 00000000       _ECanbLAMRegs:  .usect  "ECanbLAMRegsFile",64,1,1
     411              $C$DW$45        .dwtag  DW_TAG_variable
     412                      .dwattr $C$DW$45, DW_AT_name("ECanbLAMRegs")
     413                      .dwattr $C$DW$45, DW_AT_TI_symbol_name("_ECanbLAMRegs")
     414                      .dwattr $C$DW$45, DW_AT_location[DW_OP_addr _ECanbLAMRegs]
     415                      .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$462)
     416                      .dwattr $C$DW$45, DW_AT_external
     417              
     418                      .global _DevEmuRegs
     419 00000000       _DevEmuRegs:    .usect  "DevEmuRegsFile",208,1,1
     420              $C$DW$46        .dwtag  DW_TAG_variable
     421                      .dwattr $C$DW$46, DW_AT_name("DevEmuRegs")
     422                      .dwattr $C$DW$46, DW_AT_TI_symbol_name("_DevEmuRegs")
     423                      .dwattr $C$DW$46, DW_AT_location[DW_OP_addr _DevEmuRegs]
     424                      .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$450)
     425                      .dwattr $C$DW$46, DW_AT_external
     426              
     427                      .global _DmaRegs
     428 00000000       _DmaRegs:       .usect  "DmaRegsFile",224,1,1
     429              $C$DW$47        .dwtag  DW_TAG_variable
     430                      .dwattr $C$DW$47, DW_AT_name("DmaRegs")
     431                      .dwattr $C$DW$47, DW_AT_TI_symbol_name("_DmaRegs")
     432                      .dwattr $C$DW$47, DW_AT_location[DW_OP_addr _DmaRegs]
     433                      .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$451)
     434                      .dwattr $C$DW$47, DW_AT_external
     435              
     436                      .global _ECanbMboxes
     437 00000000       _ECanbMboxes:   .usect  "ECanbMboxesFile",256,1,1
     438              $C$DW$48        .dwtag  DW_TAG_variable
     439                      .dwattr $C$DW$48, DW_AT_name("ECanbMboxes")
     440                      .dwattr $C$DW$48, DW_AT_TI_symbol_name("_ECanbMboxes")
TMS320C2000 Assembler PC v15.12.1 Sat Jun 25 21:32:07 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\RJKJ_ZGH\AppData\Local\Temp\0992410                         PAGE    9

     441                      .dwattr $C$DW$48, DW_AT_location[DW_OP_addr _ECanbMboxes]
     442                      .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$452)
     443                      .dwattr $C$DW$48, DW_AT_external
     444              
     445                      .global _ECanaMboxes
     446 00000000       _ECanaMboxes:   .usect  "ECanaMboxesFile",256,1,1
     447              $C$DW$49        .dwtag  DW_TAG_variable
     448                      .dwattr $C$DW$49, DW_AT_name("ECanaMboxes")
     449                      .dwattr $C$DW$49, DW_AT_TI_symbol_name("_ECanaMboxes")
     450                      .dwattr $C$DW$49, DW_AT_location[DW_OP_addr _ECanaMboxes]
     451                      .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$452)
     452                      .dwattr $C$DW$49, DW_AT_external
     453              
     454                      .global _PieVectTable
     455 00000000       _PieVectTable:  .usect  "PieVectTableFile",256,1,1
     456              $C$DW$50        .dwtag  DW_TAG_variable
     457                      .dwattr $C$DW$50, DW_AT_name("PieVectTable")
     458                      .dwattr $C$DW$50, DW_AT_TI_symbol_name("_PieVectTable")
     459                      .dwattr $C$DW$50, DW_AT_location[DW_OP_addr _PieVectTable]
     460                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$468)
     461                      .dwattr $C$DW$50, DW_AT_external
     462              
     463              ;       C:\ti\ccsv6\tools\compiler\ti-cgt-c2000_15.12.1.LTS\bin\ac2000.exe -@C:\\Users\\RJKJ_ZGH\\AppData\\Lo
     464              
     465              ;***************************************************************
     466              ;* TYPE INFORMATION                                            *
     467              ;***************************************************************
     468              
     469              $C$DW$T$20      .dwtag  DW_TAG_structure_type
     470                      .dwattr $C$DW$T$20, DW_AT_name("ADCASEQSR_BITS")
     471                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x01)
     472              $C$DW$51        .dwtag  DW_TAG_member
     473                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$19)
     474                      .dwattr $C$DW$51, DW_AT_name("SEQ1_STATE")
     475                      .dwattr $C$DW$51, DW_AT_TI_symbol_name("_SEQ1_STATE")
     476                      .dwattr $C$DW$51, DW_AT_bit_offset(0x0c)
     477                      .dwattr $C$DW$51, DW_AT_bit_size(0x04)
     478                      .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     479                      .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     480              
     481              $C$DW$52        .dwtag  DW_TAG_member
     482                      .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$19)
     483                      .dwattr $C$DW$52, DW_AT_name("SEQ2_STATE")
     484                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_SEQ2_STATE")
     485                      .dwattr $C$DW$52, DW_AT_bit_offset(0x09)
     486                      .dwattr $C$DW$52, DW_AT_bit_size(0x03)
     487                      .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     488                      .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     489              
     490              $C$DW$53        .dwtag  DW_TAG_member
     491                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$19)
     492                      .dwattr $C$DW$53, DW_AT_name("rsvd1")
     493                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_rsvd1")
     494                      .dwattr $C$DW$53, DW_AT_bit_offset(0x08)
     495                      .dwattr $C$DW$53, DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v15.12.1 Sat Jun 25 21:32:07 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\RJKJ_ZGH\AppData\Local\Temp\0992410                         PAGE   10

     496                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     497                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     498              
     499              $C$DW$54        .dwtag  DW_TAG_member
     500                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$19)
     501                      .dwattr $C$DW$54, DW_AT_name("SEQ_CNTR")
     502                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_SEQ_CNTR")
     503                      .dwattr $C$DW$54, DW_AT_bit_offset(0x04)
     504                      .dwattr $C$DW$54, DW_AT_bit_size(0x04)
     505                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     506                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     507              
     508              $C$DW$55        .dwtag  DW_TAG_member
     509                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$19)
     510                      .dwattr $C$DW$55, DW_AT_name("rsvd2")
     511                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_rsvd2")
     512                      .dwattr $C$DW$55, DW_AT_bit_offset(0x00)
     513                      .dwattr $C$DW$55, DW_AT_bit_size(0x04)
     514                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     515                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     516              
     517                      .dwendtag $C$DW$T$20
     518              
     519              
     520              $C$DW$T$21      .dwtag  DW_TAG_union_type
     521                      .dwattr $C$DW$T$21, DW_AT_name("ADCASEQSR_REG")
     522                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x01)
     523              $C$DW$56        .dwtag  DW_TAG_member
     524                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$19)
     525                      .dwattr $C$DW$56, DW_AT_name("all")
     526                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_all")
     527                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     528                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     529              
     530              $C$DW$57        .dwtag  DW_TAG_member
     531                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$20)
     532                      .dwattr $C$DW$57, DW_AT_name("bit")
     533                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_bit")
     534                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     535                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     536              
     537                      .dwendtag $C$DW$T$21
     538              
     539              
     540              $C$DW$T$22      .dwtag  DW_TAG_structure_type
     541                      .dwattr $C$DW$T$22, DW_AT_name("ADCCHSELSEQ1_BITS")
     542                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x01)
     543              $C$DW$58        .dwtag  DW_TAG_member
     544                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$19)
     545                      .dwattr $C$DW$58, DW_AT_name("CONV00")
     546                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_CONV00")
     547                      .dwattr $C$DW$58, DW_AT_bit_offset(0x0c)
     548                      .dwattr $C$DW$58, DW_AT_bit_size(0x04)
     549                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     550                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.1 Sat Jun 25 21:32:07 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\RJKJ_ZGH\AppData\Local\Temp\0992410                         PAGE   11

     551              
     552              $C$DW$59        .dwtag  DW_TAG_member
     553                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$19)
     554                      .dwattr $C$DW$59, DW_AT_name("CONV01")
     555                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_CONV01")
     556                      .dwattr $C$DW$59, DW_AT_bit_offset(0x08)
     557                      .dwattr $C$DW$59, DW_AT_bit_size(0x04)
     558                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     559                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     560              
     561              $C$DW$60        .dwtag  DW_TAG_member
     562                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$19)
     563                      .dwattr $C$DW$60, DW_AT_name("CONV02")
     564                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_CONV02")
     565                      .dwattr $C$DW$60, DW_AT_bit_offset(0x04)
     566                      .dwattr $C$DW$60, DW_AT_bit_size(0x04)
     567                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     568                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     569              
     570              $C$DW$61        .dwtag  DW_TAG_member
     571                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$19)
     572                      .dwattr $C$DW$61, DW_AT_name("CONV03")
     573                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_CONV03")
     574                      .dwattr $C$DW$61, DW_AT_bit_offset(0x00)
     575                      .dwattr $C$DW$61, DW_AT_bit_size(0x04)
     576                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     577                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     578              
     579                      .dwendtag $C$DW$T$22
     580              
     581              
     582              $C$DW$T$23      .dwtag  DW_TAG_union_type
     583                      .dwattr $C$DW$T$23, DW_AT_name("ADCCHSELSEQ1_REG")
     584                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x01)
     585              $C$DW$62        .dwtag  DW_TAG_member
     586                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$19)
     587                      .dwattr $C$DW$62, DW_AT_name("all")
     588                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_all")
     589                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     590                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     591              
     592              $C$DW$63        .dwtag  DW_TAG_member
     593                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$22)
     594                      .dwattr $C$DW$63, DW_AT_name("bit")
     595                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_bit")
     596                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     597                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     598              
     599                      .dwendtag $C$DW$T$23
     600              
     601              
     602              $C$DW$T$24      .dwtag  DW_TAG_structure_type
     603                      .dwattr $C$DW$T$24, DW_AT_name("ADCCHSELSEQ2_BITS")
     604                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x01)
     605              $C$DW$64        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.1 Sat Jun 25 21:32:07 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\RJKJ_ZGH\AppData\Local\Temp\0992410                         PAGE   12

     606                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$19)
     607                      .dwattr $C$DW$64, DW_AT_name("CONV04")
     608                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_CONV04")
     609                      .dwattr $C$DW$64, DW_AT_bit_offset(0x0c)
     610                      .dwattr $C$DW$64, DW_AT_bit_size(0x04)
     611                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     612                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     613              
     614              $C$DW$65        .dwtag  DW_TAG_member
     615                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$19)
     616                      .dwattr $C$DW$65, DW_AT_name("CONV05")
     617                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_CONV05")
     618                      .dwattr $C$DW$65, DW_AT_bit_offset(0x08)
     619                      .dwattr $C$DW$65, DW_AT_bit_size(0x04)
     620                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     621                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     622              
     623              $C$DW$66        .dwtag  DW_TAG_member
     624                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$19)
     625                      .dwattr $C$DW$66, DW_AT_name("CONV06")
     626                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_CONV06")
     627                      .dwattr $C$DW$66, DW_AT_bit_offset(0x04)
     628                      .dwattr $C$DW$66, DW_AT_bit_size(0x04)
     629                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     630                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     631              
     632              $C$DW$67        .dwtag  DW_TAG_member
     633                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$19)
     634                      .dwattr $C$DW$67, DW_AT_name("CONV07")
     635                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_CONV07")
     636                      .dwattr $C$DW$67, DW_AT_bit_offset(0x00)
     637                      .dwattr $C$DW$67, DW_AT_bit_size(0x04)
     638                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     639                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     640              
     641                      .dwendtag $C$DW$T$24
     642              
     643              
     644              $C$DW$T$25      .dwtag  DW_TAG_union_type
     645                      .dwattr $C$DW$T$25, DW_AT_name("ADCCHSELSEQ2_REG")
     646                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x01)
     647              $C$DW$68        .dwtag  DW_TAG_member
     648                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$19)
     649                      .dwattr $C$DW$68, DW_AT_name("all")
     650                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_all")
     651                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     652                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
     653              
     654              $C$DW$69        .dwtag  DW_TAG_member
     655                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$24)
     656                      .dwattr $C$DW$69, DW_AT_name("bit")
     657                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_bit")
     658                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     659                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
     660              
TMS320C2000 Assembler PC v15.12.1 Sat Jun 25 21:32:07 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\RJKJ_ZGH\AppData\Local\Temp\0992410                         PAGE   13

     661                      .dwendtag $C$DW$T$25
     662              
     663              
     664              $C$DW$T$26      .dwtag  DW_TAG_structure_type
     665                      .dwattr $C$DW$T$26, DW_AT_name("ADCCHSELSEQ3_BITS")
     666                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
     667              $C$DW$70        .dwtag  DW_TAG_member
     668                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$19)
     669                      .dwattr $C$DW$70, DW_AT_name("CONV08")
     670                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_CONV08")
     671                      .dwattr $C$DW$70, DW_AT_bit_offset(0x0c)
     672                      .dwattr $C$DW$70, DW_AT_bit_size(0x04)
     673                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     674                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
     675              
     676              $C$DW$71        .dwtag  DW_TAG_member
     677                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$19)
     678                      .dwattr $C$DW$71, DW_AT_name("CONV09")
     679                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_CONV09")
     680                      .dwattr $C$DW$71, DW_AT_bit_offset(0x08)
     681                      .dwattr $C$DW$71, DW_AT_bit_size(0x04)
     682                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     683                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
     684              
     685              $C$DW$72        .dwtag  DW_TAG_member
     686                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$19)
     687                      .dwattr $C$DW$72, DW_AT_name("CONV10")
     688                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_CONV10")
     689                      .dwattr $C$DW$72, DW_AT_bit_offset(0x04)
     690                      .dwattr $C$DW$72, DW_AT_bit_size(0x04)
     691                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     692                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
     693              
     694              $C$DW$73        .dwtag  DW_TAG_member
     695                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$19)
     696                      .dwattr $C$DW$73, DW_AT_name("CONV11")
     697                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_CONV11")
     698                      .dwattr $C$DW$73, DW_AT_bit_offset(0x00)
     699                      .dwattr $C$DW$73, DW_AT_bit_size(0x04)
     700                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     701                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
     702              
     703                      .dwendtag $C$DW$T$26
     704              
     705              
     706              $C$DW$T$27      .dwtag  DW_TAG_union_type
     707                      .dwattr $C$DW$T$27, DW_AT_name("ADCCHSELSEQ3_REG")
     708                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
     709              $C$DW$74        .dwtag  DW_TAG_member
     710                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$19)
     711                      .dwattr $C$DW$74, DW_AT_name("all")
     712                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_all")
     713                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     714                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
     715              
TMS320C2000 Assembler PC v15.12.1 Sat Jun 25 21:32:07 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\RJKJ_ZGH\AppData\Local\Temp\0992410                         PAGE   14

     716              $C$DW$75        .dwtag  DW_TAG_member
     717                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$26)
     718                      .dwattr $C$DW$75, DW_AT_name("bit")
     719                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_bit")
     720                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     721                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
     722              
     723                      .dwendtag $C$DW$T$27
     724              
     725              
     726              $C$DW$T$28      .dwtag  DW_TAG_structure_type
     727                      .dwattr $C$DW$T$28, DW_AT_name("ADCCHSELSEQ4_BITS")
     728                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x01)
     729              $C$DW$76        .dwtag  DW_TAG_member
     730                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$19)
     731                      .dwattr $C$DW$76, DW_AT_name("CONV12")
     732                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_CONV12")
     733                      .dwattr $C$DW$76, DW_AT_bit_offset(0x0c)
     734                      .dwattr $C$DW$76, DW_AT_bit_size(0x04)
     735                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     736                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
     737              
     738              $C$DW$77        .dwtag  DW_TAG_member
     739                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$19)
     740                      .dwattr $C$DW$77, DW_AT_name("CONV13")
     741                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_CONV13")
     742                      .dwattr $C$DW$77, DW_AT_bit_offset(0x08)
     743                      .dwattr $C$DW$77, DW_AT_bit_size(0x04)
     744                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     745                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
     746              
     747              $C$DW$78        .dwtag  DW_TAG_member
     748                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$19)
     749                      .dwattr $C$DW$78, DW_AT_name("CONV14")
     750                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_CONV14")
     751                      .dwattr $C$DW$78, DW_AT_bit_offset(0x04)
     752                      .dwattr $C$DW$78, DW_AT_bit_size(0x04)
     753                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     754                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
     755              
     756              $C$DW$79        .dwtag  DW_TAG_member
     757                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$19)
     758                      .dwattr $C$DW$79, DW_AT_name("CONV15")
     759                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_CONV15")
     760                      .dwattr $C$DW$79, DW_AT_bit_offset(0x00)
     761                      .dwattr $C$DW$79, DW_AT_bit_size(0x04)
     762                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     763                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
     764              
     765                      .dwendtag $C$DW$T$28
     766              
     767              
     768              $C$DW$T$29      .dwtag  DW_TAG_union_type
     769                      .dwattr $C$DW$T$29, DW_AT_name("ADCCHSELSEQ4_REG")
     770                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
TMS320C2000 Assembler PC v15.12.1 Sat Jun 25 21:32:07 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\RJKJ_ZGH\AppData\Local\Temp\0992410                         PAGE   15

     771              $C$DW$80        .dwtag  DW_TAG_member
     772                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$19)
     773                      .dwattr $C$DW$80, DW_AT_name("all")
     774                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_all")
     775                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     776                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
     777              
     778              $C$DW$81        .dwtag  DW_TAG_member
     779                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$28)
     780                      .dwattr $C$DW$81, DW_AT_name("bit")
     781                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_bit")
     782                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     783                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
     784              
     785                      .dwendtag $C$DW$T$29
     786              
     787              
     788              $C$DW$T$30      .dwtag  DW_TAG_structure_type
     789                      .dwattr $C$DW$T$30, DW_AT_name("ADCMAXCONV_BITS")
     790                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x01)
     791              $C$DW$82        .dwtag  DW_TAG_member
     792                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$19)
     793                      .dwattr $C$DW$82, DW_AT_name("MAX_CONV1")
     794                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_MAX_CONV1")
     795                      .dwattr $C$DW$82, DW_AT_bit_offset(0x0c)
     796                      .dwattr $C$DW$82, DW_AT_bit_size(0x04)
     797                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     798                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
     799              
     800              $C$DW$83        .dwtag  DW_TAG_member
     801                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$19)
     802                      .dwattr $C$DW$83, DW_AT_name("MAX_CONV2")
     803                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_MAX_CONV2")
     804                      .dwattr $C$DW$83, DW_AT_bit_offset(0x09)
     805                      .dwattr $C$DW$83, DW_AT_bit_size(0x03)
     806                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     807                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
     808              
     809              $C$DW$84        .dwtag  DW_TAG_member
     810                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$19)
     811                      .dwattr $C$DW$84, DW_AT_name("rsvd1")
     812                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_rsvd1")
     813                      .dwattr $C$DW$84, DW_AT_bit_offset(0x00)
     814                      .dwattr $C$DW$84, DW_AT_bit_size(0x09)
     815                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     816                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
     817              
     818                      .dwendtag $C$DW$T$30
     819              
     820              
     821              $C$DW$T$31      .dwtag  DW_TAG_union_type
     822                      .dwattr $C$DW$T$31, DW_AT_name("ADCMAXCONV_REG")
     823                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x01)
     824              $C$DW$85        .dwtag  DW_TAG_member
     825                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v15.12.1 Sat Jun 25 21:32:07 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\RJKJ_ZGH\AppData\Local\Temp\0992410                         PAGE   16

     826                      .dwattr $C$DW$85, DW_AT_name("all")
     827                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_all")
     828                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     829                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
     830              
     831              $C$DW$86        .dwtag  DW_TAG_member
     832                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$30)
     833                      .dwattr $C$DW$86, DW_AT_name("bit")
     834                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_bit")
     835                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     836                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
     837              
     838                      .dwendtag $C$DW$T$31
     839              
     840              
     841              $C$DW$T$33      .dwtag  DW_TAG_structure_type
     842                      .dwattr $C$DW$T$33, DW_AT_name("ADCOFFTRIM_BITS")
     843                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
     844              $C$DW$87        .dwtag  DW_TAG_member
     845                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$32)
     846                      .dwattr $C$DW$87, DW_AT_name("OFFSET_TRIM")
     847                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_OFFSET_TRIM")
     848                      .dwattr $C$DW$87, DW_AT_bit_offset(0x07)
     849                      .dwattr $C$DW$87, DW_AT_bit_size(0x09)
     850                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     851                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
     852              
     853              $C$DW$88        .dwtag  DW_TAG_member
     854                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$19)
     855                      .dwattr $C$DW$88, DW_AT_name("rsvd1")
     856                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_rsvd1")
     857                      .dwattr $C$DW$88, DW_AT_bit_offset(0x00)
     858                      .dwattr $C$DW$88, DW_AT_bit_size(0x07)
     859                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     860                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
     861              
     862                      .dwendtag $C$DW$T$33
     863              
     864              
     865              $C$DW$T$34      .dwtag  DW_TAG_union_type
     866                      .dwattr $C$DW$T$34, DW_AT_name("ADCOFFTRIM_REG")
     867                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
     868              $C$DW$89        .dwtag  DW_TAG_member
     869                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$19)
     870                      .dwattr $C$DW$89, DW_AT_name("all")
     871                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_all")
     872                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     873                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
     874              
     875              $C$DW$90        .dwtag  DW_TAG_member
     876                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$33)
     877                      .dwattr $C$DW$90, DW_AT_name("bit")
     878                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_bit")
     879                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     880                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.1 Sat Jun 25 21:32:07 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\RJKJ_ZGH\AppData\Local\Temp\0992410                         PAGE   17

     881              
     882                      .dwendtag $C$DW$T$34
     883              
     884              
     885              $C$DW$T$35      .dwtag  DW_TAG_structure_type
     886                      .dwattr $C$DW$T$35, DW_AT_name("ADCREFSEL_BITS")
     887                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x01)
     888              $C$DW$91        .dwtag  DW_TAG_member
     889                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$19)
     890                      .dwattr $C$DW$91, DW_AT_name("rsvd1")
     891                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_rsvd1")
     892                      .dwattr $C$DW$91, DW_AT_bit_offset(0x02)
     893                      .dwattr $C$DW$91, DW_AT_bit_size(0x0e)
     894                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     895                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
     896              
     897              $C$DW$92        .dwtag  DW_TAG_member
     898                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$19)
     899                      .dwattr $C$DW$92, DW_AT_name("REF_SEL")
     900                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_REF_SEL")
     901                      .dwattr $C$DW$92, DW_AT_bit_offset(0x00)
     902                      .dwattr $C$DW$92, DW_AT_bit_size(0x02)
     903                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     904                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
     905              
     906                      .dwendtag $C$DW$T$35
     907              
     908              
     909              $C$DW$T$36      .dwtag  DW_TAG_union_type
     910                      .dwattr $C$DW$T$36, DW_AT_name("ADCREFSEL_REG")
     911                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
     912              $C$DW$93        .dwtag  DW_TAG_member
     913                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$19)
     914                      .dwattr $C$DW$93, DW_AT_name("all")
     915                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_all")
     916                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     917                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
     918              
     919              $C$DW$94        .dwtag  DW_TAG_member
     920                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$35)
     921                      .dwattr $C$DW$94, DW_AT_name("bit")
     922                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_bit")
     923                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     924                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
     925              
     926                      .dwendtag $C$DW$T$36
     927              
     928              
     929              $C$DW$T$37      .dwtag  DW_TAG_structure_type
     930                      .dwattr $C$DW$T$37, DW_AT_name("ADCST_BITS")
     931                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
     932              $C$DW$95        .dwtag  DW_TAG_member
     933                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
     934                      .dwattr $C$DW$95, DW_AT_name("INT_SEQ1")
     935                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_INT_SEQ1")
TMS320C2000 Assembler PC v15.12.1 Sat Jun 25 21:32:07 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\RJKJ_ZGH\AppData\Local\Temp\0992410                         PAGE   18

     936                      .dwattr $C$DW$95, DW_AT_bit_offset(0x0f)
     937                      .dwattr $C$DW$95, DW_AT_bit_size(0x01)
     938                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     939                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
     940              
     941              $C$DW$96        .dwtag  DW_TAG_member
     942                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$19)
     943                      .dwattr $C$DW$96, DW_AT_name("INT_SEQ2")
     944                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_INT_SEQ2")
     945                      .dwattr $C$DW$96, DW_AT_bit_offset(0x0e)
     946                      .dwattr $C$DW$96, DW_AT_bit_size(0x01)
     947                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     948                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
     949              
     950              $C$DW$97        .dwtag  DW_TAG_member
     951                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$19)
     952                      .dwattr $C$DW$97, DW_AT_name("SEQ1_BSY")
     953                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_SEQ1_BSY")
     954                      .dwattr $C$DW$97, DW_AT_bit_offset(0x0d)
     955                      .dwattr $C$DW$97, DW_AT_bit_size(0x01)
     956                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     957                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
     958              
     959              $C$DW$98        .dwtag  DW_TAG_member
     960                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$19)
     961                      .dwattr $C$DW$98, DW_AT_name("SEQ2_BSY")
     962                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_SEQ2_BSY")
     963                      .dwattr $C$DW$98, DW_AT_bit_offset(0x0c)
     964                      .dwattr $C$DW$98, DW_AT_bit_size(0x01)
     965                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     966                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
     967              
     968              $C$DW$99        .dwtag  DW_TAG_member
     969                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$19)
     970                      .dwattr $C$DW$99, DW_AT_name("INT_SEQ1_CLR")
     971                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_INT_SEQ1_CLR")
     972                      .dwattr $C$DW$99, DW_AT_bit_offset(0x0b)
     973                      .dwattr $C$DW$99, DW_AT_bit_size(0x01)
     974                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     975                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
     976              
     977              $C$DW$100       .dwtag  DW_TAG_member
     978                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$19)
     979                      .dwattr $C$DW$100, DW_AT_name("INT_SEQ2_CLR")
     980                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_INT_SEQ2_CLR")
     981                      .dwattr $C$DW$100, DW_AT_bit_offset(0x0a)
     982                      .dwattr $C$DW$100, DW_AT_bit_size(0x01)
     983                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     984                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
     985              
     986              $C$DW$101       .dwtag  DW_TAG_member
     987                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$19)
     988                      .dwattr $C$DW$101, DW_AT_name("EOS_BUF1")
     989                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_EOS_BUF1")
     990                      .dwattr $C$DW$101, DW_AT_bit_offset(0x09)
TMS320C2000 Assembler PC v15.12.1 Sat Jun 25 21:32:07 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\RJKJ_ZGH\AppData\Local\Temp\0992410                         PAGE   19

     991                      .dwattr $C$DW$101, DW_AT_bit_size(0x01)
     992                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     993                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
     994              
     995              $C$DW$102       .dwtag  DW_TAG_member
     996                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$19)
     997                      .dwattr $C$DW$102, DW_AT_name("EOS_BUF2")
     998                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_EOS_BUF2")
     999                      .dwattr $C$DW$102, DW_AT_bit_offset(0x08)
    1000                      .dwattr $C$DW$102, DW_AT_bit_size(0x01)
    1001                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1002                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1003              
    1004              $C$DW$103       .dwtag  DW_TAG_member
    1005                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$19)
    1006                      .dwattr $C$DW$103, DW_AT_name("rsvd1")
    1007                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_rsvd1")
    1008                      .dwattr $C$DW$103, DW_AT_bit_offset(0x00)
    1009                      .dwattr $C$DW$103, DW_AT_bit_size(0x08)
    1010                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1011                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1012              
    1013                      .dwendtag $C$DW$T$37
    1014              
    1015              
    1016              $C$DW$T$38      .dwtag  DW_TAG_union_type
    1017                      .dwattr $C$DW$T$38, DW_AT_name("ADCST_REG")
    1018                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x01)
    1019              $C$DW$104       .dwtag  DW_TAG_member
    1020                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
    1021                      .dwattr $C$DW$104, DW_AT_name("all")
    1022                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_all")
    1023                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1024                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1025              
    1026              $C$DW$105       .dwtag  DW_TAG_member
    1027                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$37)
    1028                      .dwattr $C$DW$105, DW_AT_name("bit")
    1029                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_bit")
    1030                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1031                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1032              
    1033                      .dwendtag $C$DW$T$38
    1034              
    1035              
    1036              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    1037                      .dwattr $C$DW$T$39, DW_AT_name("ADCTRL1_BITS")
    1038                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x01)
    1039              $C$DW$106       .dwtag  DW_TAG_member
    1040                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$19)
    1041                      .dwattr $C$DW$106, DW_AT_name("rsvd1")
    1042                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_rsvd1")
    1043                      .dwattr $C$DW$106, DW_AT_bit_offset(0x0c)
    1044                      .dwattr $C$DW$106, DW_AT_bit_size(0x04)
    1045                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v15.12.1 Sat Jun 25 21:32:07 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\RJKJ_ZGH\AppData\Local\Temp\0992410                         PAGE   20

    1046                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1047              
    1048              $C$DW$107       .dwtag  DW_TAG_member
    1049                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$19)
    1050                      .dwattr $C$DW$107, DW_AT_name("SEQ_CASC")
    1051                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_SEQ_CASC")
    1052                      .dwattr $C$DW$107, DW_AT_bit_offset(0x0b)
    1053                      .dwattr $C$DW$107, DW_AT_bit_size(0x01)
    1054                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1055                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1056              
    1057              $C$DW$108       .dwtag  DW_TAG_member
    1058                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$19)
    1059                      .dwattr $C$DW$108, DW_AT_name("SEQ_OVRD")
    1060                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_SEQ_OVRD")
    1061                      .dwattr $C$DW$108, DW_AT_bit_offset(0x0a)
    1062                      .dwattr $C$DW$108, DW_AT_bit_size(0x01)
    1063                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1064                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1065              
    1066              $C$DW$109       .dwtag  DW_TAG_member
    1067                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
    1068                      .dwattr $C$DW$109, DW_AT_name("CONT_RUN")
    1069                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_CONT_RUN")
    1070                      .dwattr $C$DW$109, DW_AT_bit_offset(0x09)
    1071                      .dwattr $C$DW$109, DW_AT_bit_size(0x01)
    1072                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1073                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1074              
    1075              $C$DW$110       .dwtag  DW_TAG_member
    1076                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
    1077                      .dwattr $C$DW$110, DW_AT_name("CPS")
    1078                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_CPS")
    1079                      .dwattr $C$DW$110, DW_AT_bit_offset(0x08)
    1080                      .dwattr $C$DW$110, DW_AT_bit_size(0x01)
    1081                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1082                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1083              
    1084              $C$DW$111       .dwtag  DW_TAG_member
    1085                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    1086                      .dwattr $C$DW$111, DW_AT_name("ACQ_PS")
    1087                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_ACQ_PS")
    1088                      .dwattr $C$DW$111, DW_AT_bit_offset(0x04)
    1089                      .dwattr $C$DW$111, DW_AT_bit_size(0x04)
    1090                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1091                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1092              
    1093              $C$DW$112       .dwtag  DW_TAG_member
    1094                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
    1095                      .dwattr $C$DW$112, DW_AT_name("SUSMOD")
    1096                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_SUSMOD")
    1097                      .dwattr $C$DW$112, DW_AT_bit_offset(0x02)
    1098                      .dwattr $C$DW$112, DW_AT_bit_size(0x02)
    1099                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1100                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.1 Sat Jun 25 21:32:07 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\RJKJ_ZGH\AppData\Local\Temp\0992410                         PAGE   21

    1101              
    1102              $C$DW$113       .dwtag  DW_TAG_member
    1103                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
    1104                      .dwattr $C$DW$113, DW_AT_name("RESET")
    1105                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_RESET")
    1106                      .dwattr $C$DW$113, DW_AT_bit_offset(0x01)
    1107                      .dwattr $C$DW$113, DW_AT_bit_size(0x01)
    1108                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1109                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1110              
    1111              $C$DW$114       .dwtag  DW_TAG_member
    1112                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
    1113                      .dwattr $C$DW$114, DW_AT_name("rsvd2")
    1114                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_rsvd2")
    1115                      .dwattr $C$DW$114, DW_AT_bit_offset(0x00)
    1116                      .dwattr $C$DW$114, DW_AT_bit_size(0x01)
    1117                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1118                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1119              
    1120                      .dwendtag $C$DW$T$39
    1121              
    1122              
    1123              $C$DW$T$40      .dwtag  DW_TAG_union_type
    1124                      .dwattr $C$DW$T$40, DW_AT_name("ADCTRL1_REG")
    1125                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x01)
    1126              $C$DW$115       .dwtag  DW_TAG_member
    1127                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
    1128                      .dwattr $C$DW$115, DW_AT_name("all")
    1129                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_all")
    1130                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1131                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1132              
    1133              $C$DW$116       .dwtag  DW_TAG_member
    1134                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$39)
    1135                      .dwattr $C$DW$116, DW_AT_name("bit")
    1136                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_bit")
    1137                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1138                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1139              
    1140                      .dwendtag $C$DW$T$40
    1141              
    1142              
    1143              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    1144                      .dwattr $C$DW$T$41, DW_AT_name("ADCTRL2_BITS")
    1145                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x01)
    1146              $C$DW$117       .dwtag  DW_TAG_member
    1147                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    1148                      .dwattr $C$DW$117, DW_AT_name("EPWM_SOCB_SEQ2")
    1149                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_EPWM_SOCB_SEQ2")
    1150                      .dwattr $C$DW$117, DW_AT_bit_offset(0x0f)
    1151                      .dwattr $C$DW$117, DW_AT_bit_size(0x01)
    1152                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1153                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1154              
    1155              $C$DW$118       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.1 Sat Jun 25 21:32:07 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\RJKJ_ZGH\AppData\Local\Temp\0992410                         PAGE   22

    1156                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
    1157                      .dwattr $C$DW$118, DW_AT_name("rsvd1")
    1158                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_rsvd1")
    1159                      .dwattr $C$DW$118, DW_AT_bit_offset(0x0e)
    1160                      .dwattr $C$DW$118, DW_AT_bit_size(0x01)
    1161                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1162                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1163              
    1164              $C$DW$119       .dwtag  DW_TAG_member
    1165                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
    1166                      .dwattr $C$DW$119, DW_AT_name("INT_MOD_SEQ2")
    1167                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_INT_MOD_SEQ2")
    1168                      .dwattr $C$DW$119, DW_AT_bit_offset(0x0d)
    1169                      .dwattr $C$DW$119, DW_AT_bit_size(0x01)
    1170                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1171                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1172              
    1173              $C$DW$120       .dwtag  DW_TAG_member
    1174                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$19)
    1175                      .dwattr $C$DW$120, DW_AT_name("INT_ENA_SEQ2")
    1176                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_INT_ENA_SEQ2")
    1177                      .dwattr $C$DW$120, DW_AT_bit_offset(0x0c)
    1178                      .dwattr $C$DW$120, DW_AT_bit_size(0x01)
    1179                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1180                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1181              
    1182              $C$DW$121       .dwtag  DW_TAG_member
    1183                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$19)
    1184                      .dwattr $C$DW$121, DW_AT_name("rsvd2")
    1185                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_rsvd2")
    1186                      .dwattr $C$DW$121, DW_AT_bit_offset(0x0b)
    1187                      .dwattr $C$DW$121, DW_AT_bit_size(0x01)
    1188                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1189                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1190              
    1191              $C$DW$122       .dwtag  DW_TAG_member
    1192                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$19)
    1193                      .dwattr $C$DW$122, DW_AT_name("SOC_SEQ2")
    1194                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_SOC_SEQ2")
    1195                      .dwattr $C$DW$122, DW_AT_bit_offset(0x0a)
    1196                      .dwattr $C$DW$122, DW_AT_bit_size(0x01)
    1197                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1198                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1199              
    1200              $C$DW$123       .dwtag  DW_TAG_member
    1201                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$19)
    1202                      .dwattr $C$DW$123, DW_AT_name("RST_SEQ2")
    1203                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_RST_SEQ2")
    1204                      .dwattr $C$DW$123, DW_AT_bit_offset(0x09)
    1205                      .dwattr $C$DW$123, DW_AT_bit_size(0x01)
    1206                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1207                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1208              
    1209              $C$DW$124       .dwtag  DW_TAG_member
    1210                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v15.12.1 Sat Jun 25 21:32:07 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\RJKJ_ZGH\AppData\Local\Temp\0992410                         PAGE   23

    1211                      .dwattr $C$DW$124, DW_AT_name("EXT_SOC_SEQ1")
    1212                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_EXT_SOC_SEQ1")
    1213                      .dwattr $C$DW$124, DW_AT_bit_offset(0x08)
    1214                      .dwattr $C$DW$124, DW_AT_bit_size(0x01)
    1215                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1216                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1217              
    1218              $C$DW$125       .dwtag  DW_TAG_member
    1219                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$19)
    1220                      .dwattr $C$DW$125, DW_AT_name("EPWM_SOCA_SEQ1")
    1221                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_EPWM_SOCA_SEQ1")
    1222                      .dwattr $C$DW$125, DW_AT_bit_offset(0x07)
    1223                      .dwattr $C$DW$125, DW_AT_bit_size(0x01)
    1224                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1225                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1226              
    1227              $C$DW$126       .dwtag  DW_TAG_member
    1228                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
    1229                      .dwattr $C$DW$126, DW_AT_name("rsvd3")
    1230                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_rsvd3")
    1231                      .dwattr $C$DW$126, DW_AT_bit_offset(0x06)
    1232                      .dwattr $C$DW$126, DW_AT_bit_size(0x01)
    1233                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1234                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1235              
    1236              $C$DW$127       .dwtag  DW_TAG_member
    1237                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
    1238                      .dwattr $C$DW$127, DW_AT_name("INT_MOD_SEQ1")
    1239                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_INT_MOD_SEQ1")
    1240                      .dwattr $C$DW$127, DW_AT_bit_offset(0x05)
    1241                      .dwattr $C$DW$127, DW_AT_bit_size(0x01)
    1242                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1243                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1244              
    1245              $C$DW$128       .dwtag  DW_TAG_member
    1246                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    1247                      .dwattr $C$DW$128, DW_AT_name("INT_ENA_SEQ1")
    1248                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_INT_ENA_SEQ1")
    1249                      .dwattr $C$DW$128, DW_AT_bit_offset(0x04)
    1250                      .dwattr $C$DW$128, DW_AT_bit_size(0x01)
    1251                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1252                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1253              
    1254              $C$DW$129       .dwtag  DW_TAG_member
    1255                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$19)
    1256                      .dwattr $C$DW$129, DW_AT_name("rsvd4")
    1257                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_rsvd4")
    1258                      .dwattr $C$DW$129, DW_AT_bit_offset(0x03)
    1259                      .dwattr $C$DW$129, DW_AT_bit_size(0x01)
    1260                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1261                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1262              
    1263              $C$DW$130       .dwtag  DW_TAG_member
    1264                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$19)
    1265                      .dwattr $C$DW$130, DW_AT_name("SOC_SEQ1")
TMS320C2000 Assembler PC v15.12.1 Sat Jun 25 21:32:07 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\RJKJ_ZGH\AppData\Local\Temp\0992410                         PAGE   24

    1266                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_SOC_SEQ1")
    1267                      .dwattr $C$DW$130, DW_AT_bit_offset(0x02)
    1268                      .dwattr $C$DW$130, DW_AT_bit_size(0x01)
    1269                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1270                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1271              
    1272              $C$DW$131       .dwtag  DW_TAG_member
    1273                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
    1274                      .dwattr $C$DW$131, DW_AT_name("RST_SEQ1")
    1275                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_RST_SEQ1")
    1276                      .dwattr $C$DW$131, DW_AT_bit_offset(0x01)
    1277                      .dwattr $C$DW$131, DW_AT_bit_size(0x01)
    1278                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1279                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1280              
    1281              $C$DW$132       .dwtag  DW_TAG_member
    1282                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$19)
    1283                      .dwattr $C$DW$132, DW_AT_name("EPWM_SOCB_SEQ")
    1284                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_EPWM_SOCB_SEQ")
    1285                      .dwattr $C$DW$132, DW_AT_bit_offset(0x00)
    1286                      .dwattr $C$DW$132, DW_AT_bit_size(0x01)
    1287                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1288                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1289              
    1290                      .dwendtag $C$DW$T$41
    1291              
    1292              
    1293              $C$DW$T$42      .dwtag  DW_TAG_union_type
    1294                      .dwattr $C$DW$T$42, DW_AT_name("ADCTRL2_REG")
    1295                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x01)
    1296              $C$DW$133       .dwtag  DW_TAG_member
    1297                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$19)
    1298                      .dwattr $C$DW$133, DW_AT_name("all")
    1299                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_all")
    1300                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1301                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1302              
    1303              $C$DW$134       .dwtag  DW_TAG_member
    1304                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$41)
    1305                      .dwattr $C$DW$134, DW_AT_name("bit")
    1306                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_bit")
    1307                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1308                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1309              
    1310                      .dwendtag $C$DW$T$42
    1311              
    1312              
    1313              $C$DW$T$43      .dwtag  DW_TAG_structure_type
    1314                      .dwattr $C$DW$T$43, DW_AT_name("ADCTRL3_BITS")
    1315                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x01)
    1316              $C$DW$135       .dwtag  DW_TAG_member
    1317                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$19)
    1318                      .dwattr $C$DW$135, DW_AT_name("SMODE_SEL")
    1319                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_SMODE_SEL")
    1320                      .dwattr $C$DW$135, DW_AT_bit_offset(0x0f)
TMS320C2000 Assembler PC v15.12.1 Sat Jun 25 21:32:07 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\RJKJ_ZGH\AppData\Local\Temp\0992410                         PAGE   25

    1321                      .dwattr $C$DW$135, DW_AT_bit_size(0x01)
    1322                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1323                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1324              
    1325              $C$DW$136       .dwtag  DW_TAG_member
    1326                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$19)
    1327                      .dwattr $C$DW$136, DW_AT_name("ADCCLKPS")
    1328                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_ADCCLKPS")
    1329                      .dwattr $C$DW$136, DW_AT_bit_offset(0x0b)
    1330                      .dwattr $C$DW$136, DW_AT_bit_size(0x04)
    1331                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1332                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1333              
    1334              $C$DW$137       .dwtag  DW_TAG_member
    1335                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$19)
    1336                      .dwattr $C$DW$137, DW_AT_name("ADCPWDN")
    1337                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_ADCPWDN")
    1338                      .dwattr $C$DW$137, DW_AT_bit_offset(0x0a)
    1339                      .dwattr $C$DW$137, DW_AT_bit_size(0x01)
    1340                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1341                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1342              
    1343              $C$DW$138       .dwtag  DW_TAG_member
    1344                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$19)
    1345                      .dwattr $C$DW$138, DW_AT_name("ADCBGRFDN")
    1346                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_ADCBGRFDN")
    1347                      .dwattr $C$DW$138, DW_AT_bit_offset(0x08)
    1348                      .dwattr $C$DW$138, DW_AT_bit_size(0x02)
    1349                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1350                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1351              
    1352              $C$DW$139       .dwtag  DW_TAG_member
    1353                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$19)
    1354                      .dwattr $C$DW$139, DW_AT_name("rsvd1")
    1355                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_rsvd1")
    1356                      .dwattr $C$DW$139, DW_AT_bit_offset(0x00)
    1357                      .dwattr $C$DW$139, DW_AT_bit_size(0x08)
    1358                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1359                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1360              
    1361                      .dwendtag $C$DW$T$43
    1362              
    1363              
    1364              $C$DW$T$44      .dwtag  DW_TAG_union_type
    1365                      .dwattr $C$DW$T$44, DW_AT_name("ADCTRL3_REG")
    1366                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x01)
    1367              $C$DW$140       .dwtag  DW_TAG_member
    1368                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$19)
    1369                      .dwattr $C$DW$140, DW_AT_name("all")
    1370                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_all")
    1371                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1372                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1373              
    1374              $C$DW$141       .dwtag  DW_TAG_member
    1375                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$43)
TMS320C2000 Assembler PC v15.12.1 Sat Jun 25 21:32:07 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\RJKJ_ZGH\AppData\Local\Temp\0992410                         PAGE   26

    1376                      .dwattr $C$DW$141, DW_AT_name("bit")
    1377                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_bit")
    1378                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1379                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1380              
    1381                      .dwendtag $C$DW$T$44
    1382              
    1383              
    1384              $C$DW$T$45      .dwtag  DW_TAG_structure_type
    1385                      .dwattr $C$DW$T$45, DW_AT_name("ADC_REGS")
    1386                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x1e)
    1387              $C$DW$142       .dwtag  DW_TAG_member
    1388                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$40)
    1389                      .dwattr $C$DW$142, DW_AT_name("ADCTRL1")
    1390                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_ADCTRL1")
    1391                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1392                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1393              
    1394              $C$DW$143       .dwtag  DW_TAG_member
    1395                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$42)
    1396                      .dwattr $C$DW$143, DW_AT_name("ADCTRL2")
    1397                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_ADCTRL2")
    1398                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1399                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1400              
    1401              $C$DW$144       .dwtag  DW_TAG_member
    1402                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$31)
    1403                      .dwattr $C$DW$144, DW_AT_name("ADCMAXCONV")
    1404                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_ADCMAXCONV")
    1405                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1406                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1407              
    1408              $C$DW$145       .dwtag  DW_TAG_member
    1409                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$23)
    1410                      .dwattr $C$DW$145, DW_AT_name("ADCCHSELSEQ1")
    1411                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_ADCCHSELSEQ1")
    1412                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1413                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1414              
    1415              $C$DW$146       .dwtag  DW_TAG_member
    1416                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$25)
    1417                      .dwattr $C$DW$146, DW_AT_name("ADCCHSELSEQ2")
    1418                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_ADCCHSELSEQ2")
    1419                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1420                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1421              
    1422              $C$DW$147       .dwtag  DW_TAG_member
    1423                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$27)
    1424                      .dwattr $C$DW$147, DW_AT_name("ADCCHSELSEQ3")
    1425                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_ADCCHSELSEQ3")
    1426                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1427                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1428              
    1429              $C$DW$148       .dwtag  DW_TAG_member
    1430                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$29)
TMS320C2000 Assembler PC v15.12.1 Sat Jun 25 21:32:07 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\RJKJ_ZGH\AppData\Local\Temp\0992410                         PAGE   27

    1431                      .dwattr $C$DW$148, DW_AT_name("ADCCHSELSEQ4")
    1432                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_ADCCHSELSEQ4")
    1433                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1434                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1435              
    1436              $C$DW$149       .dwtag  DW_TAG_member
    1437                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$21)
    1438                      .dwattr $C$DW$149, DW_AT_name("ADCASEQSR")
    1439                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_ADCASEQSR")
    1440                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1441                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1442              
    1443              $C$DW$150       .dwtag  DW_TAG_member
    1444                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$19)
    1445                      .dwattr $C$DW$150, DW_AT_name("ADCRESULT0")
    1446                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_ADCRESULT0")
    1447                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1448                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1449              
    1450              $C$DW$151       .dwtag  DW_TAG_member
    1451                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$19)
    1452                      .dwattr $C$DW$151, DW_AT_name("ADCRESULT1")
    1453                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_ADCRESULT1")
    1454                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1455                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1456              
    1457              $C$DW$152       .dwtag  DW_TAG_member
    1458                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$19)
    1459                      .dwattr $C$DW$152, DW_AT_name("ADCRESULT2")
    1460                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_ADCRESULT2")
    1461                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1462                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1463              
    1464              $C$DW$153       .dwtag  DW_TAG_member
    1465                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$19)
    1466                      .dwattr $C$DW$153, DW_AT_name("ADCRESULT3")
    1467                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_ADCRESULT3")
    1468                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    1469                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1470              
    1471              $C$DW$154       .dwtag  DW_TAG_member
    1472                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$19)
    1473                      .dwattr $C$DW$154, DW_AT_name("ADCRESULT4")
    1474                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_ADCRESULT4")
    1475                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1476                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1477              
    1478              $C$DW$155       .dwtag  DW_TAG_member
    1479                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$19)
    1480                      .dwattr $C$DW$155, DW_AT_name("ADCRESULT5")
    1481                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_ADCRESULT5")
    1482                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    1483                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1484              
    1485              $C$DW$156       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.1 Sat Jun 25 21:32:07 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\RJKJ_ZGH\AppData\Local\Temp\0992410                         PAGE   28

    1486                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$19)
    1487                      .dwattr $C$DW$156, DW_AT_name("ADCRESULT6")
    1488                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_ADCRESULT6")
    1489                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1490                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1491              
    1492              $C$DW$157       .dwtag  DW_TAG_member
    1493                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$19)
    1494                      .dwattr $C$DW$157, DW_AT_name("ADCRESULT7")
    1495                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_ADCRESULT7")
    1496                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    1497                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1498              
    1499              $C$DW$158       .dwtag  DW_TAG_member
    1500                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$19)
    1501                      .dwattr $C$DW$158, DW_AT_name("ADCRESULT8")
    1502                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_ADCRESULT8")
    1503                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1504                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1505              
    1506              $C$DW$159       .dwtag  DW_TAG_member
    1507                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$19)
    1508                      .dwattr $C$DW$159, DW_AT_name("ADCRESULT9")
    1509                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_ADCRESULT9")
    1510                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    1511                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1512              
    1513              $C$DW$160       .dwtag  DW_TAG_member
    1514                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$19)
    1515                      .dwattr $C$DW$160, DW_AT_name("ADCRESULT10")
    1516                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_ADCRESULT10")
    1517                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1518                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1519              
    1520              $C$DW$161       .dwtag  DW_TAG_member
    1521                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$19)
    1522                      .dwattr $C$DW$161, DW_AT_name("ADCRESULT11")
    1523                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_ADCRESULT11")
    1524                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    1525                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1526              
    1527              $C$DW$162       .dwtag  DW_TAG_member
    1528                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$19)
    1529                      .dwattr $C$DW$162, DW_AT_name("ADCRESULT12")
    1530                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_ADCRESULT12")
    1531                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1532                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    1533              
    1534              $C$DW$163       .dwtag  DW_TAG_member
    1535                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$19)
    1536                      .dwattr $C$DW$163, DW_AT_name("ADCRESULT13")
    1537                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_ADCRESULT13")
    1538                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    1539                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    1540              
TMS320C2000 Assembler PC v15.12.1 Sat Jun 25 21:32:07 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\RJKJ_ZGH\AppData\Local\Temp\0992410                         PAGE   29

    1541              $C$DW$164       .dwtag  DW_TAG_member
    1542                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$19)
    1543                      .dwattr $C$DW$164, DW_AT_name("ADCRESULT14")
    1544                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_ADCRESULT14")
    1545                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1546                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    1547              
    1548              $C$DW$165       .dwtag  DW_TAG_member
    1549                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$19)
    1550                      .dwattr $C$DW$165, DW_AT_name("ADCRESULT15")
    1551                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_ADCRESULT15")
    1552                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    1553                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    1554              
    1555              $C$DW$166       .dwtag  DW_TAG_member
    1556                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$44)
    1557                      .dwattr $C$DW$166, DW_AT_name("ADCTRL3")
    1558                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_ADCTRL3")
    1559                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1560                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    1561              
    1562              $C$DW$167       .dwtag  DW_TAG_member
    1563                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$38)
    1564                      .dwattr $C$DW$167, DW_AT_name("ADCST")
    1565                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_ADCST")
    1566                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    1567                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    1568              
    1569              $C$DW$168       .dwtag  DW_TAG_member
    1570                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$19)
    1571                      .dwattr $C$DW$168, DW_AT_name("rsvd1")
    1572                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_rsvd1")
    1573                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    1574                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    1575              
    1576              $C$DW$169       .dwtag  DW_TAG_member
    1577                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$19)
    1578                      .dwattr $C$DW$169, DW_AT_name("rsvd2")
    1579                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_rsvd2")
    1580                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    1581                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    1582              
    1583              $C$DW$170       .dwtag  DW_TAG_member
    1584                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$36)
    1585                      .dwattr $C$DW$170, DW_AT_name("ADCREFSEL")
    1586                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_ADCREFSEL")
    1587                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1588                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    1589              
    1590              $C$DW$171       .dwtag  DW_TAG_member
    1591                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$34)
    1592                      .dwattr $C$DW$171, DW_AT_name("ADCOFFTRIM")
    1593                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    1594                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    1595                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.1 Sat Jun 25 21:32:07 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\RJKJ_ZGH\AppData\Local\Temp\0992410                         PAGE   30

    1596              
    1597                      .dwendtag $C$DW$T$45
    1598              
    1599              $C$DW$172       .dwtag  DW_TAG_TI_far_type
    1600                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$45)
    1601              
    1602              $C$DW$T$445     .dwtag  DW_TAG_volatile_type
    1603                      .dwattr $C$DW$T$445, DW_AT_type(*$C$DW$172)
    1604              
    1605              
    1606              $C$DW$T$46      .dwtag  DW_TAG_structure_type
    1607                      .dwattr $C$DW$T$46, DW_AT_name("ADC_RESULT_MIRROR_REGS")
    1608                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x10)
    1609              $C$DW$173       .dwtag  DW_TAG_member
    1610                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$19)
    1611                      .dwattr $C$DW$173, DW_AT_name("ADCRESULT0")
    1612                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_ADCRESULT0")
    1613                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1614                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    1615              
    1616              $C$DW$174       .dwtag  DW_TAG_member
    1617                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$19)
    1618                      .dwattr $C$DW$174, DW_AT_name("ADCRESULT1")
    1619                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_ADCRESULT1")
    1620                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1621                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    1622              
    1623              $C$DW$175       .dwtag  DW_TAG_member
    1624                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$19)
    1625                      .dwattr $C$DW$175, DW_AT_name("ADCRESULT2")
    1626                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_ADCRESULT2")
    1627                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1628                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    1629              
    1630              $C$DW$176       .dwtag  DW_TAG_member
    1631                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$19)
    1632                      .dwattr $C$DW$176, DW_AT_name("ADCRESULT3")
    1633                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_ADCRESULT3")
    1634                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1635                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    1636              
    1637              $C$DW$177       .dwtag  DW_TAG_member
    1638                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$19)
    1639                      .dwattr $C$DW$177, DW_AT_name("ADCRESULT4")
    1640                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_ADCRESULT4")
    1641                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1642                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    1643              
    1644              $C$DW$178       .dwtag  DW_TAG_member
    1645                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$19)
    1646                      .dwattr $C$DW$178, DW_AT_name("ADCRESULT5")
    1647                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_ADCRESULT5")
    1648                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1649                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    1650              
TMS320C2000 Assembler PC v15.12.1 Sat Jun 25 21:32:07 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\RJKJ_ZGH\AppData\Local\Temp\0992410                         PAGE   31

    1651              $C$DW$179       .dwtag  DW_TAG_member
    1652                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$19)
    1653                      .dwattr $C$DW$179, DW_AT_name("ADCRESULT6")
    1654                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_ADCRESULT6")
    1655                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1656                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    1657              
    1658              $C$DW$180       .dwtag  DW_TAG_member
    1659                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$19)
    1660                      .dwattr $C$DW$180, DW_AT_name("ADCRESULT7")
    1661                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_ADCRESULT7")
    1662                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1663                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    1664              
    1665              $C$DW$181       .dwtag  DW_TAG_member
    1666                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$19)
    1667                      .dwattr $C$DW$181, DW_AT_name("ADCRESULT8")
    1668                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_ADCRESULT8")
    1669                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1670                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    1671              
    1672              $C$DW$182       .dwtag  DW_TAG_member
    1673                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$19)
    1674                      .dwattr $C$DW$182, DW_AT_name("ADCRESULT9")
    1675                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_ADCRESULT9")
    1676                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1677                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    1678              
    1679              $C$DW$183       .dwtag  DW_TAG_member
    1680                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$19)
    1681                      .dwattr $C$DW$183, DW_AT_name("ADCRESULT10")
    1682                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_ADCRESULT10")
    1683                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1684                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    1685              
    1686              $C$DW$184       .dwtag  DW_TAG_member
    1687                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$19)
    1688                      .dwattr $C$DW$184, DW_AT_name("ADCRESULT11")
    1689                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_ADCRESULT11")
    1690                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    1691                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    1692              
    1693              $C$DW$185       .dwtag  DW_TAG_member
    1694                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$19)
    1695                      .dwattr $C$DW$185, DW_AT_name("ADCRESULT12")
    1696                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_ADCRESULT12")
    1697                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1698                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    1699              
    1700              $C$DW$186       .dwtag  DW_TAG_member
    1701                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$19)
    1702                      .dwattr $C$DW$186, DW_AT_name("ADCRESULT13")
    1703                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_ADCRESULT13")
    1704                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    1705                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.1 Sat Jun 25 21:32:07 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\RJKJ_ZGH\AppData\Local\Temp\0992410                         PAGE   32

    1706              
    1707              $C$DW$187       .dwtag  DW_TAG_member
    1708                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$19)
    1709                      .dwattr $C$DW$187, DW_AT_name("ADCRESULT14")
    1710                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_ADCRESULT14")
    1711                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1712                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    1713              
    1714              $C$DW$188       .dwtag  DW_TAG_member
    1715                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$19)
    1716                      .dwattr $C$DW$188, DW_AT_name("ADCRESULT15")
    1717                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_ADCRESULT15")
    1718                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    1719                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    1720              
    1721                      .dwendtag $C$DW$T$46
    1722              
    1723              $C$DW$189       .dwtag  DW_TAG_TI_far_type
    1724                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$46)
    1725              
    1726              $C$DW$T$446     .dwtag  DW_TAG_volatile_type
    1727                      .dwattr $C$DW$T$446, DW_AT_type(*$C$DW$189)
    1728              
    1729              
    1730              $C$DW$T$47      .dwtag  DW_TAG_structure_type
    1731                      .dwattr $C$DW$T$47, DW_AT_name("AQCSFRC_BITS")
    1732                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x01)
    1733              $C$DW$190       .dwtag  DW_TAG_member
    1734                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$19)
    1735                      .dwattr $C$DW$190, DW_AT_name("CSFA")
    1736                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_CSFA")
    1737                      .dwattr $C$DW$190, DW_AT_bit_offset(0x0e)
    1738                      .dwattr $C$DW$190, DW_AT_bit_size(0x02)
    1739                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1740                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    1741              
    1742              $C$DW$191       .dwtag  DW_TAG_member
    1743                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$19)
    1744                      .dwattr $C$DW$191, DW_AT_name("CSFB")
    1745                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_CSFB")
    1746                      .dwattr $C$DW$191, DW_AT_bit_offset(0x0c)
    1747                      .dwattr $C$DW$191, DW_AT_bit_size(0x02)
    1748                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1749                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    1750              
    1751              $C$DW$192       .dwtag  DW_TAG_member
    1752                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$19)
    1753                      .dwattr $C$DW$192, DW_AT_name("rsvd1")
    1754                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_rsvd1")
    1755                      .dwattr $C$DW$192, DW_AT_bit_offset(0x00)
    1756                      .dwattr $C$DW$192, DW_AT_bit_size(0x0c)
    1757                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1758                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    1759              
    1760                      .dwendtag $C$DW$T$47
TMS320C2000 Assembler PC v15.12.1 Sat Jun 25 21:32:07 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\RJKJ_ZGH\AppData\Local\Temp\0992410                         PAGE   33

    1761              
    1762              
    1763              $C$DW$T$48      .dwtag  DW_TAG_union_type
    1764                      .dwattr $C$DW$T$48, DW_AT_name("AQCSFRC_REG")
