TMS320C2000 Assembler PC v15.12.1 Sat Jun 25 21:32:08 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\RJKJ_ZGH\AppData\Local\Temp\0657610                         PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                   PC v15.12.1.LTS *
       3              ;* Date/Time created: Sat Jun 25 21:32:08 2016                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=fpu32 --hll_source=on --mem_model:code=flat --mem_model:
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/work/DSP/Steering_Engine/F2833x/v141/DSP2833x_common/source/DSP2833x
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v15.12.1.LTS Copyright (c) 1996-201
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\work\DSP\Steering_Engine\F2833x\v141\DSP2833x_examples_ccsv5\fpu
      13              $C$DW$1 .dwtag  DW_TAG_variable
      14                      .dwattr $C$DW$1, DW_AT_name("PieCtrlRegs")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_PieCtrlRegs")

     107                      .dwattr $C$DW$3, DW_AT_low_pc(0x00)
     108                      .dwattr $C$DW$3, DW_AT_TI_return
TMS320C2000 Assembler PC v15.12.1 Sat Jun 25 21:32:08 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\RJKJ_ZGH\AppData\Local\Temp\0657610                         PAGE    3

     109              
     110 0000001e 0006          LRETR     ; [CPU_] 
     111                      ; return occurs ; [] 
     112                      .dwattr $C$DW$2, DW_AT_TI_end_file("D:/work/DSP/Steering_Engine/F2833x/v141/DSP2833x_common/source/DS
     113                      .dwattr $C$DW$2, DW_AT_TI_end_line(0x3b)
     114                      .dwattr $C$DW$2, DW_AT_TI_end_column(0x01)
     115                      .dwendentry
     116                      .dwendtag $C$DW$2
     117              
     118 0000001f               .sect   ".text"
     119                      .clink
     120                      .global _EnableInterrupts
     121              
     122              $C$DW$4 .dwtag  DW_TAG_subprogram
     123                      .dwattr $C$DW$4, DW_AT_name("EnableInterrupts")
     124                      .dwattr $C$DW$4, DW_AT_low_pc(_EnableInterrupts)
     125                      .dwattr $C$DW$4, DW_AT_high_pc(0x00)
     126                      .dwattr $C$DW$4, DW_AT_TI_symbol_name("_EnableInterrupts")
     127                      .dwattr $C$DW$4, DW_AT_external
     128                      .dwattr $C$DW$4, DW_AT_TI_begin_file("D:/work/DSP/Steering_Engine/F2833x/v141/DSP2833x_common/source/
     129                      .dwattr $C$DW$4, DW_AT_TI_begin_line(0x42)
     130                      .dwattr $C$DW$4, DW_AT_TI_begin_column(0x06)
     131                      .dwattr $C$DW$4, DW_AT_TI_max_frame_size(-2)
     132                      .dwpsn  file "D:/work/DSP/Steering_Engine/F2833x/v141/DSP2833x_common/source/DSP2833x_PieCtrl.c",line
     133              
     134                      .dwfde $C$DW$CIE, _EnableInterrupts
     135              
     136              ;***************************************************************
     137              ;* FNAME: _EnableInterrupts             FR SIZE:   0           *
     138              ;*                                                             *
     139              ;* FUNCTION ENVIRONMENT                                        *
     140              ;*                                                             *
     141              ;* FUNCTION PROPERTIES                                         *
     142              ;*                            0 Parameter,  0 Auto,  0 SOE     *
     143              ;***************************************************************
     144              
     145 0000001f       _EnableInterrupts:
     146                      .dwcfi  cfa_offset, -2
     147                      .dwcfi  save_reg_to_mem, 26, 0
     148                      .dwpsn  file "D:/work/DSP/Steering_Engine/F2833x/v141/DSP2833x_common/source/DSP2833x_PieCtrl.c",line
     149 0000001f 761F!         MOVW      DP,#_PieCtrlRegs      ; [CPU_U] 
         00000020 0000 
     150 00000021 1A00!         OR        @_PieCtrlRegs,#0x0001 ; [CPU_] |70| 
         00000022 0001 
     151                      .dwpsn  file "D:/work/DSP/Steering_Engine/F2833x/v141/DSP2833x_common/source/DSP2833x_PieCtrl.c",line
     152 00000023 2801!         MOV       @_PieCtrlRegs+1,#65535 ; [CPU_] |73| 
         00000024 FFFF 
     153                      .dwpsn  file "D:/work/DSP/Steering_Engine/F2833x/v141/DSP2833x_common/source/DSP2833x_PieCtrl.c",line
     154 00000025 2910   clrc INTM
     155                      .dwpsn  file "D:/work/DSP/Steering_Engine/F2833x/v141/DSP2833x_common/source/DSP2833x_PieCtrl.c",line
     156 00000026 FF69          SPM       #0                    ; [CPU_] 
     157              $C$DW$5 .dwtag  DW_TAG_TI_branch
     158                      .dwattr $C$DW$5, DW_AT_low_pc(0x00)
     159                      .dwattr $C$DW$5, DW_AT_TI_return
     160              
TMS320C2000 Assembler PC v15.12.1 Sat Jun 25 21:32:08 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\RJKJ_ZGH\AppData\Local\Temp\0657610                         PAGE    4

     161 00000027 0006          LRETR     ; [CPU_] 
     162                      ; return occurs ; [] 
     163                      .dwattr $C$DW$4, DW_AT_TI_end_file("D:/work/DSP/Steering_Engine/F2833x/v141/DSP2833x_common/source/DS
     164                      .dwattr $C$DW$4, DW_AT_TI_end_line(0x4e)
     165                      .dwattr $C$DW$4, DW_AT_TI_end_column(0x01)
     166                      .dwendentry
     167                      .dwendtag $C$DW$4
     168              
     169              ;**************************************************************
     170              ;* UNDEFINED EXTERNAL REFERENCES                              *
     171              ;**************************************************************
     172                      .global _PieCtrlRegs
     173              
     174              ;***************************************************************
     175              ;* TYPE INFORMATION                                            *
     176              ;***************************************************************
     177              
     178              $C$DW$T$20      .dwtag  DW_TAG_structure_type
     179                      .dwattr $C$DW$T$20, DW_AT_name("PIEACK_BITS")
     180                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x01)
     181              $C$DW$6 .dwtag  DW_TAG_member
     182                      .dwattr $C$DW$6, DW_AT_type(*$C$DW$T$19)
     183                      .dwattr $C$DW$6, DW_AT_name("ACK1")
     184                      .dwattr $C$DW$6, DW_AT_TI_symbol_name("_ACK1")
     185                      .dwattr $C$DW$6, DW_AT_bit_offset(0x0f)
     186                      .dwattr $C$DW$6, DW_AT_bit_size(0x01)
     187                      .dwattr $C$DW$6, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     188                      .dwattr $C$DW$6, DW_AT_accessibility(DW_ACCESS_public)
     189              
     190              $C$DW$7 .dwtag  DW_TAG_member
     191                      .dwattr $C$DW$7, DW_AT_type(*$C$DW$T$19)
     192                      .dwattr $C$DW$7, DW_AT_name("ACK2")
     193                      .dwattr $C$DW$7, DW_AT_TI_symbol_name("_ACK2")
     194                      .dwattr $C$DW$7, DW_AT_bit_offset(0x0e)
     195                      .dwattr $C$DW$7, DW_AT_bit_size(0x01)
     196                      .dwattr $C$DW$7, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     197                      .dwattr $C$DW$7, DW_AT_accessibility(DW_ACCESS_public)
     198              
     199              $C$DW$8 .dwtag  DW_TAG_member
     200                      .dwattr $C$DW$8, DW_AT_type(*$C$DW$T$19)
     201                      .dwattr $C$DW$8, DW_AT_name("ACK3")
     202                      .dwattr $C$DW$8, DW_AT_TI_symbol_name("_ACK3")
     203                      .dwattr $C$DW$8, DW_AT_bit_offset(0x0d)
     204                      .dwattr $C$DW$8, DW_AT_bit_size(0x01)
     205                      .dwattr $C$DW$8, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     206                      .dwattr $C$DW$8, DW_AT_accessibility(DW_ACCESS_public)
     207              
     208              $C$DW$9 .dwtag  DW_TAG_member
     209                      .dwattr $C$DW$9, DW_AT_type(*$C$DW$T$19)
     210                      .dwattr $C$DW$9, DW_AT_name("ACK4")
     211                      .dwattr $C$DW$9, DW_AT_TI_symbol_name("_ACK4")
     212                      .dwattr $C$DW$9, DW_AT_bit_offset(0x0c)
     213                      .dwattr $C$DW$9, DW_AT_bit_size(0x01)
     214                      .dwattr $C$DW$9, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     215                      .dwattr $C$DW$9, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.1 Sat Jun 25 21:32:08 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\RJKJ_ZGH\AppData\Local\Temp\0657610                         PAGE    5

     216              
     217              $C$DW$10        .dwtag  DW_TAG_member
     218                      .dwattr $C$DW$10, DW_AT_type(*$C$DW$T$19)
     219                      .dwattr $C$DW$10, DW_AT_name("ACK5")
     220                      .dwattr $C$DW$10, DW_AT_TI_symbol_name("_ACK5")
     221                      .dwattr $C$DW$10, DW_AT_bit_offset(0x0b)
     222                      .dwattr $C$DW$10, DW_AT_bit_size(0x01)
     223                      .dwattr $C$DW$10, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     224                      .dwattr $C$DW$10, DW_AT_accessibility(DW_ACCESS_public)
     225              
     226              $C$DW$11        .dwtag  DW_TAG_member
     227                      .dwattr $C$DW$11, DW_AT_type(*$C$DW$T$19)
     228                      .dwattr $C$DW$11, DW_AT_name("ACK6")
     229                      .dwattr $C$DW$11, DW_AT_TI_symbol_name("_ACK6")
     230                      .dwattr $C$DW$11, DW_AT_bit_offset(0x0a)
     231                      .dwattr $C$DW$11, DW_AT_bit_size(0x01)
     232                      .dwattr $C$DW$11, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     233                      .dwattr $C$DW$11, DW_AT_accessibility(DW_ACCESS_public)
     234              
     235              $C$DW$12        .dwtag  DW_TAG_member
     236                      .dwattr $C$DW$12, DW_AT_type(*$C$DW$T$19)
     237                      .dwattr $C$DW$12, DW_AT_name("ACK7")
     238                      .dwattr $C$DW$12, DW_AT_TI_symbol_name("_ACK7")
     239                      .dwattr $C$DW$12, DW_AT_bit_offset(0x09)
     240                      .dwattr $C$DW$12, DW_AT_bit_size(0x01)
     241                      .dwattr $C$DW$12, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     242                      .dwattr $C$DW$12, DW_AT_accessibility(DW_ACCESS_public)
     243              
     244              $C$DW$13        .dwtag  DW_TAG_member
     245                      .dwattr $C$DW$13, DW_AT_type(*$C$DW$T$19)
     246                      .dwattr $C$DW$13, DW_AT_name("ACK8")
     247                      .dwattr $C$DW$13, DW_AT_TI_symbol_name("_ACK8")
     248                      .dwattr $C$DW$13, DW_AT_bit_offset(0x08)
     249                      .dwattr $C$DW$13, DW_AT_bit_size(0x01)
     250                      .dwattr $C$DW$13, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     251                      .dwattr $C$DW$13, DW_AT_accessibility(DW_ACCESS_public)
     252              
     253              $C$DW$14        .dwtag  DW_TAG_member
     254                      .dwattr $C$DW$14, DW_AT_type(*$C$DW$T$19)
     255                      .dwattr $C$DW$14, DW_AT_name("ACK9")
     256                      .dwattr $C$DW$14, DW_AT_TI_symbol_name("_ACK9")
     257                      .dwattr $C$DW$14, DW_AT_bit_offset(0x07)
     258                      .dwattr $C$DW$14, DW_AT_bit_size(0x01)
     259                      .dwattr $C$DW$14, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     260                      .dwattr $C$DW$14, DW_AT_accessibility(DW_ACCESS_public)
     261              
     262              $C$DW$15        .dwtag  DW_TAG_member
     263                      .dwattr $C$DW$15, DW_AT_type(*$C$DW$T$19)
     264                      .dwattr $C$DW$15, DW_AT_name("ACK10")
     265                      .dwattr $C$DW$15, DW_AT_TI_symbol_name("_ACK10")
     266                      .dwattr $C$DW$15, DW_AT_bit_offset(0x06)
     267                      .dwattr $C$DW$15, DW_AT_bit_size(0x01)
     268                      .dwattr $C$DW$15, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     269                      .dwattr $C$DW$15, DW_AT_accessibility(DW_ACCESS_public)
     270              
TMS320C2000 Assembler PC v15.12.1 Sat Jun 25 21:32:08 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\RJKJ_ZGH\AppData\Local\Temp\0657610                         PAGE    6

     271              $C$DW$16        .dwtag  DW_TAG_member
     272                      .dwattr $C$DW$16, DW_AT_type(*$C$DW$T$19)
     273                      .dwattr $C$DW$16, DW_AT_name("ACK11")
     274                      .dwattr $C$DW$16, DW_AT_TI_symbol_name("_ACK11")
     275                      .dwattr $C$DW$16, DW_AT_bit_offset(0x05)
     276                      .dwattr $C$DW$16, DW_AT_bit_size(0x01)
     277                      .dwattr $C$DW$16, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     278                      .dwattr $C$DW$16, DW_AT_accessibility(DW_ACCESS_public)
     279              
     280              $C$DW$17        .dwtag  DW_TAG_member
     281                      .dwattr $C$DW$17, DW_AT_type(*$C$DW$T$19)
     282                      .dwattr $C$DW$17, DW_AT_name("ACK12")
     283                      .dwattr $C$DW$17, DW_AT_TI_symbol_name("_ACK12")
     284                      .dwattr $C$DW$17, DW_AT_bit_offset(0x04)
     285                      .dwattr $C$DW$17, DW_AT_bit_size(0x01)
     286                      .dwattr $C$DW$17, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     287                      .dwattr $C$DW$17, DW_AT_accessibility(DW_ACCESS_public)
     288              
     289              $C$DW$18        .dwtag  DW_TAG_member
     290                      .dwattr $C$DW$18, DW_AT_type(*$C$DW$T$19)
     291                      .dwattr $C$DW$18, DW_AT_name("rsvd")
     292                      .dwattr $C$DW$18, DW_AT_TI_symbol_name("_rsvd")
     293                      .dwattr $C$DW$18, DW_AT_bit_offset(0x00)
     294                      .dwattr $C$DW$18, DW_AT_bit_size(0x04)
     295                      .dwattr $C$DW$18, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     296                      .dwattr $C$DW$18, DW_AT_accessibility(DW_ACCESS_public)
     297              
     298                      .dwendtag $C$DW$T$20
     299              
     300              
     301              $C$DW$T$21      .dwtag  DW_TAG_union_type
     302                      .dwattr $C$DW$T$21, DW_AT_name("PIEACK_REG")
     303                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x01)
     304              $C$DW$19        .dwtag  DW_TAG_member
     305                      .dwattr $C$DW$19, DW_AT_type(*$C$DW$T$19)
     306                      .dwattr $C$DW$19, DW_AT_name("all")
     307                      .dwattr $C$DW$19, DW_AT_TI_symbol_name("_all")
     308                      .dwattr $C$DW$19, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     309                      .dwattr $C$DW$19, DW_AT_accessibility(DW_ACCESS_public)
     310              
     311              $C$DW$20        .dwtag  DW_TAG_member
     312                      .dwattr $C$DW$20, DW_AT_type(*$C$DW$T$20)
     313                      .dwattr $C$DW$20, DW_AT_name("bit")
     314                      .dwattr $C$DW$20, DW_AT_TI_symbol_name("_bit")
     315                      .dwattr $C$DW$20, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     316                      .dwattr $C$DW$20, DW_AT_accessibility(DW_ACCESS_public)
     317              
     318                      .dwendtag $C$DW$T$21
     319              
     320              
     321              $C$DW$T$22      .dwtag  DW_TAG_structure_type
     322                      .dwattr $C$DW$T$22, DW_AT_name("PIECTRL_BITS")
     323                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x01)
     324              $C$DW$21        .dwtag  DW_TAG_member
     325                      .dwattr $C$DW$21, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v15.12.1 Sat Jun 25 21:32:08 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\RJKJ_ZGH\AppData\Local\Temp\0657610                         PAGE    7

     326                      .dwattr $C$DW$21, DW_AT_name("ENPIE")
     327                      .dwattr $C$DW$21, DW_AT_TI_symbol_name("_ENPIE")
     328                      .dwattr $C$DW$21, DW_AT_bit_offset(0x0f)
     329                      .dwattr $C$DW$21, DW_AT_bit_size(0x01)
     330                      .dwattr $C$DW$21, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     331                      .dwattr $C$DW$21, DW_AT_accessibility(DW_ACCESS_public)
     332              
     333              $C$DW$22        .dwtag  DW_TAG_member
     334                      .dwattr $C$DW$22, DW_AT_type(*$C$DW$T$19)
     335                      .dwattr $C$DW$22, DW_AT_name("PIEVECT")
     336                      .dwattr $C$DW$22, DW_AT_TI_symbol_name("_PIEVECT")
     337                      .dwattr $C$DW$22, DW_AT_bit_offset(0x00)
     338                      .dwattr $C$DW$22, DW_AT_bit_size(0x0f)
     339                      .dwattr $C$DW$22, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     340                      .dwattr $C$DW$22, DW_AT_accessibility(DW_ACCESS_public)
     341              
     342                      .dwendtag $C$DW$T$22
     343              
     344              
     345              $C$DW$T$23      .dwtag  DW_TAG_union_type
     346                      .dwattr $C$DW$T$23, DW_AT_name("PIECTRL_REG")
     347                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x01)
     348              $C$DW$23        .dwtag  DW_TAG_member
     349                      .dwattr $C$DW$23, DW_AT_type(*$C$DW$T$19)
     350                      .dwattr $C$DW$23, DW_AT_name("all")
     351                      .dwattr $C$DW$23, DW_AT_TI_symbol_name("_all")
     352                      .dwattr $C$DW$23, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     353                      .dwattr $C$DW$23, DW_AT_accessibility(DW_ACCESS_public)
     354              
     355              $C$DW$24        .dwtag  DW_TAG_member
     356                      .dwattr $C$DW$24, DW_AT_type(*$C$DW$T$22)
     357                      .dwattr $C$DW$24, DW_AT_name("bit")
     358                      .dwattr $C$DW$24, DW_AT_TI_symbol_name("_bit")
     359                      .dwattr $C$DW$24, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     360                      .dwattr $C$DW$24, DW_AT_accessibility(DW_ACCESS_public)
     361              
     362                      .dwendtag $C$DW$T$23
     363              
     364              
     365              $C$DW$T$24      .dwtag  DW_TAG_structure_type
     366                      .dwattr $C$DW$T$24, DW_AT_name("PIEIER_BITS")
     367                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x01)
     368              $C$DW$25        .dwtag  DW_TAG_member
     369                      .dwattr $C$DW$25, DW_AT_type(*$C$DW$T$19)
     370                      .dwattr $C$DW$25, DW_AT_name("INTx1")
     371                      .dwattr $C$DW$25, DW_AT_TI_symbol_name("_INTx1")
     372                      .dwattr $C$DW$25, DW_AT_bit_offset(0x0f)
     373                      .dwattr $C$DW$25, DW_AT_bit_size(0x01)
     374                      .dwattr $C$DW$25, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     375                      .dwattr $C$DW$25, DW_AT_accessibility(DW_ACCESS_public)
     376              
     377              $C$DW$26        .dwtag  DW_TAG_member
     378                      .dwattr $C$DW$26, DW_AT_type(*$C$DW$T$19)
     379                      .dwattr $C$DW$26, DW_AT_name("INTx2")
     380                      .dwattr $C$DW$26, DW_AT_TI_symbol_name("_INTx2")
TMS320C2000 Assembler PC v15.12.1 Sat Jun 25 21:32:08 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\RJKJ_ZGH\AppData\Local\Temp\0657610                         PAGE    8

     381                      .dwattr $C$DW$26, DW_AT_bit_offset(0x0e)
     382                      .dwattr $C$DW$26, DW_AT_bit_size(0x01)
     383                      .dwattr $C$DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     384                      .dwattr $C$DW$26, DW_AT_accessibility(DW_ACCESS_public)
     385              
     386              $C$DW$27        .dwtag  DW_TAG_member
     387                      .dwattr $C$DW$27, DW_AT_type(*$C$DW$T$19)
     388                      .dwattr $C$DW$27, DW_AT_name("INTx3")
     389                      .dwattr $C$DW$27, DW_AT_TI_symbol_name("_INTx3")
     390                      .dwattr $C$DW$27, DW_AT_bit_offset(0x0d)
     391                      .dwattr $C$DW$27, DW_AT_bit_size(0x01)
     392                      .dwattr $C$DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     393                      .dwattr $C$DW$27, DW_AT_accessibility(DW_ACCESS_public)
     394              
     395              $C$DW$28        .dwtag  DW_TAG_member
     396                      .dwattr $C$DW$28, DW_AT_type(*$C$DW$T$19)
     397                      .dwattr $C$DW$28, DW_AT_name("INTx4")
     398                      .dwattr $C$DW$28, DW_AT_TI_symbol_name("_INTx4")
     399                      .dwattr $C$DW$28, DW_AT_bit_offset(0x0c)
     400                      .dwattr $C$DW$28, DW_AT_bit_size(0x01)
     401                      .dwattr $C$DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     402                      .dwattr $C$DW$28, DW_AT_accessibility(DW_ACCESS_public)
     403              
     404              $C$DW$29        .dwtag  DW_TAG_member
     405                      .dwattr $C$DW$29, DW_AT_type(*$C$DW$T$19)
     406                      .dwattr $C$DW$29, DW_AT_name("INTx5")
     407                      .dwattr $C$DW$29, DW_AT_TI_symbol_name("_INTx5")
     408                      .dwattr $C$DW$29, DW_AT_bit_offset(0x0b)
     409                      .dwattr $C$DW$29, DW_AT_bit_size(0x01)
     410                      .dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     411                      .dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
     412              
     413              $C$DW$30        .dwtag  DW_TAG_member
     414                      .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$19)
     415                      .dwattr $C$DW$30, DW_AT_name("INTx6")
     416                      .dwattr $C$DW$30, DW_AT_TI_symbol_name("_INTx6")
     417                      .dwattr $C$DW$30, DW_AT_bit_offset(0x0a)
     418                      .dwattr $C$DW$30, DW_AT_bit_size(0x01)
     419                      .dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     420                      .dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
     421              
     422              $C$DW$31        .dwtag  DW_TAG_member
     423                      .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$19)
     424                      .dwattr $C$DW$31, DW_AT_name("INTx7")
     425                      .dwattr $C$DW$31, DW_AT_TI_symbol_name("_INTx7")
     426                      .dwattr $C$DW$31, DW_AT_bit_offset(0x09)
     427                      .dwattr $C$DW$31, DW_AT_bit_size(0x01)
     428                      .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     429                      .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
     430              
     431              $C$DW$32        .dwtag  DW_TAG_member
     432                      .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$19)
     433                      .dwattr $C$DW$32, DW_AT_name("INTx8")
     434                      .dwattr $C$DW$32, DW_AT_TI_symbol_name("_INTx8")
     435                      .dwattr $C$DW$32, DW_AT_bit_offset(0x08)
TMS320C2000 Assembler PC v15.12.1 Sat Jun 25 21:32:08 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\RJKJ_ZGH\AppData\Local\Temp\0657610                         PAGE    9

     436                      .dwattr $C$DW$32, DW_AT_bit_size(0x01)
     437                      .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     438                      .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
     439              
     440              $C$DW$33        .dwtag  DW_TAG_member
     441                      .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$19)
     442                      .dwattr $C$DW$33, DW_AT_name("rsvd")
     443                      .dwattr $C$DW$33, DW_AT_TI_symbol_name("_rsvd")
     444                      .dwattr $C$DW$33, DW_AT_bit_offset(0x00)
     445                      .dwattr $C$DW$33, DW_AT_bit_size(0x08)
     446                      .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     447                      .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
     448              
     449                      .dwendtag $C$DW$T$24
     450              
     451              
     452              $C$DW$T$25      .dwtag  DW_TAG_union_type
     453                      .dwattr $C$DW$T$25, DW_AT_name("PIEIER_REG")
     454                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x01)
     455              $C$DW$34        .dwtag  DW_TAG_member
     456                      .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$19)
     457                      .dwattr $C$DW$34, DW_AT_name("all")
     458                      .dwattr $C$DW$34, DW_AT_TI_symbol_name("_all")
     459                      .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     460                      .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
     461              
     462              $C$DW$35        .dwtag  DW_TAG_member
     463                      .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$24)
     464                      .dwattr $C$DW$35, DW_AT_name("bit")
     465                      .dwattr $C$DW$35, DW_AT_TI_symbol_name("_bit")
     466                      .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     467                      .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     468              
     469                      .dwendtag $C$DW$T$25
     470              
     471              
     472              $C$DW$T$26      .dwtag  DW_TAG_structure_type
     473                      .dwattr $C$DW$T$26, DW_AT_name("PIEIFR_BITS")
     474                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
     475              $C$DW$36        .dwtag  DW_TAG_member
     476                      .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$19)
     477                      .dwattr $C$DW$36, DW_AT_name("INTx1")
     478                      .dwattr $C$DW$36, DW_AT_TI_symbol_name("_INTx1")
     479                      .dwattr $C$DW$36, DW_AT_bit_offset(0x0f)
     480                      .dwattr $C$DW$36, DW_AT_bit_size(0x01)
     481                      .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     482                      .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
     483              
     484              $C$DW$37        .dwtag  DW_TAG_member
     485                      .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$19)
     486                      .dwattr $C$DW$37, DW_AT_name("INTx2")
     487                      .dwattr $C$DW$37, DW_AT_TI_symbol_name("_INTx2")
     488                      .dwattr $C$DW$37, DW_AT_bit_offset(0x0e)
     489                      .dwattr $C$DW$37, DW_AT_bit_size(0x01)
     490                      .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v15.12.1 Sat Jun 25 21:32:08 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\RJKJ_ZGH\AppData\Local\Temp\0657610                         PAGE   10

     491                      .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
     492              
     493              $C$DW$38        .dwtag  DW_TAG_member
     494                      .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$19)
     495                      .dwattr $C$DW$38, DW_AT_name("INTx3")
     496                      .dwattr $C$DW$38, DW_AT_TI_symbol_name("_INTx3")
     497                      .dwattr $C$DW$38, DW_AT_bit_offset(0x0d)
     498                      .dwattr $C$DW$38, DW_AT_bit_size(0x01)
     499                      .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     500                      .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     501              
     502              $C$DW$39        .dwtag  DW_TAG_member
     503                      .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$19)
     504                      .dwattr $C$DW$39, DW_AT_name("INTx4")
     505                      .dwattr $C$DW$39, DW_AT_TI_symbol_name("_INTx4")
     506                      .dwattr $C$DW$39, DW_AT_bit_offset(0x0c)
     507                      .dwattr $C$DW$39, DW_AT_bit_size(0x01)
     508                      .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     509                      .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     510              
     511              $C$DW$40        .dwtag  DW_TAG_member
     512                      .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$19)
     513                      .dwattr $C$DW$40, DW_AT_name("INTx5")
     514                      .dwattr $C$DW$40, DW_AT_TI_symbol_name("_INTx5")
     515                      .dwattr $C$DW$40, DW_AT_bit_offset(0x0b)
     516                      .dwattr $C$DW$40, DW_AT_bit_size(0x01)
     517                      .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     518                      .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     519              
     520              $C$DW$41        .dwtag  DW_TAG_member
     521                      .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$19)
     522                      .dwattr $C$DW$41, DW_AT_name("INTx6")
     523                      .dwattr $C$DW$41, DW_AT_TI_symbol_name("_INTx6")
     524                      .dwattr $C$DW$41, DW_AT_bit_offset(0x0a)
     525                      .dwattr $C$DW$41, DW_AT_bit_size(0x01)
     526                      .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     527                      .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     528              
     529              $C$DW$42        .dwtag  DW_TAG_member
     530                      .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$19)
     531                      .dwattr $C$DW$42, DW_AT_name("INTx7")
     532                      .dwattr $C$DW$42, DW_AT_TI_symbol_name("_INTx7")
     533                      .dwattr $C$DW$42, DW_AT_bit_offset(0x09)
     534                      .dwattr $C$DW$42, DW_AT_bit_size(0x01)
     535                      .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     536                      .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     537              
     538              $C$DW$43        .dwtag  DW_TAG_member
     539                      .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$19)
     540                      .dwattr $C$DW$43, DW_AT_name("INTx8")
     541                      .dwattr $C$DW$43, DW_AT_TI_symbol_name("_INTx8")
     542                      .dwattr $C$DW$43, DW_AT_bit_offset(0x08)
     543                      .dwattr $C$DW$43, DW_AT_bit_size(0x01)
     544                      .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     545                      .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.1 Sat Jun 25 21:32:08 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\RJKJ_ZGH\AppData\Local\Temp\0657610                         PAGE   11

     546              
     547              $C$DW$44        .dwtag  DW_TAG_member
     548                      .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$19)
     549                      .dwattr $C$DW$44, DW_AT_name("rsvd")
     550                      .dwattr $C$DW$44, DW_AT_TI_symbol_name("_rsvd")
     551                      .dwattr $C$DW$44, DW_AT_bit_offset(0x00)
     552                      .dwattr $C$DW$44, DW_AT_bit_size(0x08)
     553                      .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     554                      .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     555              
     556                      .dwendtag $C$DW$T$26
     557              
     558              
     559              $C$DW$T$27      .dwtag  DW_TAG_union_type
     560                      .dwattr $C$DW$T$27, DW_AT_name("PIEIFR_REG")
     561                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
     562              $C$DW$45        .dwtag  DW_TAG_member
     563                      .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$19)
     564                      .dwattr $C$DW$45, DW_AT_name("all")
     565                      .dwattr $C$DW$45, DW_AT_TI_symbol_name("_all")
     566                      .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     567                      .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     568              
     569              $C$DW$46        .dwtag  DW_TAG_member
     570                      .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$26)
     571                      .dwattr $C$DW$46, DW_AT_name("bit")
     572                      .dwattr $C$DW$46, DW_AT_TI_symbol_name("_bit")
     573                      .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     574                      .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     575              
     576                      .dwendtag $C$DW$T$27
     577              
     578              
     579              $C$DW$T$28      .dwtag  DW_TAG_structure_type
     580                      .dwattr $C$DW$T$28, DW_AT_name("PIE_CTRL_REGS")
     581                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x1a)
     582              $C$DW$47        .dwtag  DW_TAG_member
     583                      .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$23)
     584                      .dwattr $C$DW$47, DW_AT_name("PIECTRL")
     585                      .dwattr $C$DW$47, DW_AT_TI_symbol_name("_PIECTRL")
     586                      .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     587                      .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     588              
     589              $C$DW$48        .dwtag  DW_TAG_member
     590                      .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$21)
     591                      .dwattr $C$DW$48, DW_AT_name("PIEACK")
     592                      .dwattr $C$DW$48, DW_AT_TI_symbol_name("_PIEACK")
     593                      .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     594                      .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     595              
     596              $C$DW$49        .dwtag  DW_TAG_member
     597                      .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$25)
     598                      .dwattr $C$DW$49, DW_AT_name("PIEIER1")
     599                      .dwattr $C$DW$49, DW_AT_TI_symbol_name("_PIEIER1")
     600                      .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
TMS320C2000 Assembler PC v15.12.1 Sat Jun 25 21:32:08 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\RJKJ_ZGH\AppData\Local\Temp\0657610                         PAGE   12

     601                      .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     602              
     603              $C$DW$50        .dwtag  DW_TAG_member
     604                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$27)
     605                      .dwattr $C$DW$50, DW_AT_name("PIEIFR1")
     606                      .dwattr $C$DW$50, DW_AT_TI_symbol_name("_PIEIFR1")
     607                      .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
     608                      .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     609              
     610              $C$DW$51        .dwtag  DW_TAG_member
     611                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$25)
     612                      .dwattr $C$DW$51, DW_AT_name("PIEIER2")
     613                      .dwattr $C$DW$51, DW_AT_TI_symbol_name("_PIEIER2")
     614                      .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     615                      .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     616              
     617              $C$DW$52        .dwtag  DW_TAG_member
     618                      .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$27)
     619                      .dwattr $C$DW$52, DW_AT_name("PIEIFR2")
     620                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_PIEIFR2")
     621                      .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
     622                      .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     623              
     624              $C$DW$53        .dwtag  DW_TAG_member
     625                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$25)
     626                      .dwattr $C$DW$53, DW_AT_name("PIEIER3")
     627                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_PIEIER3")
     628                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     629                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     630              
     631              $C$DW$54        .dwtag  DW_TAG_member
     632                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$27)
     633                      .dwattr $C$DW$54, DW_AT_name("PIEIFR3")
     634                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_PIEIFR3")
     635                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
     636                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     637              
     638              $C$DW$55        .dwtag  DW_TAG_member
     639                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$25)
     640                      .dwattr $C$DW$55, DW_AT_name("PIEIER4")
     641                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_PIEIER4")
     642                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     643                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     644              
     645              $C$DW$56        .dwtag  DW_TAG_member
     646                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$27)
     647                      .dwattr $C$DW$56, DW_AT_name("PIEIFR4")
     648                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_PIEIFR4")
     649                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
     650                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     651              
     652              $C$DW$57        .dwtag  DW_TAG_member
     653                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$25)
     654                      .dwattr $C$DW$57, DW_AT_name("PIEIER5")
     655                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_PIEIER5")
TMS320C2000 Assembler PC v15.12.1 Sat Jun 25 21:32:08 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\RJKJ_ZGH\AppData\Local\Temp\0657610                         PAGE   13

     656                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     657                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     658              
     659              $C$DW$58        .dwtag  DW_TAG_member
     660                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$27)
     661                      .dwattr $C$DW$58, DW_AT_name("PIEIFR5")
     662                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_PIEIFR5")
     663                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
     664                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     665              
     666              $C$DW$59        .dwtag  DW_TAG_member
     667                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$25)
     668                      .dwattr $C$DW$59, DW_AT_name("PIEIER6")
     669                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_PIEIER6")
     670                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     671                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     672              
     673              $C$DW$60        .dwtag  DW_TAG_member
     674                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$27)
     675                      .dwattr $C$DW$60, DW_AT_name("PIEIFR6")
     676                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_PIEIFR6")
     677                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
     678                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     679              
     680              $C$DW$61        .dwtag  DW_TAG_member
     681                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$25)
     682                      .dwattr $C$DW$61, DW_AT_name("PIEIER7")
     683                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_PIEIER7")
     684                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
     685                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     686              
     687              $C$DW$62        .dwtag  DW_TAG_member
     688                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$27)
     689                      .dwattr $C$DW$62, DW_AT_name("PIEIFR7")
     690                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_PIEIFR7")
     691                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
     692                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     693              
     694              $C$DW$63        .dwtag  DW_TAG_member
     695                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$25)
     696                      .dwattr $C$DW$63, DW_AT_name("PIEIER8")
     697                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_PIEIER8")
     698                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     699                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     700              
     701              $C$DW$64        .dwtag  DW_TAG_member
     702                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$27)
     703                      .dwattr $C$DW$64, DW_AT_name("PIEIFR8")
     704                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_PIEIFR8")
     705                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
     706                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     707              
     708              $C$DW$65        .dwtag  DW_TAG_member
     709                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$25)
     710                      .dwattr $C$DW$65, DW_AT_name("PIEIER9")
TMS320C2000 Assembler PC v15.12.1 Sat Jun 25 21:32:08 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\RJKJ_ZGH\AppData\Local\Temp\0657610                         PAGE   14

     711                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_PIEIER9")
     712                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
     713                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     714              
     715              $C$DW$66        .dwtag  DW_TAG_member
     716                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$27)
     717                      .dwattr $C$DW$66, DW_AT_name("PIEIFR9")
     718                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_PIEIFR9")
     719                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
     720                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     721              
     722              $C$DW$67        .dwtag  DW_TAG_member
     723                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$25)
     724                      .dwattr $C$DW$67, DW_AT_name("PIEIER10")
     725                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_PIEIER10")
     726                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     727                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     728              
     729              $C$DW$68        .dwtag  DW_TAG_member
     730                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$27)
     731                      .dwattr $C$DW$68, DW_AT_name("PIEIFR10")
     732                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_PIEIFR10")
     733                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
     734                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
     735              
     736              $C$DW$69        .dwtag  DW_TAG_member
     737                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$25)
     738                      .dwattr $C$DW$69, DW_AT_name("PIEIER11")
     739                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_PIEIER11")
     740                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
     741                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
     742              
     743              $C$DW$70        .dwtag  DW_TAG_member
     744                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$27)
     745                      .dwattr $C$DW$70, DW_AT_name("PIEIFR11")
     746                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_PIEIFR11")
     747                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
     748                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
     749              
     750              $C$DW$71        .dwtag  DW_TAG_member
     751                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$25)
     752                      .dwattr $C$DW$71, DW_AT_name("PIEIER12")
     753                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_PIEIER12")
     754                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
     755                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
     756              
     757              $C$DW$72        .dwtag  DW_TAG_member
     758                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$27)
     759                      .dwattr $C$DW$72, DW_AT_name("PIEIFR12")
     760                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_PIEIFR12")
     761                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
     762                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
     763              
     764                      .dwendtag $C$DW$T$28
     765              
TMS320C2000 Assembler PC v15.12.1 Sat Jun 25 21:32:08 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\RJKJ_ZGH\AppData\Local\Temp\0657610                         PAGE   15

     766              $C$DW$73        .dwtag  DW_TAG_TI_far_type
     767                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$28)
     768              
     769              $C$DW$T$34      .dwtag  DW_TAG_volatile_type
     770                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$73)
     771              
     772              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
     773                      .dwattr $C$DW$T$2, DW_AT_name("void")
     774              
     775              $C$DW$T$4       .dwtag  DW_TAG_base_type
     776                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
     777                      .dwattr $C$DW$T$4, DW_AT_name("bool")
     778                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
     779              
     780              $C$DW$T$5       .dwtag  DW_TAG_base_type
     781                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
     782                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
     783                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
     784              
     785              $C$DW$T$6       .dwtag  DW_TAG_base_type
     786                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
     787                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
     788                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
     789              
     790              $C$DW$T$7       .dwtag  DW_TAG_base_type
     791                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
     792                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
     793                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
     794              
     795              $C$DW$T$8       .dwtag  DW_TAG_base_type
     796                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
     797                      .dwattr $C$DW$T$8, DW_AT_name("short")
     798                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
     799              
     800              $C$DW$T$9       .dwtag  DW_TAG_base_type
     801                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
     802                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
     803                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
     804              
     805              $C$DW$T$10      .dwtag  DW_TAG_base_type
     806                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
     807                      .dwattr $C$DW$T$10, DW_AT_name("int")
     808                      .dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
     809              
     810              $C$DW$T$11      .dwtag  DW_TAG_base_type
     811                      .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
     812                      .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
     813                      .dwattr $C$DW$T$11, DW_AT_byte_size(0x01)
     814              
     815              $C$DW$T$19      .dwtag  DW_TAG_typedef
     816                      .dwattr $C$DW$T$19, DW_AT_name("Uint16")
     817                      .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$11)
     818                      .dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
     819              
     820              $C$DW$T$12      .dwtag  DW_TAG_base_type
TMS320C2000 Assembler PC v15.12.1 Sat Jun 25 21:32:08 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\RJKJ_ZGH\AppData\Local\Temp\0657610                         PAGE   16

