;***************************************************************
;* TMS320C2000 C/C++ Codegen                   PC v15.12.1.LTS *
;* Date/Time created: Mon Aug 29 15:38:15 2016                 *
;***************************************************************
	.compiler_opts --abi=coffabi --float_support=fpu32 --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --quiet --silicon_version=28 --symdebug:dwarf --symdebug:dwarf_version=3 
FP	.set	XAR2

$C$DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr $C$DW$CU, DW_AT_name("D:/work/DSP/ProgramBomb/ProgramBombDebug/math/IQmath/v160/examples_ccsv4/C/source/IQsample.c")
	.dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v15.12.1.LTS Copyright (c) 1996-2015 Texas Instruments Incorporated")
	.dwattr $C$DW$CU, DW_AT_TI_version(0x01)
	.dwattr $C$DW$CU, DW_AT_comp_dir("D:\work\DSP\ProgramBomb\ProgramBombDebug\math\IQmath\v160\examples_ccsv4\C\2833x\Debug")
;**************************************************************
;* CINIT RECORDS                                              *
;**************************************************************
	.sect	".cinit"
	.align	1
	.field  	-2,16
	.field  	_GlobalQ+0,32
	.bits	24,32			; _GlobalQ @ 0


$C$DW$1	.dwtag  DW_TAG_subprogram
	.dwattr $C$DW$1, DW_AT_name("puts")
	.dwattr $C$DW$1, DW_AT_TI_symbol_name("_puts")
	.dwattr $C$DW$1, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1, DW_AT_declaration
	.dwattr $C$DW$1, DW_AT_external

	.dwpsn	file "D:/work/DSP/ProgramBomb/ProgramBombDebug/math/IQmath/v160/examples_ccsv4/C/source/IQsample.c",line 140,column 9,is_stmt,isa 0
        MOV       ACC,*-SP[3] << 1      ; [CPU_] |140| 
        MOVL      XAR4,#_Dlog+512       ; [CPU_U] |140| 
        ADDL      XAR4,ACC              ; [CPU_] |140| 
        MOVL      ACC,*+XAR4[0]         ; [CPU_] |140| 
$C$DW$70	.dwtag  DW_TAG_TI_branch
	.dwattr $C$DW$70, DW_AT_low_pc(0x00)
	.dwattr $C$DW$70, DW_AT_name("__IQ24log")
	.dwattr $C$DW$70, DW_AT_TI_call

        LCR       #__IQ24log            ; [CPU_] |140| 
        ; call occurs [#__IQ24log] ; [] |140| 
        CLRC      SXM                   ; [CPU_] 
        MOVL      XAR6,ACC              ; [CPU_] |140| 
        MOVL      XAR4,#_Dlog+640       ; [CPU_U] |140| 
        MOV       ACC,*-SP[3] << 1      ; [CPU_] |140| 
        ADDL      XAR4,ACC              ; [CPU_] |140| 
        MOVL      *+XAR4[0],XAR6        ; [CPU_] |140| 
	.dwpsn	file "D:/work/DSP/ProgramBomb/ProgramBombDebug/math/IQmath/v160/examples_ccsv4/C/source/IQsample.c",line 143,column 9,is_stmt,isa 0
        MOVW      DP,#_Step             ; [CPU_U] 
        MOVL      XT,@_Step             ; [CPU_] |143| 
        IMPYL     P,XT,@_Step+14        ; [CPU_] |143| 
        QMPYL     ACC,XT,@_Step+14      ; [CPU_] |143| 
        LSL64     ACC:P,#8              ; [CPU_] |143| 
        ADDL      @_Step+6,ACC          ; [CPU_] |143| 
	.dwpsn	file "D:/work/DSP/ProgramBomb/ProgramBombDebug/math/IQmath/v160/examples_ccsv4/C/source/IQsample.c",line 144,column 9,is_stmt,isa 0
        MOV       AL,#32472             ; [CPU_] |144| 
        MOV       AH,#1608              ; [CPU_] |144| 
        CMPL      ACC,@_Step+6          ; [CPU_] |144| 
        B         $C$L8,GEQ             ; [CPU_] |144| 
        ; branchcc occurs ; [] |144| 
	.dwpsn	file "D:/work/DSP/ProgramBomb/ProgramBombDebug/math/IQmath/v160/examples_ccsv4/C/source/IQsample.c",line 145,column 13,is_stmt,isa 0
        SUBL      @_Step+6,ACC          ; [CPU_] |145| 
$C$L8:    
	.dwpsn	file "D:/work/DSP/ProgramBomb/ProgramBombDebug/math/IQmath/v160/examples_ccsv4/C/source/IQsample.c",line 147,column 9,is_stmt,isa 0
        MOVL      XT,@_Step+2           ; [CPU_] |147| 
        IMPYL     P,XT,@_Step+16        ; [CPU_] |147| 
        QMPYL     ACC,XT,@_Step+16      ; [CPU_] |147| 
        LSL64     ACC:P,#8              ; [CPU_] |147| 
        ADDL      @_Step+8,ACC          ; [CPU_] |147| 
	.dwpsn	file "D:/work/DSP/ProgramBomb/ProgramBombDebug/math/IQmath/v160/examples_ccsv4/C/source/IQsample.c",line 148,column 9,is_stmt,isa 0
        MOV       AL,#32472             ; [CPU_] |148| 
        MOV       AH,#1608              ; [CPU_] |148| 
        CMPL      ACC,@_Step+8          ; [CPU_] |148| 
        B         $C$L9,GEQ             ; [CPU_] |148| 
        ; branchcc occurs ; [] |148| 
	.dwpsn	file "D:/work/DSP/ProgramBomb/ProgramBombDebug/math/IQmath/v160/examples_ccsv4/C/source/IQsample.c",line 149,column 13,is_stmt,isa 0
        SUBL      @_Step+8,ACC          ; [CPU_] |149| 
$C$L9:    
	.dwpsn	file "D:/work/DSP/ProgramBomb/ProgramBombDebug/math/IQmath/v160/examples_ccsv4/C/source/IQsample.c",line 118,column 33,is_stmt,isa 0
        INC       *-SP[3]               ; [CPU_] |118| 
	.dwpsn	file "D:/work/DSP/ProgramBomb/ProgramBombDebug/math/IQmath/v160/examples_ccsv4/C/source/IQsample.c",line 118,column 14,is_stmt,isa 0
        MOV       AL,*-SP[3]            ; [CPU_] |118| 
        CMPB      AL,#64                ; [CPU_] |118| 
        B         $C$L7,LO              ; [CPU_] |118| 
        ; branchcc occurs ; [] |118| 
$C$L10:    
	.dwpsn	file "D:/work/DSP/ProgramBomb/ProgramBombDebug/math/IQmath/v160/examples_ccsv4/C/source/IQsample.c",line 152,column 1,is_stmt,isa 0
        MOVB      AL,#0                 ; [CPU_] |152| 
        SUBB      SP,#44                ; [CPU_U] 
	.dwcfi	cfa_offset, -2
$C$DW$71	.dwtag  DW_TAG_TI_branch
	.dwattr $C$DW$71, DW_AT_low_pc(0x00)
	.dwattr $C$DW$71, DW_AT_TI_return

        LRETR     ; [CPU_] 
        ; return occurs ; [] 
	.dwattr $C$DW$37, DW_AT_TI_end_file("D:/work/DSP/ProgramBomb/ProgramBombDebug/math/IQmath/v160/examples_ccsv4/C/source/IQsample.c")
	.dwattr $C$DW$37, DW_AT_TI_end_line(0x98)
	.dwattr $C$DW$37, DW_AT_TI_end_column(0x01)
	.dwendentry
	.dwendtag $C$DW$37

;***************************************************************
;* FLOATING-POINT CONSTANTS                                    *
;***************************************************************
	.sect	".econst"
	.align	2
$C$FL1:	.xldouble	$strtod("0x1p+24")
;***************************************************************
;* FAR STRINGS                                                 *
;***************************************************************
	.sect	".econst:.string"
	.align	2
$C$FSL1:	.string	10,"Enter waveform X gain (default = 1.0)= ",0
	.align	2
$C$FSL2:	.string	10,"Enter waveform X freq (default = 1.0)= ",0
	.align	2
$C$FSL3:	.string	10,"Enter waveform Y gain (default = 1.0)= ",0
	.align	2
$C$FSL4:	.string	10,"Enter waveform Y freq (default = 1.0)= ",0
;**************************************************************
;* UNDEFINED EXTERNAL REFERENCES                              *
;**************************************************************
	.global	_puts
	.global	__IQ24mag
	.global	__IQ24exp
	.global	__IQ24mpyI32int
	.global	__IQ24log
	.global	__atoIQN
	.global	_gets
	.global	__IQ24div
	.global	__IQ24acos
	.global	__IQ24atan2PU
	.global	__IQ24sin
	.global	FD$$MPY
	.global	U$$TOFD
	.global	FD$$TOL

;***************************************************************
;* TYPE INFORMATION                                            *
;***************************************************************

$C$DW$T$22	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$22, DW_AT_name("DATA_LOG_C")
	.dwattr $C$DW$T$22, DW_AT_byte_size(0x300)
$C$DW$72	.dwtag  DW_TAG_member
	.dwattr $C$DW$72, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$72, DW_AT_name("Xwaveform")
	.dwattr $C$DW$72, DW_AT_TI_symbol_name("_Xwaveform")
	.dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$73	.dwtag  DW_TAG_member
	.dwattr $C$DW$73, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$73, DW_AT_name("Ywaveform")
	.dwattr $C$DW$73, DW_AT_TI_symbol_name("_Ywaveform")
	.dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
	.dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$74	.dwtag  DW_TAG_member
	.dwattr $C$DW$74, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$74, DW_AT_name("Phase")
	.dwattr $C$DW$74, DW_AT_TI_symbol_name("_Phase")
	.dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
	.dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$75	.dwtag  DW_TAG_member
	.dwattr $C$DW$75, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$75, DW_AT_name("Mag")
	.dwattr $C$DW$75, DW_AT_TI_symbol_name("_Mag")
	.dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x180]
	.dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$76	.dwtag  DW_TAG_member
	.dwattr $C$DW$76, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$76, DW_AT_name("Exp")
	.dwattr $C$DW$76, DW_AT_TI_symbol_name("_Exp")
	.dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x200]
	.dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$77	.dwtag  DW_TAG_member
	.dwattr $C$DW$77, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$77, DW_AT_name("Log")
	.dwattr $C$DW$77, DW_AT_TI_symbol_name("_Log")
	.dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x280]
	.dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$22


$C$DW$T$23	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$23, DW_AT_name("STEP")
	.dwattr $C$DW$T$23, DW_AT_byte_size(0x12)
$C$DW$78	.dwtag  DW_TAG_member
	.dwattr $C$DW$78, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$78, DW_AT_name("Xsize")
	.dwattr $C$DW$78, DW_AT_TI_symbol_name("_Xsize")
	.dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$79	.dwtag  DW_TAG_member
	.dwattr $C$DW$79, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$79, DW_AT_name("Ysize")
	.dwattr $C$DW$79, DW_AT_TI_symbol_name("_Ysize")
	.dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$80	.dwtag  DW_TAG_member
	.dwattr $C$DW$80, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$80, DW_AT_name("Yoffset")
	.dwattr $C$DW$80, DW_AT_TI_symbol_name("_Yoffset")
	.dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$81	.dwtag  DW_TAG_member
	.dwattr $C$DW$81, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$81, DW_AT_name("X")
	.dwattr $C$DW$81, DW_AT_TI_symbol_name("_X")
	.dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$82	.dwtag  DW_TAG_member
	.dwattr $C$DW$82, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$82, DW_AT_name("Y")
	.dwattr $C$DW$82, DW_AT_TI_symbol_name("_Y")
	.dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$83	.dwtag  DW_TAG_member
	.dwattr $C$DW$83, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$83, DW_AT_name("GainX")
	.dwattr $C$DW$83, DW_AT_TI_symbol_name("_GainX")
	.dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$84	.dwtag  DW_TAG_member
	.dwattr $C$DW$84, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$84, DW_AT_name("GainY")
	.dwattr $C$DW$84, DW_AT_TI_symbol_name("_GainY")
	.dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$85	.dwtag  DW_TAG_member
	.dwattr $C$DW$85, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$85, DW_AT_name("FreqX")
	.dwattr $C$DW$85, DW_AT_TI_symbol_name("_FreqX")
	.dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$86	.dwtag  DW_TAG_member
	.dwattr $C$DW$86, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$86, DW_AT_name("FreqY")
	.dwattr $C$DW$86, DW_AT_TI_symbol_name("_FreqY")
	.dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$23

$C$DW$T$2	.dwtag  DW_TAG_unspecified_type
	.dwattr $C$DW$T$2, DW_AT_name("void")

$C$DW$T$4	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
	.dwattr $C$DW$T$4, DW_AT_name("bool")
	.dwattr $C$DW$T$4, DW_AT_byte_size(0x01)

$C$DW$T$5	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
	.dwattr $C$DW$T$5, DW_AT_name("signed char")
	.dwattr $C$DW$T$5, DW_AT_byte_size(0x01)

$C$DW$T$6	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
	.dwattr $C$DW$T$6, DW_AT_name("unsigned char")
	.dwattr $C$DW$T$6, DW_AT_byte_size(0x01)

$C$DW$T$7	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
	.dwattr $C$DW$T$7, DW_AT_name("wchar_t")
	.dwattr $C$DW$T$7, DW_AT_byte_size(0x01)

$C$DW$T$8	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
	.dwattr $C$DW$T$8, DW_AT_name("short")
	.dwattr $C$DW$T$8, DW_AT_byte_size(0x01)

$C$DW$T$9	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr $C$DW$T$9, DW_AT_name("unsigned short")
	.dwattr $C$DW$T$9, DW_AT_byte_size(0x01)

$C$DW$T$10	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
	.dwattr $C$DW$T$10, DW_AT_name("int")
	.dwattr $C$DW$T$10, DW_AT_byte_size(0x01)

$C$DW$T$30	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$T$30, DW_AT_address_class(0x20)

$C$DW$T$11	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr $C$DW$T$11, DW_AT_name("unsigned int")
	.dwattr $C$DW$T$11, DW_AT_byte_size(0x01)

$C$DW$T$12	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
	.dwattr $C$DW$T$12, DW_AT_name("long")
	.dwattr $C$DW$T$12, DW_AT_byte_size(0x02)


$C$DW$T$21	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$T$21, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$21, DW_AT_byte_size(0x80)
$C$DW$87	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$87, DW_AT_upper_bound(0x3f)

	.dwendtag $C$DW$T$21

$C$DW$T$19	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$19, DW_AT_name("_iq")
	.dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)


$C$DW$T$20	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$T$20, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$20, DW_AT_byte_size(0x80)
$C$DW$88	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$88, DW_AT_upper_bound(0x3f)

	.dwendtag $C$DW$T$20

$C$DW$T$13	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr $C$DW$T$13, DW_AT_name("unsigned long")
	.dwattr $C$DW$T$13, DW_AT_byte_size(0x02)

$C$DW$T$14	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
	.dwattr $C$DW$T$14, DW_AT_name("long long")
	.dwattr $C$DW$T$14, DW_AT_byte_size(0x04)

$C$DW$T$15	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
	.dwattr $C$DW$T$15, DW_AT_byte_size(0x04)

$C$DW$T$16	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
	.dwattr $C$DW$T$16, DW_AT_name("float")
	.dwattr $C$DW$T$16, DW_AT_byte_size(0x02)

$C$DW$T$17	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
	.dwattr $C$DW$T$17, DW_AT_name("double")
	.dwattr $C$DW$T$17, DW_AT_byte_size(0x02)

$C$DW$T$18	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
	.dwattr $C$DW$T$18, DW_AT_name("long double")
	.dwattr $C$DW$T$18, DW_AT_byte_size(0x04)

$C$DW$89	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$89, DW_AT_type(*$C$DW$T$5)

$C$DW$T$25	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$25, DW_AT_type(*$C$DW$89)

$C$DW$T$26	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$T$26, DW_AT_address_class(0x20)

