TMS320C2000 Assembler PC v15.12.1 Mon Aug 29 15:38:15 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
IQsample.asm                                                         PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                   PC v15.12.1.LTS *
       3              ;* Date/Time created: Mon Aug 29 15:38:15 2016                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --float_support=fpu32 --hll_source=on --mem_model:code=flat --mem_model:
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("D:/work/DSP/ProgramBomb/ProgramBombDebug/math/IQmath/v160/examples_ccsv
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v15.12.1.LTS Copyright (c) 1996-201
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\work\DSP\ProgramBomb\ProgramBombDebug\math\IQmath\v160\examples_
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *

         0000001b 0061 
         0000001c 0075 
         0000001d 006C 
         0000001e 0074 
         0000001f 0020 
         00000020 003D 
         00000021 0020 
         00000022 0031 
         00000023 002E 
         00000024 0030 
         00000025 0029 
         00000026 003D 
         00000027 0020 
         00000028 0000 
     823                      .align  2
     824 0000002a 000A  $C$FSL2:        .string 10,"Enter waveform X freq (default = 1.0)= ",0
         0000002b 0045 
         0000002c 006E 
         0000002d 0074 
         0000002e 0065 
         0000002f 0072 
         00000030 0020 
         00000031 0077 
         00000032 0061 
         00000033 0076 
         00000034 0065 
         00000035 0066 
         00000036 006F 
TMS320C2000 Assembler PC v15.12.1 Mon Aug 29 15:38:15 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
IQsample.asm                                                         PAGE   19

         00000037 0072 
         00000038 006D 
         00000039 0020 
         0000003a 0058 
         0000003b 0020 
         0000003c 0066 
         0000003d 0072 
         0000003e 0065 
         0000003f 0071 
         00000040 0020 
         00000041 0028 
         00000042 0064 
         00000043 0065 
         00000044 0066 
         00000045 0061 
         00000046 0075 
         00000047 006C 
         00000048 0074 
         00000049 0020 
         0000004a 003D 
         0000004b 0020 
         0000004c 0031 
         0000004d 002E 
         0000004e 0030 
         0000004f 0029 
         00000050 003D 
         00000051 0020 
         00000052 0000 
     825                      .align  2
     826 00000054 000A  $C$FSL3:        .string 10,"Enter waveform Y gain (default = 1.0)= ",0
         00000055 0045 
         00000056 006E 
         00000057 0074 
         00000058 0065 
         00000059 0072 
         0000005a 0020 
         0000005b 0077 
         0000005c 0061 
         0000005d 0076 
         0000005e 0065 
         0000005f 0066 
         00000060 006F 
         00000061 0072 
         00000062 006D 
         00000063 0020 
         00000064 0059 
         00000065 0020 
         00000066 0067 
         00000067 0061 
         00000068 0069 
         00000069 006E 
         0000006a 0020 
         0000006b 0028 
         0000006c 0064 
         0000006d 0065 
TMS320C2000 Assembler PC v15.12.1 Mon Aug 29 15:38:15 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
IQsample.asm                                                         PAGE   20

         0000006e 0066 
         0000006f 0061 
         00000070 0075 
         00000071 006C 
         00000072 0074 
         00000073 0020 
         00000074 003D 
         00000075 0020 
         00000076 0031 
         00000077 002E 
         00000078 0030 
         00000079 0029 
         0000007a 003D 
         0000007b 0020 
         0000007c 0000 
     827                      .align  2
     828 0000007e 000A  $C$FSL4:        .string 10,"Enter waveform Y freq (default = 1.0)= ",0
         0000007f 0045 
         00000080 006E 
         00000081 0074 
         00000082 0065 
         00000083 0072 
         00000084 0020 
         00000085 0077 
         00000086 0061 
         00000087 0076 
         00000088 0065 
         00000089 0066 
         0000008a 006F 
         0000008b 0072 
         0000008c 006D 
         0000008d 0020 
         0000008e 0059 
         0000008f 0020 
         00000090 0066 
         00000091 0072 
         00000092 0065 
         00000093 0071 
         00000094 0020 
         00000095 0028 
         00000096 0064 
         00000097 0065 
         00000098 0066 
         00000099 0061 
         0000009a 0075 
         0000009b 006C 
         0000009c 0074 
         0000009d 0020 
         0000009e 003D 
         0000009f 0020 
         000000a0 0031 
         000000a1 002E 
         000000a2 0030 
         000000a3 0029 
         000000a4 003D 
TMS320C2000 Assembler PC v15.12.1 Mon Aug 29 15:38:15 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
IQsample.asm                                                         PAGE   21

         000000a5 0020 
         000000a6 0000 
     829              ;**************************************************************
     830              ;* UNDEFINED EXTERNAL REFERENCES                              *
     831              ;**************************************************************
     832                      .global _puts
     833                      .global __IQ24mag
     834                      .global __IQ24exp
     835                      .global __IQ24mpyI32int
     836                      .global __IQ24log
     837                      .global __atoIQN
     838                      .global _gets
     839                      .global __IQ24div
     840                      .global __IQ24acos
     841                      .global __IQ24atan2PU
     842                      .global __IQ24sin
     843                      .global FD$$MPY
     844                      .global U$$TOFD
     845                      .global FD$$TOL
     846              
     847              ;***************************************************************
     848              ;* TYPE INFORMATION                                            *
     849              ;***************************************************************
     850              
     851              $C$DW$T$22      .dwtag  DW_TAG_structure_type
     852                      .dwattr $C$DW$T$22, DW_AT_name("DATA_LOG_C")
     853                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x300)
     854              $C$DW$72        .dwtag  DW_TAG_member
     855                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$20)
     856                      .dwattr $C$DW$72, DW_AT_name("Xwaveform")
     857                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_Xwaveform")
     858                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     859                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
     860              
     861              $C$DW$73        .dwtag  DW_TAG_member
     862                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$20)
     863                      .dwattr $C$DW$73, DW_AT_name("Ywaveform")
     864                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_Ywaveform")
     865                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
     866                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
     867              
     868              $C$DW$74        .dwtag  DW_TAG_member
     869                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$21)
     870                      .dwattr $C$DW$74, DW_AT_name("Phase")
     871                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_Phase")
     872                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
     873                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
     874              
     875              $C$DW$75        .dwtag  DW_TAG_member
     876                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$20)
     877                      .dwattr $C$DW$75, DW_AT_name("Mag")
     878                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_Mag")
     879                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x180]
     880                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
     881              
TMS320C2000 Assembler PC v15.12.1 Mon Aug 29 15:38:15 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
IQsample.asm                                                         PAGE   22

     882              $C$DW$76        .dwtag  DW_TAG_member
     883                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$20)
     884                      .dwattr $C$DW$76, DW_AT_name("Exp")
     885                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_Exp")
     886                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x200]
     887                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
     888              
     889              $C$DW$77        .dwtag  DW_TAG_member
     890                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$20)
     891                      .dwattr $C$DW$77, DW_AT_name("Log")
     892                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_Log")
     893                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x280]
     894                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
     895              
     896                      .dwendtag $C$DW$T$22
     897              
     898              
     899              $C$DW$T$23      .dwtag  DW_TAG_structure_type
     900                      .dwattr $C$DW$T$23, DW_AT_name("STEP")
     901                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x12)
     902              $C$DW$78        .dwtag  DW_TAG_member
     903                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$19)
     904                      .dwattr $C$DW$78, DW_AT_name("Xsize")
     905                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_Xsize")
     906                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     907                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
     908              
     909              $C$DW$79        .dwtag  DW_TAG_member
     910                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$19)
     911                      .dwattr $C$DW$79, DW_AT_name("Ysize")
     912                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_Ysize")
     913                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     914                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
     915              
     916              $C$DW$80        .dwtag  DW_TAG_member
     917                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$19)
     918                      .dwattr $C$DW$80, DW_AT_name("Yoffset")
     919                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_Yoffset")
     920                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     921                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
     922              
     923              $C$DW$81        .dwtag  DW_TAG_member
     924                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$19)
     925                      .dwattr $C$DW$81, DW_AT_name("X")
     926                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_X")
     927                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     928                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
     929              
     930              $C$DW$82        .dwtag  DW_TAG_member
     931                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$19)
     932                      .dwattr $C$DW$82, DW_AT_name("Y")
     933                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_Y")
     934                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     935                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
     936              
TMS320C2000 Assembler PC v15.12.1 Mon Aug 29 15:38:15 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
IQsample.asm                                                         PAGE   23

     937              $C$DW$83        .dwtag  DW_TAG_member
     938                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$19)
     939                      .dwattr $C$DW$83, DW_AT_name("GainX")
     940                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_GainX")
     941                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     942                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
     943              
     944              $C$DW$84        .dwtag  DW_TAG_member
     945                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$19)
     946                      .dwattr $C$DW$84, DW_AT_name("GainY")
     947                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_GainY")
     948                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     949                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
     950              
     951              $C$DW$85        .dwtag  DW_TAG_member
     952                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$19)
     953                      .dwattr $C$DW$85, DW_AT_name("FreqX")
     954                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_FreqX")
     955                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
     956                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
     957              
     958              $C$DW$86        .dwtag  DW_TAG_member
     959                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$19)
     960                      .dwattr $C$DW$86, DW_AT_name("FreqY")
     961                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_FreqY")
     962                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     963                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
     964              
     965                      .dwendtag $C$DW$T$23
     966              
     967              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
     968                      .dwattr $C$DW$T$2, DW_AT_name("void")
     969              
     970              $C$DW$T$4       .dwtag  DW_TAG_base_type
     971                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
     972                      .dwattr $C$DW$T$4, DW_AT_name("bool")
     973                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
     974              
     975              $C$DW$T$5       .dwtag  DW_TAG_base_type
     976                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
     977                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
     978                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
     979              
     980              $C$DW$T$6       .dwtag  DW_TAG_base_type
     981                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
     982                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
     983                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
     984              
     985              $C$DW$T$7       .dwtag  DW_TAG_base_type
     986                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
     987                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
     988                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
     989              
     990              $C$DW$T$8       .dwtag  DW_TAG_base_type
     991                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
TMS320C2000 Assembler PC v15.12.1 Mon Aug 29 15:38:15 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
IQsample.asm                                                         PAGE   24

     992                      .dwattr $C$DW$T$8, DW_AT_name("short")
     993                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
     994              
     995              $C$DW$T$9       .dwtag  DW_TAG_base_type
     996                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
     997                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
     998                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
     999              
    1000              $C$DW$T$10      .dwtag  DW_TAG_base_type
    1001                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    1002                      .dwattr $C$DW$T$10, DW_AT_name("int")
    1003                      .dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
    1004              
    1005              $C$DW$T$30      .dwtag  DW_TAG_pointer_type
    1006                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$10)
    1007                      .dwattr $C$DW$T$30, DW_AT_address_class(0x20)
    1008              
    1009              $C$DW$T$11      .dwtag  DW_TAG_base_type
    1010                      .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    1011                      .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
    1012                      .dwattr $C$DW$T$11, DW_AT_byte_size(0x01)
    1013              
    1014              $C$DW$T$12      .dwtag  DW_TAG_base_type
    1015                      .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
    1016                      .dwattr $C$DW$T$12, DW_AT_name("long")
    1017                      .dwattr $C$DW$T$12, DW_AT_byte_size(0x02)
    1018              
    1019              
    1020              $C$DW$T$21      .dwtag  DW_TAG_array_type
    1021                      .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$12)
    1022                      .dwattr $C$DW$T$21, DW_AT_language(DW_LANG_C)
    1023                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x80)
